Repository: python/python-docs-pl
Catalog: tutorial/appendix.po
Languages: pl

source: Appendix
pl: Dodatek

source: Interactive Mode
pl: Tryb interaktywny

source: Error Handling
pl: Przechwytywanie błędów

source: When an error occurs, the interpreter prints an error message and a stack trace. In interactive mode, it then returns to the primary prompt; when input came from a file, it exits with a nonzero exit status after printing the stack trace. (Exceptions handled by an :keyword:`except` clause in a :keyword:`try` statement are not errors in this context.) Some errors are unconditionally fatal and cause an exit with a nonzero exit; this applies to internal inconsistencies and some cases of running out of memory. All error messages are written to the standard error stream; normal output from executed commands is written to standard output.
pl: Gdy wystąpi błąd, interpreter wyświetla komunikat błędu i ślad stosu. W trybie interaktywnym zwraca je do wiersza polecenia; jeżeli wejście pochodzi z pliku, na wyjściu generowany jest kod wyjścia różny od zera po wyświetleniu śladu stosu. (Błędy przechwycone przez słowo kluczowe :keyword:`except` w poleceniu :keyword:`try` nie są błędami w tym kontekście). Niektóre błędy są bezwarunkowo krytyczne i wywołują wyjście z programu z kodem wyjścia różnym od zera; dotyczy to wewnętrznych niezgodności i - w niektórych przypadkach - przepełnienia pamięci. Wszystkie komunikaty błędów są wyświetlane na standardowym wyjściu błędów; zazwyczaj jest to normalne wyjście z wykonywania komend.

source: Typing the interrupt character (usually :kbd:`Control-C` or :kbd:`Delete`) to the primary or secondary prompt cancels the input and returns to the primary prompt. [#]_ Typing an interrupt while a command is executing raises the :exc:`KeyboardInterrupt` exception, which may be handled by a :keyword:`try` statement.
pl: Wpisanie znaku przerwania (zazwyczaj :kbd:`Control-C` lub :kbd:`Delete`) w pierwszorzędny lub drugorzędny prompt anuluje tryb wpisywania i wraca do pierwszorzędnego prompta. [#]_ Wpisanie znaku przerwania podczas wykonywania komendy wywołuje wyjątek :exc:`KeyboardInterrupt`, który może być obsłużony instrukcją :keyword:`try`.

source: Executable Python Scripts
pl: Wykonywalne skrypty Pythona

source: On BSD'ish Unix systems, Python scripts can be made directly executable, like shell scripts, by putting the line ::
pl: W systemach uniksowych podobnych do BSD, skrypty Pythona można uczynić bezpośrednio wykonywalnymi, jak skrypty shell, przez dodanie linii ::

source: (assuming that the interpreter is on the user's :envvar:`PATH`) at the beginning of the script and giving the file an executable mode. The ``#!`` must be the first two characters of the file. On some platforms, this first line must end with a Unix-style line ending (``'\n'``), not a Windows (``'\r\n'``) line ending. Note that the hash, or pound, character, ``'#'``, is used to start a comment in Python.
pl: (zakładając, że interpreter jest na zmiennej :envvar:`PATH` użytkownika) na początku skryptu i nadając plikowi tryb wykonywalny. ``#!`` muszą być pierwszymi dwoma znakami pliku. Na niektórych platformach ta pierwsza linia musi kończyć się uniksowym zakończeniem linii (``'\n'``), nie windowsowym zakończeniem linii (``'\r\n'``). Zwróć uwagę, że znak kratki, czy krzyżyka, ``'#'``, jest używany do rozpoczęcia komentarza w Pythonie.

source: The script can be given an executable mode, or permission, using the :program:`chmod` command.
pl: Skryptowi można nadać tryb wykonywalny, lub permission, przy użyciu komendy :program:`chmod`.

source: On Windows systems, there is no notion of an "executable mode". The Python installer automatically associates ``.py`` files with ``python.exe`` so that a double-click on a Python file will run it as a script. The extension can also be ``.pyw``, in that case, the console window that normally appears is suppressed.
pl: W systemach Windows nie wyróżnia się „trybu wykonywalnego”. Instalator Pythona automatycznie powiązuje pliki ``.py`` z ``python.exe``, żeby podwójne kliknięcie w plik Pythona uruchomiło go jako skrypt. Rozszerzeniem może być również ``.pyw``. W tym przypadku okno konsoli, które normalnie się pojawia, zostanie ukryte.

source: The Interactive Startup File
pl: Plik interaktywnego uruchomienia

source: When you use Python interactively, it is frequently handy to have some standard commands executed every time the interpreter is started. You can do this by setting an environment variable named :envvar:`PYTHONSTARTUP` to the name of a file containing your start-up commands. This is similar to the :file:`.profile` feature of the Unix shells.
pl: Gdy używasz Pythona w trybie interaktywnym, często wygodne jest wykonywać jakieś standardowe komendy za każdym razem, gdy uruchamia się interpreter. Możesz to zrobić ustawiając zmienną środowiskową o nazwie :envvar:`PYTHONSTARTUP` na nazwę pliku zawierającego twoje komendy uruchomieniowe. Jest to podobne do funkcji :file:`.profile` shellów uniksowych.

source: This file is only read in interactive sessions, not when Python reads commands from a script, and not when :file:`/dev/tty` is given as the explicit source of commands (which otherwise behaves like an interactive session). It is executed in the same namespace where interactive commands are executed, so that objects that it defines or imports can be used without qualification in the interactive session. You can also change the prompts ``sys.ps1`` and ``sys.ps2`` in this file.
pl: Ten plik jest czytany tylko w sesjach interaktywnych, nie gdy Python czyta komendy ze skryptu i nie gdy :file:`/dev/tty` jest podany jako źródło komend (które zachowuje się jak sesja interaktywna). Jest wykonywany w tym samym namespace'ie, w którym wykonują się interaktywne komendy, więc obiekty, które definiuje lub importuje mogą być używane bezpośrednio w interaktywnej sesji. Możesz również zmienić znaki prompt ``sys.ps1`` i ``sys.ps2`` w tym pliku.

source: Footnotes
pl: Przypisy

source: A problem with the GNU Readline package may prevent this.
pl: Problem z pakietem GNU Readline może w tym przeszkodzić.
