Repository: python/python-docs-pl
Catalog: tutorial/controlflow.po
Languages: pl

source: :term:`Annotations <function annotation>` are stored in the :attr:`__annotations__` attribute of the function as a dictionary and have no effect on any other part of the function. Parameter annotations are defined by a colon after the parameter name, followed by an expression evaluating to the value of the annotation. Return annotations are defined by a literal ``->``, followed by an expression, between the parameter list and the colon denoting the end of the :keyword:`def` statement. The following example has a required argument, an optional argument, and the return value annotated::
pl: :term:`Adnotacje <function annotation>` przechowywane są w atrybucie :attr:`__annotations__` funkcji jako słownik i nie mają oprócz żadnego innego wpływu na nią. Adnotacje parametrów są definiowane po nazwie parametru i dwukropku, jako wyrażenie sprawdzające wartość argumentu. Adonotacje do zwracanego wyniku definiuje się pomiędzy nawiasem z listą parametrów a drukropkiem kończącym instrukcję :keyword:`def` , poprzez literał ``->``, z następującym po nim wyrażeniem. Poniższy przykład ma adnotację dotyczącą argumentu wymaganego, argumentu opcjonalnego oraz adnotację zwracanego wyniku::

source: Intermezzo: Coding Style
pl: Intermezzo: Styl kodowania

source: Now that you are about to write longer, more complex pieces of Python, it is a good time to talk about *coding style*. Most languages can be written (or more concise, *formatted*) in different styles; some are more readable than others. Making it easy for others to read your code is always a good idea, and adopting a nice coding style helps tremendously for that.
pl: Teraz, kiedy już jesteś gotowa(-wy) aby pisać dłuższe, bardziej złożone pythonowe dzieła, dobrze żebyśmy porozmawiali o *stylu kodowania*. Większość języków może być pisana (a mówiąc precyzyjniej, *formatowana*) w różnym stylu; bardziej lub mniej czytelnym. Zawsze dobrze jest dążyć, aby twój kod był łatwy do czytania przez innych a w tym bardzo pomaga stosowanie fajnego stylu kodowania.

source: For Python, :pep:`8` has emerged as the style guide that most projects adhere to; it promotes a very readable and eye-pleasing coding style. Every Python developer should read it at some point; here are the most important points extracted for you:
pl: Dla Pythona :pep:`8` stał się wzorcem stylu, którego trzyma się większość projektów; szerzy czytelny i miły dla oka styl kodowania. W którymś momencie, powinien go przeczytać każdy developer Pythona, poniżej przedstawiliśmy jego najistotniejsze elementy:

source: Use 4-space indentation, and no tabs.
pl: Jako wcięcie, wykorzystuj cztery spacje, nie tabulator.

source: 4 spaces are a good compromise between small indentation (allows greater nesting depth) and large indentation (easier to read). Tabs introduce confusion, and are best left out.
pl: Cztery spacje są dobrym kompromisem pomiędzy płytkim wcięciem (pozwala na więcej kroków zagnieżdżania ) a głębokim wcięciem (jest łatwiejsze do przeczytania). Tabulatorów najlepiej nie używać, wprowadzają zamiesznie.

source: Wrap lines so that they don't exceed 79 characters.
pl: Zawijaj linie tak, aby nie ich długość nie przekraczała 79 znaków.

source: This helps users with small displays and makes it possible to have several code files side-by-side on larger displays.
pl: To pomoże użytkownikom z małymi wyświetlaczami a na większych ekranach pozwoli mieć kilka plików obok siebie na ekranie.

source: Use blank lines to separate functions and classes, and larger blocks of code inside functions.
pl: Wstawiaj puste linie aby oddzielić od siebie funkcje, klasy lub większe bloki kodu wewnątrz funkcji.

source: When possible, put comments on a line of their own.
pl: Jeśli jest to możliwe, wstawiaj komentarze w oddzielnej linii.

source: Use docstrings.
pl: Wykorzystuj docstringi

source: Use spaces around operators and after commas, but not directly inside bracketing constructs: ``a = f(1, 2) + g(3, 4)``.
pl: Korzystaj ze spacji naokoło operatorów oraz za przecinkami, ale nie przy nawiasach: ``a = f(1, 2) + g(3, 4)``.

source: Name your classes and functions consistently; the convention is to use ``UpperCamelCase`` for classes and ``lowercase_with_underscores`` for functions and methods. Always use ``self`` as the name for the first method argument (see :ref:`tut-firstclasses` for more on classes and methods).
pl: Nazywaj klasy i funkcje w konsekwentny sposób. Preferowaną konwencją jest "UpperCamelCase" dla nazw klas i "lowercase_with_underscores" dla funkcji i metod. Zawsze wykorzystuj "self" jako nazwę dla pierwszego argumentu metody (zobacz :ref:`tut-firstclasses` aby dowiedzieć się więcej o klasach i metodach).

source: Don't use fancy encodings if your code is meant to be used in international environments. Python's default, UTF-8, or even plain ASCII work best in any case.
pl: Nie wykorzystuj wymyślnych zestawów znaków jeśli twój kod będzie wykorzystywany międzynarodowo. Najlepiej trzymać się domyślnych w Pythonie: UTF-8 lub nawet ASCII.

source: Likewise, don't use non-ASCII characters in identifiers if there is only the slightest chance people speaking a different language will read or maintain the code.
pl: Podobnie, nie korzystaj ze znaków innych niż ASCII jako identyfikatorów, jeśli jest chociaż szansa, że osoby mówiące innym językiem będą czytać lub rozwijać Twój kod.

source: Footnotes
pl: Przypisy

source: Actually, *call by object reference* would be a better description, since if a mutable object is passed, the caller will see any changes the callee makes to it (items inserted into a list).
pl: Tak właściwie, *wywołanie przez referencję do obiektu* byłoby lepszym opisem, jako że jeśli mutowalny obiekt jest przekazany, wszystkie zmiany które wywoływany robi (elementy wstawiane na listę) będą widziane przez wywołującego.

source: statement
pl: instrukcja

source: docstrings
pl: docstringi

source: * (asterisk)
pl: * (asterysk)

source: function
pl: funkcja

source: annotations
pl: adnotacje typów

source: function annotations
pl: adnotacje typów funkcji

source: : (colon)
pl: : (dwukropek)

source: coding
pl: kodowanie

source: style
pl: styl
