Repository: python/python-docs-pl
Catalog: tutorial/controlflow.po
Languages: pl

source: This example, as usual, demonstrates some new Python features:
pl: Ten przykład, jak zazwyczaj, prezentuje nowe cechy Pythona:

source: The :keyword:`return` statement returns with a value from a function. :keyword:`!return` without an expression argument returns ``None``. Falling off the end of a function also returns ``None``.
pl: Instrukcja :keyword:`return` zwraca wartość funkcji. :keyword:`!return` bez wyrażenia podanego jako argument zwraca ``None``. Dojście do końca funkcji również zwraca ``None``.

source: The statement ``result.append(a)`` calls a *method* of the list object ``result``. A method is a function that 'belongs' to an object and is named ``obj.methodname``, where ``obj`` is some object (this may be an expression), and ``methodname`` is the name of a method that is defined by the object's type. Different types define different methods. Methods of different types may have the same name without causing ambiguity. (It is possible to define your own object types and methods, using *classes*, see :ref:`tut-classes`) The method :meth:`append` shown in the example is defined for list objects; it adds a new element at the end of the list. In this example it is equivalent to ``result = result + [a]``, but more efficient.
pl: Instrukcja ``result.append(a)`` wywołuje *metodę* listy obiektów ``result``. Metoda to funkcja, która „należy” do obiektu i jest nazwana ``obj.methodname``, gdzie ``obj`` jest jakimś obiektem (może też być wyrażeniem) a ``methodname`` jest nazwą metody, które jest zdefiniowana przez typ obiektu. Różne typy definiują różne metody. Metody różnych typów mogą mieć te same nazwy bez powodowania dwuznaczności. (Da się definiować własne typy obiektów i metody, używając *klas*, patrz :ref:`tut-classes`.) Metoda :meth:`append` pokazana w przykładzie jest zdefiniowana dla listy obiektów; dodaje nowy element na końcu listy. W tym przykładzie jest równoważna ``result = result + [a]``, ale bardziej wydajna.

source: More on Defining Functions
pl: Więcej o definiowaniu funkcji

source: It is also possible to define functions with a variable number of arguments. There are three forms, which can be combined.
pl: Można też definiować funkcje ze zmienną liczbą argumentów. Są trzy sposoby, które można łączyć.

source: Default Argument Values
pl: Domyślne wartości argumentów

source: The most useful form is to specify a default value for one or more arguments. This creates a function that can be called with fewer arguments than it is defined to allow. For example::
pl: Najbardziej przydatnym sposobem jest podanie domyślnej wartości dla jednego lub więcej argumentów. Tworzy to funkcję, która może zostać wywołana z mniejszą liczbą argumentów, niż jest podane w jej definicji. Na przykład::

source: This function can be called in several ways:
pl: Tę funkcję można wywołać na kilka sposobów:

source: giving only the mandatory argument: ``ask_ok('Do you really want to quit?')``
pl: podając tylko wymagany argument: ``ask_ok('Do you really want to quit?')``

source: giving one of the optional arguments: ``ask_ok('OK to overwrite the file?', 2)``
pl: podając jeden z opcjonalnych argumentów: ``ask_ok('OK to overwrite the file?', 2)``

source: or even giving all arguments: ``ask_ok('OK to overwrite the file?', 2, 'Come on, only yes or no!')``
pl: lub podając wszystkie argumenty: ``ask_ok('OK to overwrite file?', 2, 'Come on, only yes or no!')``

source: This example also introduces the :keyword:`in` keyword. This tests whether or not a sequence contains a certain value.
pl: Ten przykład wprowadza słowo kluczowe :keyword:`in`. Sprawdza ono, czy sekwencja zawiera szczególną wartość.

source: The default values are evaluated at the point of function definition in the *defining* scope, so that ::
pl: Wartości domyślne są ewaluowane w momencie definiowania funkcji w scopie *defining*, więc ::

source: will print ``5``.
pl: wyświetli ``5``.

source: **Important warning:** The default value is evaluated only once. This makes a difference when the default is a mutable object such as a list, dictionary, or instances of most classes. For example, the following function accumulates the arguments passed to it on subsequent calls::
pl: **Ważna uwaga**: Wartość domyślna jest wyliczana tylko raz. Ma to znaczenie, gdy domyślna wartość jest obiektem mutowalnym takim jak lista, słownik lub instancje większości klas. Na przykład następująca funkcja akumuluje argumenty przekazane do niej w kolejnych wywołaniach::

source: This will print ::
pl: To wyświetli ::

source: If you don't want the default to be shared between subsequent calls, you can write the function like this instead::
pl: Jeśli nie chcesz, żeby domyślna wartość była współdzielona pomiędzy kolejnymi wywołaniami, możesz napisać funkcję w ten sposób::

source: Keyword Arguments
pl: Argumenty nazwane

source: Functions can also be called using :term:`keyword arguments <keyword argument>` of the form ``kwarg=value``. For instance, the following function::
pl: Funkcje mogą być również wywoływane przy użyciu :term:`argumentów nazwanych <keyword argument>` w formie ``kwarg=value``. Na przykład poniższa funkcja::

source: accepts one required argument (``voltage``) and three optional arguments (``state``, ``action``, and ``type``). This function can be called in any of the following ways::
pl: akceptuje jeden wymagany argument (``voltage``) i trzy opcjonalne argumenty (``state``, ``action`` i ``type``). Funkcja może być wywołana w dowolny z poniższych sposobów::

source: but all the following calls would be invalid::
pl: ale wszystkie poniższe wywołania byłyby niepoprawne::

source: In a function call, keyword arguments must follow positional arguments. All the keyword arguments passed must match one of the arguments accepted by the function (e.g. ``actor`` is not a valid argument for the ``parrot`` function), and their order is not important. This also includes non-optional arguments (e.g. ``parrot(voltage=1000)`` is valid too). No argument may receive a value more than once. Here's an example that fails due to this restriction::
pl: W wywołaniu funkcji argumenty nazwane muszą znajdować się za argumentami pozycyjnymi. Wszystkie przekazane argumenty nazwane muszą pasować do jednego argumentu akceptowanego przez funkcję (na przykład ``actor`` nie jest poprawnym argumentem dla funkcji ``parrot``) a ich kolejność nie ma znaczenia. Dotyczy to również nie-opcjonalnych argumentów (na przykład ``parrot(voltage=1000)`` też jest poprawne). Żaden argument nie może otrzymać wartości więcej niż raz. Tutaj jest przykład, który się nie powiedzie z powodu tego ograniczenia::

source: When a final formal parameter of the form ``**name`` is present, it receives a dictionary (see :ref:`typesmapping`) containing all keyword arguments except for those corresponding to a formal parameter. This may be combined with a formal parameter of the form ``*name`` (described in the next subsection) which receives a :ref:`tuple <tut-tuples>` containing the positional arguments beyond the formal parameter list. (``*name`` must occur before ``**name``.) For example, if we define a function like this::
pl: Kiedy ostatni formalny parametr ma postać ``**nazwa``, to otrzymuje on słownik (zobacz :ref:`typesmapping`) zawierający wszystkie argumenty kluczowe oprócz tych które odpowiadają formalnym parametrom. Może to być połączone z formalnym parametrem o postaci ``*nazwa`` (opisanym w następnej subsekcji) który otrzymuje :ref:`krotkę <tut-tuples>` zawierającą argumenty pozycyjne z poza listy formalnych parametrów. (``*nazwa`` musi występować przed ``**nazwa``.) Dla przykładu możemy zdefiniować funkcję tak::

source: It could be called like this::
pl: Można ją wywołać w ten sposób::

source: and of course it would print:
pl: i oczywiście wyświetli się nam:

source: Note that the order in which the keyword arguments are printed is guaranteed to match the order in which they were provided in the function call.
pl: Zwróć uwagę, że kolejność w jakim argumenty kluczowe są wyświetlane dokładnie odpowiada kolejności w jakim zostały one podane w wywołaniu funkcji.

source: Special parameters
pl: Parametry specjalne

source: By default, arguments may be passed to a Python function either by position or explicitly by keyword. For readability and performance, it makes sense to restrict the way arguments can be passed so that a developer need only look at the function definition to determine if items are passed by position, by position or keyword, or by keyword.
pl: Domyślnie, argumenty mogą być przekazywane do funkcji Pythona albo poprzez swoje umiejscowienie (pozycję) albo wprost poprzez słowo kluczowe. Dla czytelności oraz wydajności, ma sens aby ograniczyć sposób w jaki argumenty mogą być przekazywane tak aby deweloper musiał tylko spojrzeć na definicję funkcji aby zrozumieć czy argumenty są przekazywane poprzez pozycję, pozycję i słowa kluczowe czy same słowa kluczowe.

source: A function definition may look like:
pl: Definicja funkcji może wyglądać w ten sposób:

source: where ``/`` and ``*`` are optional. If used, these symbols indicate the kind of parameter by how the arguments may be passed to the function: positional-only, positional-or-keyword, and keyword-only. Keyword parameters are also referred to as named parameters.
pl: gdzie ``/`` i ``*`` są opcjonalne. Jeśli są używane, te symbole wskazują rodzaj parametru poprzez sposób przekazywania argumentów do funkcji: tylko pozycyjne, pozycyjne lub słowo kluczowe i tylko słowo kluczowe. Parametry słów kluczowych są również nazywane parametrami nazwanymi.

source: Positional-or-Keyword Arguments
pl: Argumenty pozycyjne-lub-kluczowe

source: If ``/`` and ``*`` are not present in the function definition, arguments may be passed to a function by position or by keyword.
pl: Jeśli ``/`` czy ``*`` nie są obecne w definicji funkcji, argumenty mogą być przekazywane i poprzez pozycje i przez słowa kluczowe.

source: Positional-Only Parameters
pl: Parametry Tylko-Pozycyjne (Positional-Only)

source: Looking at this in a bit more detail, it is possible to mark certain parameters as *positional-only*. If *positional-only*, the parameters' order matters, and the parameters cannot be passed by keyword. Positional-only parameters are placed before a ``/`` (forward-slash). The ``/`` is used to logically separate the positional-only parameters from the rest of the parameters. If there is no ``/`` in the function definition, there are no positional-only parameters.
pl: Wchodząc w szegóły, można oznaczyć pewne parametry jako *tylko-pozycyjne*. Jeśli argument jest *tylko pozycyjny*, ma znaczenie kolejność parametrów a parametry te nie mogą być przekazywane przez słowa kluczowe. Argumenty tylko-pozycyjne są umieszczane przed ``/`` (forward-slash). ``/`` rozdziela parametry tylko-pozycyjne od reszty parametrów. Jeśli w definicji funkcji nie ma ``/`` , nie ma parametrów tylko pozycyjnych.

source: Parameters following the ``/`` may be *positional-or-keyword* or *keyword-only*.
pl: Argumenty po ``/`` mogą mieć charakter *pozycja-lub-słowo-kluczowe* lub *tylko-kluczowe*.

source: Keyword-Only Arguments
pl: Argumenty Tylko-Kluczowe (Keyword-Only)

source: To mark parameters as *keyword-only*, indicating the parameters must be passed by keyword argument, place an ``*`` in the arguments list just before the first *keyword-only* parameter.
pl: Aby oznaczyć parametry jako *tylko słowa kluczowe* (*keyword-only*), to znaczy wskazać, że parametry muszą być przekazywane przez argument słowa kluczowego, umieść ``*`` na liście argumentów tuż przed pierwszym parametrem, który ma być przekazywany tylko przez słowo kluczowe.

source: Function Examples
pl: Przykłady Funkcji

source: Consider the following example function definitions paying close attention to the markers ``/`` and ``*``::
pl: Rozważ następujące przykłady definicji funkcji, przykładając szczególną uwagę do oznaczeń ``/`` oraz ``*``::

source: The first function definition, ``standard_arg``, the most familiar form, places no restrictions on the calling convention and arguments may be passed by position or keyword::
pl: Pierwsza z definicji, ``standard_arg``, mająca najbardziej znaną formę, nie wprowadza ograniczeń na sposób wywoływania, argumenty mogą być przekazywane poprzez pozycję lub słowo kluczowe::

source: The second function ``pos_only_arg`` is restricted to only use positional parameters as there is a ``/`` in the function definition::
pl: Druga z funkcji ``pos_only_arg`` jest ograniczona do wykorzystywania tylko argumentów pozycyjnych jako, że posiada ``/`` w swojej definicji::

source: The third function ``kwd_only_args`` only allows keyword arguments as indicated by a ``*`` in the function definition::
pl: Trzecia z funkcji ``kwd_only_args`` pozwala tylko na wprowadzanie argumentów w postaci słów kluczowych z powodu ``*`` w swojej definicji::

source: And the last uses all three calling conventions in the same function definition::
pl: Ostatnia z funkcji wykorzystuje wszystkie trzy konwencje w swojej definicji::

source: Finally, consider this function definition which has a potential collision between the positional argument ``name`` and ``**kwds`` which has ``name`` as a key::
pl: Na koniec, przyjrzyj się definicji funkcji, która ma potencjalną kolizję pomiędzy pozycyjnym argumentem ``name`` a ``**kwds`` gdzie ``name`` jest kluczem::

source: There is no possible call that will make it return ``True`` as the keyword ``'name'`` will always bind to the first parameter. For example::
pl: Nie jesteśmy w stanie sprawić, aby ta funkcja zwróciła ``True``, jako że słowo kluczowe ``'name'`` zawsze powiązane będzie z pierwszym parametrem. Dla przykładu::

source: But using ``/`` (positional only arguments), it is possible since it allows ``name`` as a positional argument and ``'name'`` as a key in the keyword arguments::
pl: Korzystając z ``/`` (argumentów tylko-pozycyjnych), da się to zrobić ponieważ pozwala ono na ``name`` jako argument pozycyjny i ``'name'`` jako klucz w argumentach kluczowych::

source: In other words, the names of positional-only parameters can be used in ``**kwds`` without ambiguity.
pl: Innymi słowy, nazwy w argumentach pozycyjnych mogą być bez dwuznaczności wykorzystywane jako klucze w ``**kwds``.

source: Recap
pl: Podsumowanie

source: The use case will determine which parameters to use in the function definition::
pl: Przypadki użycia determinują, jakich typów parametrów kiedy w definicji funkcji::

source: As guidance:
pl: Kieruj się następującym:

source: Use positional-only if you want the name of the parameters to not be available to the user. This is useful when parameter names have no real meaning, if you want to enforce the order of the arguments when the function is called or if you need to take some positional parameters and arbitrary keywords.
pl: Wykorzystuj argumenty tylko-pozycyjne gdy chcesz aby nazwa parametrów nie była dostepna dla użytkownika. To może być pomocne gdy nazwy parametów nie mają specjalnego znaczenia a ty chcesz wymusić określoną kolejność argumentów gdy funkcja jest wywoływana. Ewentualnie gdy chcesz aby część argumentów była pozycyjna a część była jakimiś słowami kluczowymi.

source: Use keyword-only when names have meaning and the function definition is more understandable by being explicit with names or you want to prevent users relying on the position of the argument being passed.
pl: Wykorzystuj argumenty tylko-kluczowe gdy nazwy mają znaczenie i definicja funkcji jest łatwiejsza do zrozumienia poprzez wprost podawanie nazw, lub jeśli nie chcesz aby użytkownicy polegali na kolejności argumentów.

source: For an API, use positional-only to prevent breaking API changes if the parameter's name is modified in the future.
pl: W przypadku budowania API, wykorzystanie argumentów tylko-pozycyjnych pozwoli w przyszłości uniknąć problemów, gdy nazwa parametru jest zmieniona.

source: Arbitrary Argument Lists
pl: Arbitralne listy argumentów

source: Finally, the least frequently used option is to specify that a function can be called with an arbitrary number of arguments. These arguments will be wrapped up in a tuple (see :ref:`tut-tuples`). Before the variable number of arguments, zero or more normal arguments may occur. ::
pl: Najmniej często wykorzystywaną opcją jest specyfikowanie, że funkcja może być wywoływana z arbitralną liczbą argumentów. Takie argumenty zostaną opakowane w krotkę (zobacz :ref:`krotki <tut-tuples>`). Przed zmienną liczbą argumentów, można wymusić jeden lub więcej argumentów. ::

source: Normally, these *variadic* arguments will be last in the list of formal parameters, because they scoop up all remaining input arguments that are passed to the function. Any formal parameters which occur after the ``*args`` parameter are 'keyword-only' arguments, meaning that they can only be used as keywords rather than positional arguments. ::
pl: Zazwyczaj takie argumenty będą ostatnie na liście formalnych parametrów, ponieważ zbierają one wszystkie pozostałe argumenty przekazane funkcji. Każdy formalny argument po parametrze ``*args`` może być 'tylko-kluczowy', to znaczy da się go wprowadzić tylko poprzez słowo kluczowe a nie przez pozycję. ::

source: Unpacking Argument Lists
pl: Rozpakowywanie listy argumentów

source: The reverse situation occurs when the arguments are already in a list or tuple but need to be unpacked for a function call requiring separate positional arguments. For instance, the built-in :func:`range` function expects separate *start* and *stop* arguments. If they are not available separately, write the function call with the ``*``\ -operator to unpack the arguments out of a list or tuple::
pl: Odwrotna sytuacja wystąpi, gdy argumenty już są listą albo krotką a muszą być rozpakowane gdyż funkcja wymaga argumentów przekazanych pozycyjnie, jeden po drugim . Dla przykładu, wbudowana funkcja :func:`range` oczekuje oddzielnych argumentów *start* oraz *stop*. Jeśli nie są dostępne oddzielnie, wywołaj funkcją z operatorem ``*`` aby wypakować argumenty z listy lub krotki::

source: In the same fashion, dictionaries can deliver keyword arguments with the ``**``\ -operator::
pl: W podobny sposób, słowniki moga dostarczać argumentów kluczowych poprzez operator ``**``::

source: Lambda Expressions
pl: Wyrażenia Lambda

source: Small anonymous functions can be created with the :keyword:`lambda` keyword. This function returns the sum of its two arguments: ``lambda a, b: a+b``. Lambda functions can be used wherever function objects are required. They are syntactically restricted to a single expression. Semantically, they are just syntactic sugar for a normal function definition. Like nested function definitions, lambda functions can reference variables from the containing scope::
pl: Niewielkie anonimowe funkcje mogą byś tworzone z wykorzystaniem słowa kluczowego :keyword:`lambda`. Wykorzystując tą notację: ``lambda a, b: a+b`` powstanie funkcja sumująca podane argumenty. Funkcje lambda mogą być wykorzystywane zawsze wtedy gdy potrzebne są objekty funkcji. Są synaktycznie ograniczone do jednego wyrażenia. Semantycznie, jest to tylko lukier składniowy normalnej definicji funkcji. Podobnie jak funkcje zagnieżdżone funkcje lambda mogą odwoływać się do zmiennych z otaczającego zakresu ::

source: The above example uses a lambda expression to return a function. Another use is to pass a small function as an argument::
pl: Powyższy przykład wykorzystuje ekspresję lambda aby zwrócić funkcję. Inne wykorzystanie to przekazanie małej funkcji jako argumentu::

source: Documentation Strings
pl: Napisy dokumentujące (docstringi)

source: Here are some conventions about the content and formatting of documentation strings.
pl: Oto kilka konwencji dotyczących zawartości i formatowania docstringów.

source: The first line should always be a short, concise summary of the object's purpose. For brevity, it should not explicitly state the object's name or type, since these are available by other means (except if the name happens to be a verb describing a function's operation). This line should begin with a capital letter and end with a period.
pl: Pierwsza linijka powinna zawierać zwięzłe streszczenie sensu jaki stoi za obiektem. Nie powinna wprost zawierać nazwy obiektu ani typu, gdyż te są dostępne w inny sposób (chyba, że nazwa jest czasownikiem opisujęcym działanie funkcji). Ta linijka powinna zaczynać się z dużej litery i kończyć kropką.

source: If there are more lines in the documentation string, the second line should be blank, visually separating the summary from the rest of the description. The following lines should be one or more paragraphs describing the object's calling conventions, its side effects, etc.
pl: Jeśli w docstringu jest więcej niż jedna linijka, druga linijka powinna być pusta, aby rozdzielić ją od reszty opisu. Następne linijki powinny zawierać konwencje nazewnicze, efekty uboczne itd.

source: The Python parser does not strip indentation from multi-line string literals in Python, so tools that process documentation have to strip indentation if desired. This is done using the following convention. The first non-blank line *after* the first line of the string determines the amount of indentation for the entire documentation string. (We can't use the first line since it is generally adjacent to the string's opening quotes so its indentation is not apparent in the string literal.) Whitespace "equivalent" to this indentation is then stripped from the start of all lines of the string. Lines that are indented less should not occur, but if they occur all their leading whitespace should be stripped. Equivalence of whitespace should be tested after expansion of tabs (to 8 spaces, normally).
pl: Parser Pythona nie usuwa wcięć z literału stringu wielolinijkowego, więc jeśli to jest pożądane, to narzędzia obrabiające dokumentację powinny usuwać wcięcia. Robi się to, wykorzystując następujące. Pierwsza nie-pusta linijka *po* pierwszej określa jak dużo wcięcia jest w całym docstringu. (Nie można do tego wykorzystać pierwszej linijki, ponieważ ta zazwyczaj przylega do cudzysłowów, więc sposób wcięcia jest nieoczywisty.) "Ilość wcięcia" z tej linijki jest następnie usuwana z tej i wszystkich następnych linijek. W kolejnych linijkach nie powinno być mniej wcięć ale jeśli tak będzie to całość wcięcia powinna być usunięta. Ilość wcięcia powinna być usuwana po zamianie tabulatorów na spacje (zazwyczaj na 8 spacji).

source: Here is an example of a multi-line docstring::
pl: Poniżej przykład wielolinijkowego docstringu::

source: Function Annotations
pl: Adnotacje funkcji

source: :ref:`Function annotations <function>` are completely optional metadata information about the types used by user-defined functions (see :pep:`3107` and :pep:`484` for more information).
pl: :ref:`Adnotacje funkcji <function>` to całkowicie opcjonalne metadane dające informacje o funkcjach zdefiniowanych przez użytkowników (zobacz :pep:`3107` oraz :pep:`484` aby uzyskać więcej informacji).
