Repository: python/python-docs-pl
Catalog: tutorial/controlflow.po
Languages: pl

source: More Control Flow Tools
pl: Więcej narzędzi kontroli przepływu

source: Besides the :keyword:`while` statement just introduced, Python uses the usual flow control statements known from other languages, with some twists.
pl: Oprócz wprowadzonej przed chwilą instrukcji :keyword:`while`, Python używa zwykłych instrukcji kontroli przepływu znanych z innych języków, z drobnymi zmianami.

source: :keyword:`!if` Statements
pl: Instrukcje :keyword:`!if`

source: Perhaps the most well-known statement type is the :keyword:`if` statement. For example::
pl: Prawdopodobnie najbardziej znanym typem instrukcji jest instrukcja :keyword:`if`. Na przykład::

source: There can be zero or more :keyword:`elif` parts, and the :keyword:`else` part is optional. The keyword ':keyword:`!elif`' is short for 'else if', and is useful to avoid excessive indentation. An :keyword:`!if` ... :keyword:`!elif` ... :keyword:`!elif` ... sequence is a substitute for the ``switch`` or ``case`` statements found in other languages.
pl: Części :keyword:`elif` może być zero lub więcej i część :keyword:`else` jest opcjonalna. Keyword „:keyword:`!elif`” jest skrótem od „else if” i jest przydatny by uniknąć nadmiarowych wcięć. Sekwencja :keyword:`!if` … :keyword:`!elif` … :keyword:`!elif` … jest zamiennikiem instrukcji ``switch`` lub ``case`` z innych języków.

source: If you're comparing the same value to several constants, or checking for specific types or attributes, you may also find the :keyword:`!match` statement useful. For more details see :ref:`tut-match`.
pl: Jeśli porównujesz tę samą wartość z wieloma stałymi lub sprawdzasz poszczególne typy lub atrybuty, może ci się przydać instrukcja :keyword:`!match`. Więcej szczegółów znajdziesz w :ref:`tut-match`.

source: :keyword:`!for` Statements
pl: Instrukcje :keyword:`!for`

source: The :keyword:`for` statement in Python differs a bit from what you may be used to in C or Pascal. Rather than always iterating over an arithmetic progression of numbers (like in Pascal), or giving the user the ability to define both the iteration step and halting condition (as C), Python's :keyword:`!for` statement iterates over the items of any sequence (a list or a string), in the order that they appear in the sequence. For example (no pun intended):
pl: Instrukcja :keyword:`for` różni się troszeczkę w Pythonie od tego, co używasz w C lub Pascalu. Nie prowadzi się iteracji od liczby do liczby (jak w Pascalu) lub daje się użytkownikowi możliwość definiowania kroku iteracji i warunki zakończenia iteracji (jak w C). Instrukcja :keyword:`!for` w Pythonie powoduje iterację po elementach jakiejkolwiek sekwencji (listy lub łańcucha znaków), w takim porządku, w jakim są one umieszczone w danej sekwencji. Na przykład (gra słów niezamierzona):

source: Code that modifies a collection while iterating over that same collection can be tricky to get right. Instead, it is usually more straight-forward to loop over a copy of the collection or to create a new collection::
pl: Kod, który zmienia kolekcję podczas iterowania po niej, może być trudny. Zamiast tego, zazwyczaj prostsze jest przejść pętlą po kopii kolekcji lub stworzyć nową kolekcję::

source: The :func:`range` Function
pl: Funkcja :func:`range`

source: If you do need to iterate over a sequence of numbers, the built-in function :func:`range` comes in handy. It generates arithmetic progressions::
pl: Jeśli potrzebujesz iterować po sekwencji liczb, przydatna jest wbudowana funkcja :func:`range`. Generuje ciągi arytmetyczne::

source: The given end point is never part of the generated sequence; ``range(10)`` generates 10 values, the legal indices for items of a sequence of length 10. It is possible to let the range start at another number, or to specify a different increment (even negative; sometimes this is called the 'step')::
pl: Podany punkt końcowy nigdy nie jest częścią generowanej sekwencji; ``range(10)`` generuje 10 wartości, poprawne indeksy dla elementów sekwencji o długości 10. Możliwe jest zacząć zakres od innej liczby lub podać inne zwiększenie (nawet ujemne; czasem jest to nazywane „krokiem”)::

source: To iterate over the indices of a sequence, you can combine :func:`range` and :func:`len` as follows::
pl: By przeiterować po indeksach sekwencji możesz połączyć :func:`range` i :func:`len` w następujący sposób::

source: In most such cases, however, it is convenient to use the :func:`enumerate` function, see :ref:`tut-loopidioms`.
pl: Jednak w większości takich przypadków wygodnie jest użyć funkcji :func:`enumerate`, patrz :ref:`tut-loopidioms`.

source: A strange thing happens if you just print a range::
pl: Dzieje się dziwna rzecz jeśli po prostu wydrukujesz zakres::

source: In many ways the object returned by :func:`range` behaves as if it is a list, but in fact it isn't. It is an object which returns the successive items of the desired sequence when you iterate over it, but it doesn't really make the list, thus saving space.
pl: Pod wieloma względami obiekt zwracany przez :func:`range` zachowuje się, jakby był listą, ale w rzeczywistości nią nie jest. Jest obiektem, który zwraca kolejne elementy żądanej sekwencji w trakcie twojego iterowania po nim, lecz naprawdę nie tworzy listy, tak więc oszczędza miejsce w pamięci komputera.

source: We say such an object is :term:`iterable`, that is, suitable as a target for functions and constructs that expect something from which they can obtain successive items until the supply is exhausted. We have seen that the :keyword:`for` statement is such a construct, while an example of a function that takes an iterable is :func:`sum`::
pl: Mówimy, że taki obiekt to :term:`iterable`, to znaczy odpowiedni jako cel dla funkcji i konstrukcji, które spodziewają się czegoś, z czego można pobierać kolejne elementy aż do wyczerpania zapasu. Widzieliśmy, że instrukcja :keyword:`for` jest takim konstruktem, podczas gdy przykładem funkcji, która spodziewa się obiektu iterable jest :func:`sum`::

source: Later we will see more functions that return iterables and take iterables as arguments. In chapter :ref:`tut-structures`, we will discuss in more detail about :func:`list`.
pl: Później napotkamy więcej funkcji, które zwracają iterable i biorą iterable jako argumenty. W rozdziale :ref:`tut-structures`, omówimy bardziej szczegółowo :func:`list`.

source: :keyword:`!break` and :keyword:`!continue` Statements, and :keyword:`!else` Clauses on Loops
pl: :keyword:`!break` i :keyword:`!continue` oraz klauzula :keyword:`!else` w pętlach

source: The :keyword:`break` statement, like in C, breaks out of the innermost enclosing :keyword:`for` or :keyword:`while` loop.
pl: Instrukcja :keyword:`break`, tak jak w C, wychodzi z najbardziej wewnętrznej pętli :keyword:`for` lub :keyword:`while` zawierającej tę instrukcję.

source: Loop statements may have an :keyword:`!else` clause; it is executed when the loop terminates through exhaustion of the iterable (with :keyword:`for`) or when the condition becomes false (with :keyword:`while`), but not when the loop is terminated by a :keyword:`break` statement. This is exemplified by the following loop, which searches for prime numbers::
pl: Instrukcje pętli mogą mieć klauzulę :keyword:`!else`. Jest ona wykonywana, gdy pętla kończy się przez wyczerpanie się iterable'a (w pętli :keyword:`for`) lub kiedy warunek staje się fałszywy (w pętli :keyword:`while`), lecz nie gdy pętli jest przerwana przez instrukcję :keyword:`break`. Ilustruje to poniższa pętla, która wyszukuje liczby pierwsze::

source: (Yes, this is the correct code. Look closely: the ``else`` clause belongs to the :keyword:`for` loop, **not** the :keyword:`if` statement.)
pl: (Tak, to poprawny kod. Przyjrzyj się: klauzula ``else`` należy do pętli :keyword:`for`, **nie** do instrukcji :keyword:`if`.)

source: When used with a loop, the ``else`` clause has more in common with the ``else`` clause of a :keyword:`try` statement than it does with that of :keyword:`if` statements: a :keyword:`try` statement's ``else`` clause runs when no exception occurs, and a loop's ``else`` clause runs when no ``break`` occurs. For more on the :keyword:`!try` statement and exceptions, see :ref:`tut-handling`.
pl: Gdy używasz jej z pętlą, klauzula ``else`` ma więcej wspólnego z klauzulą ``else`` instrukcji :keyword:`try` niż z tą z instrukcji :keyword:`if`: klauzula ``else`` instrukcji :keyword:`try` jest uruchamiana, gdy nie zostanie zgłoszony wyjątek, a klauzula ``else`` pętli jest uruchamiana, gdy nie wystąpi ``break``. Więcej informacji na temat instrukcji :keyword:`!try` i wyjątków znajdziesz w :ref:`tut-handling`.

source: The :keyword:`continue` statement, also borrowed from C, continues with the next iteration of the loop::
pl: Instrukcja :keyword:`continue`, również pożyczona z C, kontynuuje następną iterację pętli::

source: :keyword:`!pass` Statements
pl: Instrukcje :keyword:`!pass`

source: The :keyword:`pass` statement does nothing. It can be used when a statement is required syntactically but the program requires no action. For example::
pl: Instrukcja :keyword:`pass` nie robi nic. Można jej użyć, gdy składnia wymaga instrukcji a program nie wymaga działania. Na przykład::

source: This is commonly used for creating minimal classes::
pl: Często jej się używa do tworzenia minimalnych klas::

source: Another place :keyword:`pass` can be used is as a place-holder for a function or conditional body when you are working on new code, allowing you to keep thinking at a more abstract level. The :keyword:`!pass` is silently ignored::
pl: Innym miejscem, w którym można użyć :keyword:`pass` to placeholder dla funkcji lub ciała warunku, kiedy pracujesz nad nowym kodem. Pozwoli ci to myśleć na bardziej abstrakcyjnym poziomie. :keyword:`!pass` jest „po cichu” ignorowane::

source: :keyword:`!match` Statements
pl: Instrukcje :keyword:`!match`

source: A :keyword:`match` statement takes an expression and compares its value to successive patterns given as one or more case blocks. This is superficially similar to a switch statement in C, Java or JavaScript (and many other languages), but it's more similar to pattern matching in languages like Rust or Haskell. Only the first pattern that matches gets executed and it can also extract components (sequence elements or object attributes) from the value into variables.
pl: Instrukcja :keyword:`match` bierze wyrażenie i porównuje jego wartość do kolejnych wzorców podanych jako jeden lub więcej blok case. Jest to powierzchownie podobne do instrukcji switch w C, Javie lub JavaScripcie (i wielu innych językach), ale bardziej jest podobne do pattern matchingu w takich językach jak Rust lub Haskell. Jedynie pierwszy pasujący wzorzec jest zostaje wykonany i może on również wydobywać komponenty (elementy sekwencji lub atrybuty obiektu) z wartości do zmiennych.

source: The simplest form compares a subject value against one or more literals::
pl: Najprostsza forma porównuje wartość podmiotu z jednym lub wieloma literałami::

source: Note the last block: the "variable name" ``_`` acts as a *wildcard* and never fails to match. If no case matches, none of the branches is executed.
pl: Zwróć uwagę na ostatni blok: „nazwa zmiennej” ``_`` zachowuje się jak *dzika karta* i zawsze znajduje dopasowanie. Jeśli żaden z case'ów nie będzie dopasowany, żadne z rozgałęzień nie będzie wykonane.

source: You can combine several literals in a single pattern using ``|`` ("or")::
pl: Możesz łączyć kilka literałów w jeden wzorzec używając ``|`` („or”)::

source: Patterns can look like unpacking assignments, and can be used to bind variables::
pl: Wzorce mogą wyglądać jak przypisania rozpakowujące i można ich używać do powiązywania zmiennych::

source: Study that one carefully! The first pattern has two literals, and can be thought of as an extension of the literal pattern shown above. But the next two patterns combine a literal and a variable, and the variable *binds* a value from the subject (``point``). The fourth pattern captures two values, which makes it conceptually similar to the unpacking assignment ``(x, y) = point``.
pl: Przyjrzyj się temu uważnie! Pierwszy wzorzec ma dwa literały i można o nim myśleć jako o rozszerzeniu dosłownego wzorca pokazanego wyżej. Ale następne dwa wzorce składają się z literału i zmiennej. Ta zmienna *wiąże* wartość z podmiotu (``point``). Czwarty wzorzec wyłapuje dwie wartości, co czyni go konceptualnie bliższym do przypisania z „rozpakowaniem” ``(x, y) = point``.

source: If you are using classes to structure your data you can use the class name followed by an argument list resembling a constructor, but with the ability to capture attributes into variables::
pl: Jeśli używasz klas, aby nadać strukturę swoim danym, możesz użyć nazwę klasy oraz listę argumentów przypominającą konstruktor, ale z możliwością wyłapania atrybutów w zmienne::

source: You can use positional parameters with some builtin classes that provide an ordering for their attributes (e.g. dataclasses). You can also define a specific position for attributes in patterns by setting the ``__match_args__`` special attribute in your classes. If it's set to ("x", "y"), the following patterns are all equivalent (and all bind the ``y`` attribute to the ``var`` variable)::
pl: Możesz użyć parametrów pozycyjnych z jakimiś wbudowanymi klasami, które posiadają kolejność dla atrybutów (na przykład dataclasses). Możesz też określić wybrane pozycje dla atrybutów we wzorcach ustawiając specjalny atrybut ``__match_args__`` w twoich klasach. Jeśli jest on ustawiony na („x”, „y”), wszystkie następujące wzorce są równoważne (i wszystkie powiązują atrybut ``y`` ze zmienną ``var``)::

source: A recommended way to read patterns is to look at them as an extended form of what you would put on the left of an assignment, to understand which variables would be set to what. Only the standalone names (like ``var`` above) are assigned to by a match statement. Dotted names (like ``foo.bar``), attribute names (the ``x=`` and ``y=`` above) or class names (recognized by the "(...)" next to them like ``Point`` above) are never assigned to.
pl: Rekomendowanym sposobem na czytanie wzorców jest patrzenie na nie jako na rozszerzoną formę tego, co wstawił(a)byś po lewej stronie przypisania, aby zrozumieć które zmienne będą ustawione na co. Tylko samodzielne nazwy (jak ``var`` powyżej) zyskują przypisanie w instrukcji match. Nazwy z kropkami (jak ``foo.bar``), nazwy atrybutów (``x=`` i ``y=`` powyżej) lub nazwy klas (rozpoznawane przez „(…)” przy nich jak ``Point`` powyżej) nie mają nigdy przypisań.

source: Patterns can be arbitrarily nested. For example, if we have a short list of points, we could match it like this::
pl: Wzorce mogą być dowolnie zagnieżdżane. Na przykład jeśli mamy krótką listę punktów, możemy je dopasowywać w ten sposób::

source: We can add an ``if`` clause to a pattern, known as a "guard". If the guard is false, ``match`` goes on to try the next case block. Note that value capture happens before the guard is evaluated::
pl: Możemy dodać klauzulę ``if`` do wzorca, nazywaną „guardem”. Jeśli guard jest fałszywy, ``match`` próbuje dopasować następny blok case. Zwróć uwagę, że przechwycenie wartości dzieje się zanim wyliczona jest wartość guarda::

source: Several other key features of this statement:
pl: Kilka innych ważnych funkcjonalności tej instrukcji:

source: Like unpacking assignments, tuple and list patterns have exactly the same meaning and actually match arbitrary sequences. An important exception is that they don't match iterators or strings.
pl: Podobnie do przypisań z „rozpakowywaniem”, wzorce z krotkami i listami mają to samo znaczenie i dopasowują się do dowolnych sekwencji. Ważnym wyjątkiem jest to, że nie dopasowują się do iteratorów i ciągów znaków.

source: Sequence patterns support extended unpacking: ``[x, y, *rest]`` and ``(x, y, *rest)`` work similar to unpacking assignments. The name after ``*`` may also be ``_``, so ``(x, y, *_)`` matches a sequence of at least two items without binding the remaining items.
pl: Wzorce sekwencji wspierają rozszerzone rozpakowywanie: ``[x, y, *rest]`` i ``(x, y, *rest)`` działają podobnie do przypisań z rozpakowywaniem. Nazwa po ``*`` może być również ``_``, aby ``(x, y, *_)`` dopasowywała się do sekwencji o conajmniej dwóch elementach bez powiązywania ze zmienną pozostałych elementów.

source: Mapping patterns: ``{"bandwidth": b, "latency": l}`` captures the ``"bandwidth"`` and ``"latency"`` values from a dictionary. Unlike sequence patterns, extra keys are ignored. An unpacking like ``**rest`` is also supported. (But ``**_`` would be redundant, so it is not allowed.)
pl: Wzorce mapowania: ``{"bandwidth": b, "latency": l}`` przechwytuje wartości ``"bandwidth"`` i ``"latency"`` ze słownika. W przeciwieństwie do wzorców sekwencji, nadmiarowe klucze są ignorowane. Rozpakowywanie typu ``**rest`` jest również wspierane. (Ale ``**_`` byłoby nadmierne, więc jest niedozwolone.)

source: Subpatterns may be captured using the ``as`` keyword::
pl: Można przechwytywać podwzorce używając słowa kluczowego ``as``::

source: will capture the second element of the input as ``p2`` (as long as the input is a sequence of two points)
pl: przechwyci drugi element wejścia jako ``p2`` (jeśli wejście jest sekwencją dwóch punktów)

source: Most literals are compared by equality, however the singletons ``True``, ``False`` and ``None`` are compared by identity.
pl: Większość literałów jest porównywanych przez równość, lecz singletony ``True``, ``False`` i ``None`` są porównywane przez identyczność.

source: Patterns may use named constants. These must be dotted names to prevent them from being interpreted as capture variable::
pl: Wzorce mogą używać nazwanych stałych. Trzeba je podawać po kropce, aby uniknąć interpretacji przechwycenia jako zwykłej zmiennej::

source: For a more detailed explanation and additional examples, you can look into :pep:`636` which is written in a tutorial format.
pl: Bardziej szczegółowe wyjaśnienie i dodatkowe przykłady możesz znaleźć w :pep:`636`, który jest napisany w formie tutoriala.

source: Defining Functions
pl: Definiowanie funkcji

source: We can create a function that writes the Fibonacci series to an arbitrary boundary::
pl: Możemy stworzyć funkcję, która wypisuje ciąg Fibonacciego do wskazanej granicy::

source: The keyword :keyword:`def` introduces a function *definition*. It must be followed by the function name and the parenthesized list of formal parameters. The statements that form the body of the function start at the next line, and must be indented.
pl: Słowo kluczowe :keyword:`def` oznacza *definicję* funkcji. Po nim musi następować nazwa funkcji oraz lista formalnych parametrów otoczona nawiasami. Instrukcje, które stanowią ciało funkcji zaczynają się w następnej linii i muszą być wcięte.

source: The first statement of the function body can optionally be a string literal; this string literal is the function's documentation string, or :dfn:`docstring`. (More about docstrings can be found in the section :ref:`tut-docstrings`.) There are tools which use docstrings to automatically produce online or printed documentation, or to let the user interactively browse through code; it's good practice to include docstrings in code that you write, so make a habit of it.
pl: Opcjonalnie, pierwszy wiersz ciała funkcji może być gołym napisem (literałem): jest to tzw. napis dokumentujący lub inaczej :dfn:`docstring`. (Więcej o docstringach znajdziesz w sekcji :ref:`tut-docstrings`.) Istnieją pewne narzędzia, które używają docstringów do automatycznego tworzenia drukowanej lub dostępnej online dokumentacji albo pozwalają użytkownikowi na interaktywne przeglądanie kodu. Dobrym zwyczajem jest pisane napisów dokumentacyjnych w czasie pisania programu: spróbuj się do tego przyzwyczaić.

source: The *execution* of a function introduces a new symbol table used for the local variables of the function. More precisely, all variable assignments in a function store the value in the local symbol table; whereas variable references first look in the local symbol table, then in the local symbol tables of enclosing functions, then in the global symbol table, and finally in the table of built-in names. Thus, global variables and variables of enclosing functions cannot be directly assigned a value within a function (unless, for global variables, named in a :keyword:`global` statement, or, for variables of enclosing functions, named in a :keyword:`nonlocal` statement), although they may be referenced.
pl: *Wykonanie* funkcji powoduje stworzenie nowej tablicy symboli lokalnych używanych w tej funkcji. Mówiąc precyzyjniej: wszystkie przypisania do zmiennych lokalnych funkcji powodują umieszczenie tych wartości w lokalnej tablicy symboli. Odniesienia do zmiennych najpierw szukają swych wartości w lokalnej tablicy symboli, potem w lokalnych tablicach symboli funkcji otaczających, potem w globalnej, a dopiero na końcu w tablicy nazw wbudowanych w interpreter. Tak więc, zmiennym globalnym ani zmiennym w otaczających funkcjach nie można wprost przypisać wartości w ciele funkcji (chyba, że zostaną wymienione w niej za pomocą instrukcji :keyword:`global` lub dla zmiennych w otaczających funkcjach, wymienionych w instrukcji :keyword:`nonlocal`), aczkolwiek mogą w niej być używane (czytane).

source: The actual parameters (arguments) to a function call are introduced in the local symbol table of the called function when it is called; thus, arguments are passed using *call by value* (where the *value* is always an object *reference*, not the value of the object). [#]_ When a function calls another function, or calls itself recursively, a new local symbol table is created for that call.
pl: Parametry (argumenty) wywołania funkcji wprowadzane są do lokalnej tablicy symboli w momencie wywołania funkcji. Tak więc, argumenty przekazywane są jej przez wartość (gdzie *wartość* jest zawsze *odniesieniem* do obiektu, a nie samym obiektem). [#]_ Nowa tablica symboli tworzona jest również w przypadku, gdy funkcja wywołuje inną funkcję lub wywołuje się przez rekursję.

source: A function definition associates the function name with the function object in the current symbol table. The interpreter recognizes the object pointed to by that name as a user-defined function. Other names can also point to that same function object and can also be used to access the function::
pl: Definicja funkcji powiązuje nazwę funkcji z obiektem funkcji w aktualnej tablicy symboli. Interpreter rozpoznaje obiekt wskazany tą nazwą jako funkcję zdefiniowaną przez użytkownika. Inne nazwy też mogą wskazywać na ten sam obiekt funkcji i mogą być używane, aby dostać się do funkcji::

source: Coming from other languages, you might object that ``fib`` is not a function but a procedure since it doesn't return a value. In fact, even functions without a :keyword:`return` statement do return a value, albeit a rather boring one. This value is called ``None`` (it's a built-in name). Writing the value ``None`` is normally suppressed by the interpreter if it would be the only value written. You can see it if you really want to using :func:`print`::
pl: Przychodząc z innych języków, mógłbyś oponować, że ``fib`` nie jest funkcją, ale procedurą, jako że nie zwraca wartości. Tak naprawdę nawet funkcje bez instrukcji :keyword:`return` zwracają wartość, chociaż dość nudną. Tę wartość nazywamy ``None`` (to wbudowana nazwa). Wypisywanie wartości ``None`` jest normalnie pomijane przez interpreter, jeśli miałaby to jedyna wypisywana wartość. Możesz ją zobaczyć, jeśli bardzo chcesz, używając :func:`print`::

source: It is simple to write a function that returns a list of the numbers of the Fibonacci series, instead of printing it::
pl: Prosto można napisać funkcję, która zwraca listę numerów ciągu Fibonnaciego zamiast go wyświetlać::
