Repository: python/python-docs-pl
Catalog: tutorial/datastructures.po
Languages: pl

source: To loop over a sequence in sorted order, use the :func:`sorted` function which returns a new sorted list while leaving the source unaltered. ::
pl: Aby przeiterować po sekwencji w posortowanej kolejności, użyj funkcji :func:`sorted`, która zwraca nową posortowaną listę pozostawiając listę źródłową niezmienioną. ::

source: Using :func:`set` on a sequence eliminates duplicate elements. The use of :func:`sorted` in combination with :func:`set` over a sequence is an idiomatic way to loop over unique elements of the sequence in sorted order. ::
pl: Użycie :func:`set` na sekwencji eliminuje zduplikowane elementy. Użycie :func:`sorted` w połączeniu z :func:`set` na sekwencji jest idiomatycznym sposobem na przeiterowanie po unikalnych elementach sekwencji w posortowanej kolejności. ::

source: It is sometimes tempting to change a list while you are looping over it; however, it is often simpler and safer to create a new list instead. ::
pl: Czasem kusi, żeby zmienić listę podczas iterowania po niej; jednak często prościej i bezpieczniej jest stworzyć nową listę. ::

source: More on Conditions
pl: Więcej na temat warunków

source: The conditions used in ``while`` and ``if`` statements can contain any operators, not just comparisons.
pl: Warunki użyte w instrukcjach ``while`` i ``if`` mogą zawierać dowolne operatory, nie tylko porównania.

source: The comparison operators ``in`` and ``not in`` are membership tests that determine whether a value is in (or not in) a container. The operators ``is`` and ``is not`` compare whether two objects are really the same object. All comparison operators have the same priority, which is lower than that of all numerical operators.
pl: Operatory porównania ``in`` i ``not in`` są testami należenia, które ustalają, czy wartość występuje (nie występuje) w kontenerze. Operatory ``is`` i ``is not`` porównują, czy dwa obiekty są rzeczywiście tym samym obiektem. Wszystkie operatory porównań mają ten sam priorytet, który jest niższy niż ten, który mają wszystkie operatory numeryczne.

source: Comparisons can be chained. For example, ``a < b == c`` tests whether ``a`` is less than ``b`` and moreover ``b`` equals ``c``.
pl: Porównania mogą być układane w łańcuchy. Na przykład ``a < b == c`` sprawdza, czy ``a`` jest mniejsze od ``b`` i ponadto czy ``b`` równa się ``c``.

source: Comparisons may be combined using the Boolean operators ``and`` and ``or``, and the outcome of a comparison (or of any other Boolean expression) may be negated with ``not``. These have lower priorities than comparison operators; between them, ``not`` has the highest priority and ``or`` the lowest, so that ``A and not B or C`` is equivalent to ``(A and (not B)) or C``. As always, parentheses can be used to express the desired composition.
pl: Porównania można łączyć używając operatorów boolowskich ``and`` i ``or``. Wynik porównania (lub jakiegokolwiek innego wyrażenia boolowskiego) można zanegować używając ``not``. Operatory te mają mniejszy priorytet niż operatory porównania; wśród nich ``not`` ma najwyższy priorytet a ``or`` najniższy, więc ``A and not B or C`` jest ekwiwalentem ``(A and (not B)) or C``. Jak zwykle można użyć nawiasów, aby wyrazić pożądaną kolejność kompozycji wyrażenia.

source: The Boolean operators ``and`` and ``or`` are so-called *short-circuit* operators: their arguments are evaluated from left to right, and evaluation stops as soon as the outcome is determined. For example, if ``A`` and ``C`` are true but ``B`` is false, ``A and B and C`` does not evaluate the expression ``C``. When used as a general value and not as a Boolean, the return value of a short-circuit operator is the last evaluated argument.
pl: Argumenty operatorów boolowskich ``and`` i ``or`` są ewaluowane od lewej do prawej. Ewaluacja kończy się w momencie ustalenia wyniku. Na przykład, jeśli ``A`` i ``C`` są prawdą, ale ``B`` jest fałszem, ``A and B and C`` nie zewaluuje wyrażenia ``C``. Przy użyciu ogólnej wartości, nie jako boolean, wartość zwracana tych operatorów to ostatnio ewaluowany argument.

source: It is possible to assign the result of a comparison or other Boolean expression to a variable. For example, ::
pl: Da się przypisać wynik porównania lub inne wyrażenie boolowskie do zmiennej. Na przykład, ::

source: Note that in Python, unlike C, assignment inside expressions must be done explicitly with the :ref:`walrus operator <why-can-t-i-use-an-assignment-in-an-expression>` ``:=``. This avoids a common class of problems encountered in C programs: typing ``=`` in an expression when ``==`` was intended.
pl: Zwróć uwagę, że w Pythonie, w przeciwieństwie do C, przypisanie wewnątrz wyrażeń musi być wyrażone bezpośrednio przez użycie :ref:`walrus operatora <why-can-t-i-use-an-assignment-in-an-expression>` ``:=``. W ten sposób unikamy powszechnej klasy problemów spotykanych w programach C: wpisywania ``=`` w wyrażeniu, gdy miało się intencję wpisać ``==``.

source: Comparing Sequences and Other Types
pl: Porównywanie sekwencji i innych typów

source: Sequence objects typically may be compared to other objects with the same sequence type. The comparison uses *lexicographical* ordering: first the first two items are compared, and if they differ this determines the outcome of the comparison; if they are equal, the next two items are compared, and so on, until either sequence is exhausted. If two items to be compared are themselves sequences of the same type, the lexicographical comparison is carried out recursively. If all items of two sequences compare equal, the sequences are considered equal. If one sequence is an initial sub-sequence of the other, the shorter sequence is the smaller (lesser) one. Lexicographical ordering for strings uses the Unicode code point number to order individual characters. Some examples of comparisons between sequences of the same type::
pl: Obiekty sekwencji zazwyczaj mogą być porównywane do innych obiektów, o tym samym typie sekwencji. Porównanie używa porządku *leksykograficznego*: pierwszy albo pierwsze dwa elementy są porównywane, i jeśli się różnią, to determinuje wynik porównania; jeśli są równe, następne dwa elementy są porównywane, i tak dalej, dopóki któraś z sekwencji się nie skończy. Jeśli dwa elementy do porównania same są sekwencjami tego samego typu, porównanie leksykograficzne odbywa się rekursywnie. Jeśli wszystkie elementy dwóch sekwencji są równe, takie sekwencje są traktowane jako równe. Jeśli jedna sekwencja jest początkową sub-sekwencją drugiej, ta krótsza sekwencja jest mniejszą. Porządek leksykograficzny ciągów znaków używa liczby tablicy Unicode do wyznaczenia porządku pojedynczych znaków. Niektóre przykłady porównań pomiędzy sekwencjami takiego samego typu::

source: Note that comparing objects of different types with ``<`` or ``>`` is legal provided that the objects have appropriate comparison methods. For example, mixed numeric types are compared according to their numeric value, so 0 equals 0.0, etc. Otherwise, rather than providing an arbitrary ordering, the interpreter will raise a :exc:`TypeError` exception.
pl: Zwróć uwagę, że porównywanie obiektów innych typów przy użyciu ``<`` lub ``>`` jest dozwolone pod warunkiem, że te obiekty mają odpowiednie metody porównań. Na przykład mieszane typy numeryczne są porównywane w oparciu o ich wartość numeryczną, tak że 0 równa się 0.0 i tak dalej. W innych przypadkach, zamiast zwracać arbitralny porządek, interpreter zgłosi wyjątek :exc:`TypeError`.

source: Footnotes
pl: Przypisy

source: Other languages may return the mutated object, which allows method chaining, such as ``d->insert("a")->remove("b")->sort();``.
pl: Inne języki mogą zwracać zmieniony obiekt, co pozwala na łańcuchowanie metod, na przykład ``d->insert("a")->remove("b")->sort();``.
