Repository: python/python-docs-pl
Catalog: tutorial/datastructures.po
Languages: pl

source: Data Structures
pl: Struktury danych

source: This chapter describes some things you've learned about already in more detail, and adds some new things as well.
pl: Ten rozdział opisuje bardziej szczegółowo niektóre rzeczy, które już poznaliście, oraz również wprowadza nowe elementy.

source: More on Lists
pl: Więcej na temat list

source: The list data type has some more methods. Here are all of the methods of list objects:
pl: Typ danych listy ma kilka więcej metod. To wszystkie metody obiektów listy:

source: Add an item to the end of the list. Equivalent to ``a[len(a):] = [x]``.
pl: Dodaje element na końcu listy. Ekwiwalent ``a[len(a):] = [x]``.

source: Extend the list by appending all the items from the iterable. Equivalent to ``a[len(a):] = iterable``.
pl: Rozszerza listę przez dodanie wszystkich elementów iterable'a. Ekwiwalent ``a[len(a):] = iterable``.

source: Insert an item at a given position. The first argument is the index of the element before which to insert, so ``a.insert(0, x)`` inserts at the front of the list, and ``a.insert(len(a), x)`` is equivalent to ``a.append(x)``.
pl: Wstawia element na podaną pozycję. Pierwszy argument jest indeksem elementu, przed który wstawiamy, więc ``a.insert(0, x)`` wstawia na początek listy a ``a.insert(len(a), x)`` odpowiada ``a.append(x)``.

source: Remove the first item from the list whose value is equal to *x*. It raises a :exc:`ValueError` if there is no such item.
pl: Usuwa pierwszy element z listy, którego wartość jest równa *x*. Rzuca :exc:`ValueError`, jeśli nie ma takiego elementu.

source: Remove the item at the given position in the list, and return it. If no index is specified, ``a.pop()`` removes and returns the last item in the list. It raises an :exc:`IndexError` if the list is empty or the index is outside the list range.
pl: Usuwa element na podanej pozycji na liście i zwraca go. Jeśli nie podano indeksu, ``a.pop()`` usuwa i zwraca ostatnią pozycję na liście. Funkcja rzuca :exc:`IndexError`, jeśli lista jest pusta lub indeks znajduje się poza zakresem listy.

source: Remove all items from the list. Equivalent to ``del a[:]``.
pl: Usuwa wszystkie elementy z listy. Ekwiwalent ``del a[:]``.

source: Return zero-based index in the list of the first item whose value is equal to *x*. Raises a :exc:`ValueError` if there is no such item.
pl: Zwraca indeks (liczony od zera) pierwszego elementu na liście, którego wartość jest równa *x*. Rzuca :exc:`ValueError`, jeśli nie ma takiego elementu.

source: The optional arguments *start* and *end* are interpreted as in the slice notation and are used to limit the search to a particular subsequence of the list. The returned index is computed relative to the beginning of the full sequence rather than the *start* argument.
pl: Opcjonalne argumenty *start* i *end* są interpretowane jak w notacji slice i służą do ograniczenia wyszukiwania do szczególnej podsekwencji listy. Zwracany indeks jest wyliczany względem początku pełnej sekwencji, nie względem argumentu *start*.

source: Return the number of times *x* appears in the list.
pl: Zwraca liczbę razy, jaką *x* występuje w liście.

source: Sort the items of the list in place (the arguments can be used for sort customization, see :func:`sorted` for their explanation).
pl: Sortuje elementy listy w miejscu (argumenty mogą służyć do dostosowania sortowania, patrz :func:`sorted` po ich wyjaśnienie).

source: Reverse the elements of the list in place.
pl: Odwraca elementy listy w miejscu.

source: Return a shallow copy of the list. Equivalent to ``a[:]``.
pl: Zwraca płytką kopię listy. Ekwiwalent ``a[:]``.

source: An example that uses most of the list methods::
pl: Przykład, który używa większość metod listy::

source: You might have noticed that methods like ``insert``, ``remove`` or ``sort`` that only modify the list have no return value printed -- they return the default ``None``. [#]_ This is a design principle for all mutable data structures in Python.
pl: Być może zauważyłeś(-łaś), że metody takie jak ``insert``, ``remove`` czy ``sort``, które tylko modyfikują listę, nie mają wypisanej wartości zwrotnej – zwracają domyślne ``None``. [#]_ Jest to zasada projektowa dla wszystkich mutowalnych struktur danych w Pythonie.

source: Another thing you might notice is that not all data can be sorted or compared. For instance, ``[None, 'hello', 10]`` doesn't sort because integers can't be compared to strings and ``None`` can't be compared to other types. Also, there are some types that don't have a defined ordering relation. For example, ``3+4j < 5+7j`` isn't a valid comparison.
pl: Możesz też zauważyć, że nie wszystkie dane da się posortować lub porównać. Na przykład, ``[None, 'hello', 10]`` nie sortuje się, ponieważ liczby całkowite nie mogą być porównywane do ciągów znaków a ``None`` nie może być porównywany do innych typów. Są również typy, które nie mają określonej relacji porządku. Na przykład ``3+4j < 5+7j`` nie jest poprawnym porównaniem.

source: Using Lists as Stacks
pl: Używanie list jako stosów

source: The list methods make it very easy to use a list as a stack, where the last element added is the first element retrieved ("last-in, first-out"). To add an item to the top of the stack, use :meth:`~list.append`. To retrieve an item from the top of the stack, use :meth:`~list.pop` without an explicit index. For example::
pl: Metody listy ułatwiają używanie listy jako stosu, gdzie ostatni element dodany jest pierwszym elementem pobieranym („last-in, first-out”). Aby dodać element na wierzch stosu, użyj :meth:`~list.append`. Aby pobrać element z wierzchu stosu, użyj :meth:`~list.pop` bez podanego indeksu. Na przykład::

source: Using Lists as Queues
pl: Używanie list jako kolejek

source: It is also possible to use a list as a queue, where the first element added is the first element retrieved ("first-in, first-out"); however, lists are not efficient for this purpose. While appends and pops from the end of list are fast, doing inserts or pops from the beginning of a list is slow (because all of the other elements have to be shifted by one).
pl: Można też używać list jako kolejek, gdzie pierwszy element dodany jest pierwszym elementem pobieranym („first-in, first-out”); jednakże listy nie są wydajne do tego celu. Appendy i popy na końcu listy są szybkie, lecz inserty i popy na początku listy są wolne (ponieważ wszystkie inne elementy muszą zostać przesunięte o jeden).

source: To implement a queue, use :class:`collections.deque` which was designed to have fast appends and pops from both ends. For example::
pl: Aby zaimplementować kolejkę, użyj :class:`collections.deque`, która została zaprojektowana, by mieć szybkie appendy i popy na obu końcach. Na przykład::

source: List Comprehensions
pl: Wyrażenia listowe

source: List comprehensions provide a concise way to create lists. Common applications are to make new lists where each element is the result of some operations applied to each member of another sequence or iterable, or to create a subsequence of those elements that satisfy a certain condition.
pl: Wyrażenia listowe są zwięzłym sposobem na tworzenie list. Powszechne zastosowania to tworzenie nowych list, gdzie każdy element jest wynikiem jakichś operacji zastosowanych do każdego elementu innej sekwencji lub iterable'a lub do tworzenia podsekwencji tych elementów, które spełniają określony warunek.

source: For example, assume we want to create a list of squares, like::
pl: Na przykład załóżmy, że chcemy stworzyć listę kwadratów, jak tu::

source: Note that this creates (or overwrites) a variable named ``x`` that still exists after the loop completes. We can calculate the list of squares without any side effects using::
pl: Zwróć uwagę, że ten kod tworzy (lub nadpisuje) zmienną o nazwie ``x``, która wciąż istnieje po wykonaniu pętli. Możemy obliczyć listę kwadratów bez żadnych efektów ubocznych w następujący sposób::

source: or, equivalently::
pl: lub równoważnie::

source: which is more concise and readable.
pl: co jest bardziej zwięzłe i czytelne.

source: A list comprehension consists of brackets containing an expression followed by a :keyword:`!for` clause, then zero or more :keyword:`!for` or :keyword:`!if` clauses. The result will be a new list resulting from evaluating the expression in the context of the :keyword:`!for` and :keyword:`!if` clauses which follow it. For example, this listcomp combines the elements of two lists if they are not equal::
pl: Wyrażenie listowe składa się z nawiasów zawierających wyrażenie oraz klauzulę :keyword:`!for`, następnie zero lub więcej klauzul :keyword:`!for` lub :keyword:`!if`. Rezultatem będzie nowa lista powstała z obliczenia wyrażenia w kontekście klauzul :keyword:`!for` i :keyword:`!if`, które po nim następują. Na przykład to wyrażenie listowe łączy elementy dwóch list, jeśli nie są równe::

source: and it's equivalent to::
pl: i jest odpowiednikiem::

source: Note how the order of the :keyword:`for` and :keyword:`if` statements is the same in both these snippets.
pl: Zwróć uwagę, że kolejność instrukcji :keyword:`for` i :keyword:`if` jest taka sama w obu fragmentach kodu.

source: If the expression is a tuple (e.g. the ``(x, y)`` in the previous example), it must be parenthesized. ::
pl: Jeśli wyrażenie jest krotką (tak jak ``(x, y)`` w poprzednim przykładzie), musi być wzięte w nawias. ::

source: List comprehensions can contain complex expressions and nested functions::
pl: Wyrażenia listowe mogą zawierać złożone wyrażenia i zagnieżdżone funkcje::

source: Nested List Comprehensions
pl: Zagnieżdżone wyrażenia listowe

source: The initial expression in a list comprehension can be any arbitrary expression, including another list comprehension.
pl: Wyrażeniem wyjściowym w wyrażeniu listowym może być każde arbitralne wyrażenie, włączając inne wyrażenie listowe.

source: Consider the following example of a 3x4 matrix implemented as a list of 3 lists of length 4::
pl: Rozważmy następujący przykład macierzy 3-na-4 zaimplementowanej jako lista trzech list o długości 4::

source: The following list comprehension will transpose rows and columns::
pl: Następujące wyrażenie listowe przetransponuje wiersze i kolumny::

source: As we saw in the previous section, the inner list comprehension is evaluated in the context of the :keyword:`for` that follows it, so this example is equivalent to::
pl: Jak widzieliśmy w poprzedniej sekcji, wewnętrzne wyrażenie listowe jest ewaluowane w kontekście :keyword:`for`, które po nim następuje, więc ten przykład jest równoważny temu::

source: which, in turn, is the same as::
pl: który z kolei jest taki sam jak::

source: In the real world, you should prefer built-in functions to complex flow statements. The :func:`zip` function would do a great job for this use case::
pl: W prawdziwym świecie powinieneś(-nnaś) preferować wbudowane funkcje w złożonych instrukcjach przepływu. Funkcja :func:`zip` bardzo się przyda w tym przypadku::

source: See :ref:`tut-unpacking-arguments` for details on the asterisk in this line.
pl: W :ref:`tut-unpacking-arguments` znajdziesz wyjaśnienie znaku gwiazdki w tej linii.

source: The :keyword:`!del` statement
pl: Instrukcja :keyword:`!del`

source: There is a way to remove an item from a list given its index instead of its value: the :keyword:`del` statement. This differs from the :meth:`~list.pop` method which returns a value. The :keyword:`!del` statement can also be used to remove slices from a list or clear the entire list (which we did earlier by assignment of an empty list to the slice). For example::
pl: Element można usunąć z listy mając jego indeks zamiast wartości: instrukcją :keyword:`del`. Jest ona różna od metody :meth:`~list.pop`, która zwraca wartość. Instrukcji :keyword:`!del` można też użyć do usunięcia slice'ów lub wyczyszczenia całej listy (zrobiliśmy to wcześniej przypisując pustą listę do slice'a). Na przykład::

source: :keyword:`del` can also be used to delete entire variables::
pl: :keyword:`del` można również użyć do usuwania całych zmiennych::

source: Referencing the name ``a`` hereafter is an error (at least until another value is assigned to it). We'll find other uses for :keyword:`del` later.
pl: Odniesienie się do nazwy ``a`` odtąd jest błędem (przynajmniej dopóki nie przypisana jest do niej inna wartość). Później odnajdziemy więcej zastosowań dla :keyword:`del`.

source: Tuples and Sequences
pl: Krotki i sekwencje

source: We saw that lists and strings have many common properties, such as indexing and slicing operations. They are two examples of *sequence* data types (see :ref:`typesseq`). Since Python is an evolving language, other sequence data types may be added. There is also another standard sequence data type: the *tuple*.
pl: Widzieliśmy, że listy i ciągi znaków mają wiele wspólnych własności, takich jak indeksowanie i operacje slice. Są one dwoma przykładami *sekwencyjnych* typów danych (patrz :ref:`typesseq`). Jako że Python jest ewoluującym językiem, mogą zostać dodane inne sekwencyjne typy danych. Jest też inny standardowy sekwencyjny typ danych: *krotka*.

source: A tuple consists of a number of values separated by commas, for instance::
pl: Krotka składa się z kilku wartości rozdzielonych przecinkami, na przykład::

source: As you see, on output tuples are always enclosed in parentheses, so that nested tuples are interpreted correctly; they may be input with or without surrounding parentheses, although often parentheses are necessary anyway (if the tuple is part of a larger expression). It is not possible to assign to the individual items of a tuple, however it is possible to create tuples which contain mutable objects, such as lists.
pl: Jak widzisz na wyjściu krotki zawsze są otoczone nawiasami, tak aby zagnieżdżone krotki były poprawnie interpretowane; wpisać je można z lub bez otaczających nawiasów, chociaż często nawiasy są i tak potrzebne (jeśli krotka jest częścią większego wyrażenia). Nie da się przypisać wartości do pojedynczych elementów krotki, ale da się stworzyć krotki, które zawierają mutowalne obiekty, takie jak listy.

source: Though tuples may seem similar to lists, they are often used in different situations and for different purposes. Tuples are :term:`immutable`, and usually contain a heterogeneous sequence of elements that are accessed via unpacking (see later in this section) or indexing (or even by attribute in the case of :func:`namedtuples <collections.namedtuple>`). Lists are :term:`mutable`, and their elements are usually homogeneous and are accessed by iterating over the list.
pl: Mimo że krotki mogą wydawać się podobne do list, często są używane w innych sytuacjach i do innych celów. Krotki są :term:`niemutowalne <immutable>` i zazwyczaj zawierają heterogeniczne sekwencje elementów, do których dostęp uzyskuje się przez rozpakowywanie (patrz później w tej sekcji) lub indeksowanie (lub nawet przez atrybut w przypadku :func:`namedtuples <collections.namedtuple>`). Listy są :term:`mutowalne <mutable>` i ich elementy są zazwyczaj homogeniczne i dostęp do nich uzyskuje się przez iterowanie po liście.

source: A special problem is the construction of tuples containing 0 or 1 items: the syntax has some extra quirks to accommodate these. Empty tuples are constructed by an empty pair of parentheses; a tuple with one item is constructed by following a value with a comma (it is not sufficient to enclose a single value in parentheses). Ugly, but effective. For example::
pl: Specjalnym problemem jest konstrukcja krotek zawierających 0 lub 1 element: składnia przewiduje na to kilka sposobów. Puste krotki można konstruować pustą parą nawiasów; krotkę z jednym elementem można skonstruować umieszczając przecinek za wartością (nie wystarczy otoczyć pojedynczej wartości nawiasami). Brzydkie, ale działa. Na przykład::

source: The statement ``t = 12345, 54321, 'hello!'`` is an example of *tuple packing*: the values ``12345``, ``54321`` and ``'hello!'`` are packed together in a tuple. The reverse operation is also possible::
pl: Instrukcja ``t = 12345, 54321, 'hello!'`` jest przykładem *pakowania krotki*: wartości ``12345``, ``54321`` i ``'hello!'`` są razem zapakowane w krotkę. Możliwa jest również odwrotna operacja::

source: This is called, appropriately enough, *sequence unpacking* and works for any sequence on the right-hand side. Sequence unpacking requires that there are as many variables on the left side of the equals sign as there are elements in the sequence. Note that multiple assignment is really just a combination of tuple packing and sequence unpacking.
pl: Takie coś nazywane jest, odpowiednio, *rozpakowywaniem sekwencji*. Takie rozpakowywanie wymaga, aby po lewej stronie znaku równości było tyle samo zmiennych, ile jest elementów w sekwencji. Zauważcie, że wielokrotne przypisanie jest kombinacją pakowania i rozpakowywania sekwencji.

source: Sets
pl: Zbiory

source: Python also includes a data type for *sets*. A set is an unordered collection with no duplicate elements. Basic uses include membership testing and eliminating duplicate entries. Set objects also support mathematical operations like union, intersection, difference, and symmetric difference.
pl: Python ma również typ danych dla zbiorów. Zbiór jest nieuporządkowaną kolekcją bez zduplikowanych elementów. Podstawowe użycia to sprawdzenie zawierania i eliminacja duplikatów. Obiekty zbiorów wspierają też operacje matematyczne jak suma, iloczyn, różnica i różnica symetryczna zbiorów.

source: Curly braces or the :func:`set` function can be used to create sets. Note: to create an empty set you have to use ``set()``, not ``{}``; the latter creates an empty dictionary, a data structure that we discuss in the next section.
pl: Zbiory można stworzyć używając nawiasów klamrowych lub funkcji :func:`set`. Uwaga: aby stworzyć pusty zbiór, musisz użyć ``set()``, nie ``{}``; to drugie tworzy pusty słownik, strukturę danych, którą omówimy w następnej sekcji.

source: Here is a brief demonstration::
pl: Poniżej krótka demonstracja::

source: Similarly to :ref:`list comprehensions <tut-listcomps>`, set comprehensions are also supported::
pl: Podobnie do :ref:`wyrażeń listowych <tut-listcomps>`, są wspierane również wyrażenia zbiorów::

source: Dictionaries
pl: Słowniki

source: Another useful data type built into Python is the *dictionary* (see :ref:`typesmapping`). Dictionaries are sometimes found in other languages as "associative memories" or "associative arrays". Unlike sequences, which are indexed by a range of numbers, dictionaries are indexed by *keys*, which can be any immutable type; strings and numbers can always be keys. Tuples can be used as keys if they contain only strings, numbers, or tuples; if a tuple contains any mutable object either directly or indirectly, it cannot be used as a key. You can't use lists as keys, since lists can be modified in place using index assignments, slice assignments, or methods like :meth:`~list.append` and :meth:`~list.extend`.
pl: Innym przydatnym typem danych wbudowanym w Pythona jest *słownik* (patrz :ref:`typesmapping`). Słowniki w innych językach czasem występują jako „pamięci asocjacyjne” albo „tablice asocjacyjne”. W przeciwieństwie do sekwencji, które są indeksowane zakresem liczb, słowniki są indeksowane przez *klucze*, które mogą być dowolnym niemutowalnym typem; ciągi znaków i liczby zawsze mogą być kluczami. Można użyć krotek, jeśli zawierają tylko ciągi znaków, liczby lub krotki; jeśli krotka zawiera choć jeden mutowalny obiekt, bezpośrednio lub pośrednio, nie można jej użyć jako klucza. Nie możesz używać list jako kluczy, jako że listy mogą być modyfikowane „w miejscu” przy użyciu przypisań do indeksu, przypisań do slice'ów lub metod jak :meth:`~list.append` i :meth:`~list.extend`.

source: It is best to think of a dictionary as a set of *key: value* pairs, with the requirement that the keys are unique (within one dictionary). A pair of braces creates an empty dictionary: ``{}``. Placing a comma-separated list of key:value pairs within the braces adds initial key:value pairs to the dictionary; this is also the way dictionaries are written on output.
pl: Najlepiej jest myśleć o słowniku jako zbiorze par *klucz: wartość*, z wymaganiem aby klucze były unikalne (w obrębie jednego słownika). Para nawiasów klamrowych tworzy pusty słownik: ``{}``. Umieszczenie listy par klucz:wartość rozdzielonych przecinkami dodaje początkowe pary do słownika; w ten sposób również słowniki są wypisywane na wyjściu.

source: The main operations on a dictionary are storing a value with some key and extracting the value given the key. It is also possible to delete a key:value pair with ``del``. If you store using a key that is already in use, the old value associated with that key is forgotten. It is an error to extract a value using a non-existent key.
pl: Głównymi operacjami na słowniku są umieszczanie wartości pod jakimś kluczem oraz wyciąganie wartości dla podanego klucza. Możliwe jest również usunięcie pary klucz:wartość przy użyciu ``del``. Jeśli umieścisz wartość używając klucza, który już jest w użyciu, stara wartość powiązana z tym kluczem zostanie zapomniana. Próba wyciągnięcia wartości przy użyciu nieistniejącego klucza zakończy się błędem.

source: Performing ``list(d)`` on a dictionary returns a list of all the keys used in the dictionary, in insertion order (if you want it sorted, just use ``sorted(d)`` instead). To check whether a single key is in the dictionary, use the :keyword:`in` keyword.
pl: Wykonanie ``list(d)`` na słowniku zwraca listę wszystkich kluczy używanych w słowniku, w kolejności wstawiania (jeśli chcesz je posortować, użyj ``sorted(d)``). Aby sprawdzić, czy pojedynczy klucz jest w słowniku, użyj słowa kluczowego :keyword:`in`.

source: Here is a small example using a dictionary::
pl: Mały przykład użycia słownika::

source: The :func:`dict` constructor builds dictionaries directly from sequences of key-value pairs::
pl: Konstruktor :func:`dict` buduje słowniki bezpośrednio z sekwencji par klucz-wartość::

source: In addition, dict comprehensions can be used to create dictionaries from arbitrary key and value expressions::
pl: Dodatkowo można użyć wyrażeń słownikowych to tworzenia słowników z podanych wyrażeń klucza i wartości::

source: When the keys are simple strings, it is sometimes easier to specify pairs using keyword arguments::
pl: Kiedy klucze są prostymi ciągami znaków, czasem łatwiej jest podać pary używając argumentów nazwanych::

source: Looping Techniques
pl: Techniki pętli

source: When looping through dictionaries, the key and corresponding value can be retrieved at the same time using the :meth:`~dict.items` method. ::
pl: Podczas iterowania po słownikach, klucz i odpowiadającą mu wartość można pobrać w tym samym czasie używając metody :meth:`~dict.items`. ::

source: When looping through a sequence, the position index and corresponding value can be retrieved at the same time using the :func:`enumerate` function. ::
pl: Przy iterowaniu po sekwencji, indeks pozycyjny i odpowiadającą mu wartość można pobrać w tym samym czasie używając funkcji :func:`enumerate`. ::

source: To loop over two or more sequences at the same time, the entries can be paired with the :func:`zip` function. ::
pl: Aby przeiterować po dwóch lub więcej sekwencjach w tym samym czasie, elementy mogą zostać zgrupowane funkcją :func:`zip`. ::

source: To loop over a sequence in reverse, first specify the sequence in a forward direction and then call the :func:`reversed` function. ::
pl: Aby przeiterować po sekwencji od końca, najpierw określ sekwencję w kierunku „do przodu” a następnie wywołaj funkcję :func:`reversed`. ::
