Repository: python/python-docs-pl
Catalog: tutorial/errors.po
Languages: pl

source: >>> try: ... raise KeyboardInterrupt ... finally: ... print('Goodbye, world!') ... Goodbye, world! Traceback (most recent call last): File "<stdin>", line 2, in <module> KeyboardInterrupt
pl: >>> try: ... raise KeyboardInterrupt ... finally: ... print('Żegnaj, świecie!') ... Żegnaj, świecie! Traceback (most recent call last): File "<stdin>", line 2, in <module> KeyboardInterrupt

source: If a :keyword:`finally` clause is present, the :keyword:`!finally` clause will execute as the last task before the :keyword:`try` statement completes. The :keyword:`!finally` clause runs whether or not the :keyword:`!try` statement produces an exception. The following points discuss more complex cases when an exception occurs:
pl: Jeśli klauzula :keyword:`finally` jest obecna, klauzula :keyword:`!finally` wykona się jako ostatnie zadanie przed zakończeniem instrukcji :keyword:`try`. Klauzula :keyword:`!finally` uruchomi się niezależnie od tego, czy instrukcja :keyword:`!try` spowoduje wyjątek. Poniższe punkty omawiają bardziej złożone przypadki wystąpienia wyjątku:

source: If an exception occurs during execution of the :keyword:`!try` clause, the exception may be handled by an :keyword:`except` clause. If the exception is not handled by an :keyword:`!except` clause, the exception is re-raised after the :keyword:`!finally` clause has been executed.
pl: Jeśli podczas wykonywania klauzuli :keyword:`!try` wystąpi wyjątek, może on zostać obsłużony przez klauzulę :keyword:`except`. Jeśli wyjątek nie zostanie obsłużony przez klauzulę :keyword:`!except`, zostanie on ponownie rzucony po wykonaniu klauzuli :keyword:`!finally`.

source: An exception could occur during execution of an :keyword:`!except` or :keyword:`!else` clause. Again, the exception is re-raised after the :keyword:`!finally` clause has been executed.
pl: Wyjątek może wystąpić podczas wykonywania klauzul :keyword:`!except` lub :keyword:`!else`. Ponownie, wyjątek jest ponownie rzucany po wykonaniu klauzuli :keyword:`!finally`.

source: If the :keyword:`!finally` clause executes a :keyword:`break`, :keyword:`continue` or :keyword:`return` statement, exceptions are not re-raised.
pl: Jeśli klauzula :keyword:`!finally` wykonuje instrukcje :keyword:`break`, :keyword:`continue` lub :keyword:`return`, wyjątki nie są ponownie rzucane.

source: If the :keyword:`!try` statement reaches a :keyword:`break`, :keyword:`continue` or :keyword:`return` statement, the :keyword:`!finally` clause will execute just prior to the :keyword:`!break`, :keyword:`!continue` or :keyword:`!return` statement's execution.
pl: Jeśli instrukcja :keyword:`!try` osiągnie instrukcję :keyword:`break`, :keyword:`continue` lub :keyword:`return`, klauzula :keyword:`!finally` wykona się tuż przed wykonaniem instrukcji :keyword:`!break`, :keyword:`!continue` lub :keyword:`!return`.

source: If a :keyword:`!finally` clause includes a :keyword:`!return` statement, the returned value will be the one from the :keyword:`!finally` clause's :keyword:`!return` statement, not the value from the :keyword:`!try` clause's :keyword:`!return` statement.
pl: Jeśli klauzula :keyword:`!finally` zawiera instrukcję :keyword:`!return`, zwróconą wartością będzie ta z instrukcji :keyword:`!return` klauzuli :keyword:`!finally`, a nie wartość z instrukcji :keyword:`!return` klauzuli :keyword:`!try`.

source: For example::
pl: Dla przykładu::

source: A more complicated example::
pl: Bardziej skomplikowany przykład::

source: >>> def divide(x, y): ... try: ... result = x / y ... except ZeroDivisionError: ... print("division by zero!") ... else: ... print("result is", result) ... finally: ... print("executing finally clause") ... >>> divide(2, 1) result is 2.0 executing finally clause >>> divide(2, 0) division by zero! executing finally clause >>> divide("2", "1") executing finally clause Traceback (most recent call last): File "<stdin>", line 1, in <module> File "<stdin>", line 3, in divide TypeError: unsupported operand type(s) for /: 'str' and 'str'
pl: >>> def divide(x, y): ... try: ... result = x / y ... except ZeroDivisionError: ... print("dzielenie przez zero!") ... else: ... print("wynik to", result) ... finally: ... print("wykonanie klauzuli finally") ... >>> divide(2, 1) wynik to 2.0 wykonanie klauzuli finally >>> divide(2, 0) dzielenie przez zero! wykonanie klauzuli finally >>> divide("2", "1") wykonanie klauzuli finally Traceback (most recent call last): File "<stdin>", line 1, in <module> File "<stdin>", line 3, in divide TypeError: unsupported operand type(s) for /: 'str' and 'str'

source: As you can see, the :keyword:`finally` clause is executed in any event. The :exc:`TypeError` raised by dividing two strings is not handled by the :keyword:`except` clause and therefore re-raised after the :keyword:`!finally` clause has been executed.
pl: Jak widać, klauzula :keyword:`finally` jest wykonywana w każdym przypadku. :exc:`TypeError` rzucony przez dzielenie dwóch ciągów znaków nie jest obsłużony przez klauzulę :keyword:`except` i dlatego jest ponownie rzucony po wykonaniu klauzuli :keyword:`!finally`.

source: In real world applications, the :keyword:`finally` clause is useful for releasing external resources (such as files or network connections), regardless of whether the use of the resource was successful.
pl: W prawdziwych aplikacjach, klauzula :keyword:`finally` jest przydatna do zwalniania zewnętrznych zasobów (takich jak pliki lub połączenia sieciowe), niezależnie od tego, czy użycie zasobu zakończyło się powodzeniem.

source: Predefined Clean-up Actions
pl: Predefiniowane akcje porządkujące

source: Some objects define standard clean-up actions to be undertaken when the object is no longer needed, regardless of whether or not the operation using the object succeeded or failed. Look at the following example, which tries to open a file and print its contents to the screen. ::
pl: Niektóre obiekty definiują standardowe akcje porządkujące, które mają zostać podjęte, gdy obiekt nie jest już potrzebny, niezależnie od tego, czy operacja przy użyciu obiektu powiodła się, czy nie. Spójrz na poniższy przykład, który próbuje otworzyć plik i wydrukować jego zawartość na ekranie::

source: for line in open("myfile.txt"): print(line, end="")
pl: for line in open("moj_plik.txt"): print(line, end="")

source: The problem with this code is that it leaves the file open for an indeterminate amount of time after this part of the code has finished executing. This is not an issue in simple scripts, but can be a problem for larger applications. The :keyword:`with` statement allows objects like files to be used in a way that ensures they are always cleaned up promptly and correctly. ::
pl: Problem z tym kodem polega na tym, że pozostawia on plik otwarty przez nieokreślony czas po zakończeniu wykonywania tej części kodu. Nie jest to problemem w prostych skryptach, ale może być problemem dla większych aplikacjach. Instrukcja :keyword:`with` pozwala na używanie obiektów takich jak pliki w sposób, który zapewnia, że są one zawsze czyszczone szybko i poprawnie::

source: with open("myfile.txt") as f: for line in f: print(line, end="")
pl: with open("moj_plik.txt") as f: for line in f: print(line, end="")

source: After the statement is executed, the file *f* is always closed, even if a problem was encountered while processing the lines. Objects which, like files, provide predefined clean-up actions will indicate this in their documentation.
pl: Po wykonaniu instrukcji, plik *f* jest zawsze zamykany, nawet jeśli napotkano problem podczas przetwarzania linii. Obiekty, które, podobnie jak pliki, zapewniają predefiniowane akcje czyszczenia, wskażą to w swojej dokumentacji.

source: Raising and Handling Multiple Unrelated Exceptions
pl: Rzucanie i obsługa wielu niepowiązanych wyjątków

source: There are situations where it is necessary to report several exceptions that have occurred. This is often the case in concurrency frameworks, when several tasks may have failed in parallel, but there are also other use cases where it is desirable to continue execution and collect multiple errors rather than raise the first exception.
pl: Istnieją sytuacje, w których konieczne jest zgłoszenie kilku wyjątków, które wystąpiły. Dzieje się tak często w przypadku frameworków współbieżności, gdy kilka zadań może zakończyć się niepowodzeniem równolegle, ale istnieją również inne przypadki użycia, w których pożądane jest kontynuowanie wykonywania i zbieranie wielu błędów zamiast rzucenia pierwszego wyjątku.

source: The builtin :exc:`ExceptionGroup` wraps a list of exception instances so that they can be raised together. It is an exception itself, so it can be caught like any other exception. ::
pl: Wbudowana :exc:`ExceptionGroup` zawiera listę instancji wyjątków, dzięki czemu mogą one być rzucone razem. Sama w sobie jest wyjątkiem, więc może być przechwycona jak każdy inny wyjątek::

source: >>> def f(): ... excs = [OSError('error 1'), SystemError('error 2')] ... raise ExceptionGroup('there were problems', excs) ... >>> f() + Exception Group Traceback (most recent call last): | File "<stdin>", line 1, in <module> | File "<stdin>", line 3, in f | ExceptionGroup: there were problems +-+---------------- 1 ---------------- | OSError: error 1 +---------------- 2 ---------------- | SystemError: error 2 +------------------------------------ >>> try: ... f() ... except Exception as e: ... print(f'caught {type(e)}: e') ... caught <class 'ExceptionGroup'>: e >>>
pl: >>> def f(): ... excs = [OSError('błąd 1'), SystemError('błąd 2')] ... raise ExceptionGroup('wystąpiły problemy', excs) ... >>> f() + Exception Group Traceback (most recent call last): | File "<stdin>", line 1, in <module> | File "<stdin>", line 3, in f | ExceptionGroup: wystąpiły problemy +-+---------------- 1 ---------------- | OSError: błąd 1 +---------------- 2 ---------------- | SystemError: błąd 2 +------------------------------------ >>> try: ... f() ... except Exception as e: ... print(f'przechwycono {type(e)}: e') ... przechwycono <class 'ExceptionGroup'>: e >>>

source: By using ``except*`` instead of ``except``, we can selectively handle only the exceptions in the group that match a certain type. In the following example, which shows a nested exception group, each ``except*`` clause extracts from the group exceptions of a certain type while letting all other exceptions propagate to other clauses and eventually to be reraised. ::
pl: Używając ``except*`` zamiast ``except``, możemy selektywnie obsługiwać tylko te wyjątki w grupie, które pasują do określonego typu. W poniższym przykładzie, który pokazuje zagnieżdżoną grupę wyjątków, każda klauzula ``except*`` wyodrębnia z grupy wyjątki określonego typu, pozwalając wszystkim innym wyjątkom propagować się do innych klauzul i ostatecznie być ponownie zgłaszanymi. ::

source: >>> def f(): ... raise ExceptionGroup( ... "group1", ... [ ... OSError(1), ... SystemError(2), ... ExceptionGroup( ... "group2", ... [ ... OSError(3), ... RecursionError(4) ... ] ... ) ... ] ... ) ... >>> try: ... f() ... except* OSError as e: ... print("There were OSErrors") ... except* SystemError as e: ... print("There were SystemErrors") ... There were OSErrors There were SystemErrors + Exception Group Traceback (most recent call last): | File "<stdin>", line 2, in <module> | File "<stdin>", line 2, in f | ExceptionGroup: group1 +-+---------------- 1 ---------------- | ExceptionGroup: group2 +-+---------------- 1 ---------------- | RecursionError: 4 +------------------------------------ >>>
pl: >>> def f(): ... raise ExceptionGroup( ... "grupa 1", ... [ ... OSError(1), ... SystemError(2), ... ExceptionGroup( ... "grupa 2", ... [ ... OSError(3), ... RecursionError(4) ... ] ... ) ... ] ... ) ... >>> try: ... f() ... except* OSError as e: ... print("Wystąpiły błędy typu OSError") ... except* SystemError as e: ... print("Wystąpiły błędy typu SystemError") ... Wystąpiły błędy typu OSError Wystąpiły błędy typu SystemError + Exception Group Traceback (most recent call last): | File "<stdin>", line 2, in <module> | File "<stdin>", line 2, in f | ExceptionGroup: grupa 1 +-+---------------- 1 ---------------- | ExceptionGroup: grupa 2 +-+---------------- 1 ---------------- | RecursionError: 4 +------------------------------------ >>>

source: Note that the exceptions nested in an exception group must be instances, not types. This is because in practice the exceptions would typically be ones that have already been raised and caught by the program, along the following pattern::
pl: Należy pamiętać, że wyjątki zagnieżdżone w grupie wyjątków muszą być instancjami, a nie typami. Wynika to z faktu, że w praktyce wyjątki są zazwyczaj tymi, które zostały już rzucone i przechwycone przez program, zgodnie z następującym wzorcem::

source: >>> excs = [] ... for test in tests: ... try: ... test.run() ... except Exception as e: ... excs.append(e) ... >>> if excs: ... raise ExceptionGroup("Test Failures", excs) ...
pl: >>> excs = [] ... for test in tests: ... try: ... test.run() ... except Exception as e: ... excs.append(e) ... >>> if excs: ... raise ExceptionGroup("Niepowodzenia testów", excs) ...

source: Enriching Exceptions with Notes
pl: Wzbogacanie wyjątków o notatki

source: When an exception is created in order to be raised, it is usually initialized with information that describes the error that has occurred. There are cases where it is useful to add information after the exception was caught. For this purpose, exceptions have a method ``add_note(note)`` that accepts a string and adds it to the exception's notes list. The standard traceback rendering includes all notes, in the order they were added, after the exception. ::
pl: Gdy wyjątek jest tworzony w celu rzucenia, jest on zwykle inicjowany informacjami opisującymi błąd, który wystąpił. Istnieją przypadki, w których przydatne jest dodanie informacji po przechwyceniu wyjątku. W tym celu wyjątki mają metodę ``add_note(note)``, która akceptuje ciąg znaków i dodaje go do listy notatek wyjątku. Standardowe renderowanie tracebacku zawiera wszystkie notatki, w kolejności, w jakiej zostały dodane, po wyjątku. ::

source: >>> try: ... raise TypeError('bad type') ... except Exception as e: ... e.add_note('Add some information') ... e.add_note('Add some more information') ... raise ... Traceback (most recent call last): File "<stdin>", line 2, in <module> TypeError: bad type Add some information Add some more information >>>
pl: >>> try: ... raise TypeError('niepoprawny typ') ... except Exception as e: ... e.add_note('Dodatkowa informacja') ... e.add_note('Więcej dodatkowej informacji') ... raise ... Traceback (most recent call last): File "<stdin>", line 2, in <module> TypeError: niepoprawny typ Dodatkowa informacja Więcej dodatkowej informacji >>>

source: For example, when collecting exceptions into an exception group, we may want to add context information for the individual errors. In the following each exception in the group has a note indicating when this error has occurred. ::
pl: Na przykład zbierając wyjątki w grupę wyjątków, możemy chcieć dodać informacje kontekstowe dla poszczególnych błędów. Poniżej każdy wyjątek w grupie ma notatkę wskazującą, kiedy wystąpił. ::

source: >>> def f(): ... raise OSError('operation failed') ... >>> excs = [] >>> for i in range(3): ... try: ... f() ... except Exception as e: ... e.add_note(f'Happened in Iteration {i+1}') ... excs.append(e) ... >>> raise ExceptionGroup('We have some problems', excs) + Exception Group Traceback (most recent call last): | File "<stdin>", line 1, in <module> | ExceptionGroup: We have some problems (3 sub-exceptions) +-+---------------- 1 ---------------- | Traceback (most recent call last): | File "<stdin>", line 3, in <module> | File "<stdin>", line 2, in f | OSError: operation failed | Happened in Iteration 1 +---------------- 2 ---------------- | Traceback (most recent call last): | File "<stdin>", line 3, in <module> | File "<stdin>", line 2, in f | OSError: operation failed | Happened in Iteration 2 +---------------- 3 ---------------- | Traceback (most recent call last): | File "<stdin>", line 3, in <module> | File "<stdin>", line 2, in f | OSError: operation failed | Happened in Iteration 3 +------------------------------------ >>>
pl: >>> def f(): ... raise OSError('operacja się nie powiodła') ... >>> excs = [] >>> for i in range(3): ... try: ... f() ... except Exception as e: ... e.add_note(f'Wystąpiło w iteracji {i+1}') ... excs.append(e) ... >>> raise ExceptionGroup('Napotkaliśmy problemy', excs) + Exception Group Traceback (most recent call last): | File "<stdin>", line 1, in <module> | ExceptionGroup: Napotkaliśmy problemy (3 sub-exceptions) +-+---------------- 1 ---------------- | Traceback (most recent call last): | File "<stdin>", line 3, in <module> | File "<stdin>", line 2, in f | OSError: operacja się nie powiodła | Wystąpiło w iteracji 1 +---------------- 2 ---------------- | Traceback (most recent call last): | File "<stdin>", line 3, in <module> | File "<stdin>", line 2, in f | OSError: operacja się nie powiodła | Wystąpiło w iteracji 2 +---------------- 3 ---------------- | Traceback (most recent call last): | File "<stdin>", line 3, in <module> | File "<stdin>", line 2, in f | OSError: operacja się nie powiodła | Wystąpiło w iteracji 3 +------------------------------------ >>>
