Repository: python/python-docs-pl
Catalog: tutorial/errors.po
Languages: pl

source: Errors and Exceptions
pl: Błędy i wyjątki

source: Until now error messages haven't been more than mentioned, but if you have tried out the examples you have probably seen some. There are (at least) two distinguishable kinds of errors: *syntax errors* and *exceptions*.
pl: Do tej pory wiadomości o błędach były tylko wspomniane, ale jeśli próbowałaś(-łeś) przykładów to pewnie udało ci się na nie natknąć. Występują (przynajmniej) dwa charakterystyczne typy błędów: *błędy składni* (syntax errors) oraz *wyjątki* (exceptions).

source: Syntax Errors
pl: Błędy składni

source: Syntax errors, also known as parsing errors, are perhaps the most common kind of complaint you get while you are still learning Python::
pl: Błędy składni, znane również jako błędy parsowania, są prawdopodobnie najczęstszym rodzajem skarg, które pojawiają się podczas nauki Pythona::

source: >>> while True print('Hello world') File "<stdin>", line 1 while True print('Hello world') ^^^^^ SyntaxError: invalid syntax
pl: >>> while True print('Witaj świecie') File "<stdin>", line 1 while True print('Witaj świecie') ^^^^^ SyntaxError: invalid syntax

source: The parser repeats the offending line and displays little 'arrow's pointing at the token in the line where the error was detected. The error may be caused by the absence of a token *before* the indicated token. In the example, the error is detected at the function :func:`print`, since a colon (``':'``) is missing before it. File name and line number are printed so you know where to look in case the input came from a script.
pl: Parser powtarza błędną linię i wyświetla małe „strzałki” wskazujące token w linii, w której wykryto błąd. Błąd może być spowodowany brakiem tokenu *przed* wskazywanym tokenem. W przykładzie błąd jest wykryty na funkcji :func:`print`, ponieważ brakuje przed nią dwukropka (``':'``). Nazwa pliku i numer linii są drukowane, abyś wiedział(a), gdzie szukać, w przypadku, gdy dane wejściowe pochodzą ze skryptu.

source: Exceptions
pl: Wyjątki

source: Even if a statement or expression is syntactically correct, it may cause an error when an attempt is made to execute it. Errors detected during execution are called *exceptions* and are not unconditionally fatal: you will soon learn how to handle them in Python programs. Most exceptions are not handled by programs, however, and result in error messages as shown here::
pl: Nawet jeśli instrukcja lub wyrażenie jest poprawne składniowo, może ona wywołać błąd podczas próby jej wykonania. Błędy zauważone podczas wykonania programu są nazywane *wyjątkami* (exceptions) i nie zawsze są niedopuszczalne: już niedługo nauczysz w jaki sposób je obsługiwać. Większość wyjątków nie jest jednak obsługiwana przez program przez co wyświetlane są informacje o błędzie jak pokazano poniżej::

source: The last line of the error message indicates what happened. Exceptions come in different types, and the type is printed as part of the message: the types in the example are :exc:`ZeroDivisionError`, :exc:`NameError` and :exc:`TypeError`. The string printed as the exception type is the name of the built-in exception that occurred. This is true for all built-in exceptions, but need not be true for user-defined exceptions (although it is a useful convention). Standard exception names are built-in identifiers (not reserved keywords).
pl: Ostatni wiersz komunikatu o błędzie wskazuje, co się stało. Wyjątki występują w różnych typach, a typ jest drukowany jako część komunikatu: typy w przykładzie to :exc:`ZeroDivisionError`, :exc:`NameError` i :exc:`TypeError`. Ciąg wydrukowany jako typ wyjątku jest nazwą wbudowanego wyjątku, który wystąpił. Jest to prawdą dla wszystkich wbudowanych wyjątków, ale nie musi być prawdą dla wyjątków zdefiniowanych przez użytkownika (choć jest to przydatna konwencja). Standardowe nazwy wyjątków są wbudowanymi identyfikatorami (nie zarezerwowanymi słowami kluczowymi).

source: The rest of the line provides detail based on the type of exception and what caused it.
pl: Pozostała część linii dostarcza szczegółów na temat typu wyjątku oraz informacji, co go spowodowało.

source: The preceding part of the error message shows the context where the exception occurred, in the form of a stack traceback. In general it contains a stack traceback listing source lines; however, it will not display lines read from standard input.
pl: Wcześniejsza część komunikatu o błędzie pokazuje kontekst, w którym wystąpił wyjątek, w postaci śladu stosu. Ogólnie rzecz biorąc, zawiera on ślad stosu z listą linii źródłowych; jednak nie wyświetli linii odczytanych ze standardowego wejścia.

source: :ref:`bltin-exceptions` lists the built-in exceptions and their meanings.
pl: :ref:`bltin-exceptions` wymienia wbudowane wyjątki i ich znaczenie.

source: Handling Exceptions
pl: Obsługa wyjątków

source: It is possible to write programs that handle selected exceptions. Look at the following example, which asks the user for input until a valid integer has been entered, but allows the user to interrupt the program (using :kbd:`Control-C` or whatever the operating system supports); note that a user-generated interruption is signalled by raising the :exc:`KeyboardInterrupt` exception. ::
pl: Możliwe jest pisanie programów, które obsługują wybrane wyjątki. Spójrzmy na poniższy przykład, który prosi użytkownika o wprowadzenie danych, dopóki nie zostanie wprowadzona poprawna liczba całkowita, ale pozwala użytkownikowi na przerwanie programu (przy użyciu :kbd:`Control-C` lub czegokolwiek innego obsługiwanego przez system operacyjny); zauważ, że przerwanie wygenerowane przez użytkownika jest sygnalizowane przez podniesienie wyjątku :exc:`KeyboardInterrupt`. ::

source: >>> while True: ... try: ... x = int(input("Please enter a number: ")) ... break ... except ValueError: ... print("Oops! That was no valid number. Try again...") ...
pl: >>> while True: ... try: ... x = int(input("Proszę podaj liczbę: ")) ... break ... except ValueError: ... print("Ups! To nie była poprawna liczba. Spróbuj ponownie...") ...

source: The :keyword:`try` statement works as follows.
pl: Instrukcja :keyword:`try` działa następująco.

source: First, the *try clause* (the statement(s) between the :keyword:`try` and :keyword:`except` keywords) is executed.
pl: W pierwszej kolejności wykonywane są instrukcje pod klauzulą *try* - pomiędzy słowami kluczowymi :keyword:`try` i :keyword:`except`.

source: If no exception occurs, the *except clause* is skipped and execution of the :keyword:`try` statement is finished.
pl: Jeżeli nie wystąpi żaden wyjątek, klauzula *except* jest pomijana i zostaje zakończone wykonywanie instrukcji :keyword:`try`.

source: If an exception occurs during execution of the :keyword:`try` clause, the rest of the clause is skipped. Then, if its type matches the exception named after the :keyword:`except` keyword, the *except clause* is executed, and then execution continues after the try/except block.
pl: Jeśli wyjątek wystąpi podczas wykonywania klauzuli :keyword:`try`, reszta klauzuli jest pomijana. Następnie, jeśli jego typ pasuje do wyjątku nazwanego po słowie kluczowym :keyword:`except`, wykonywana jest *klauzula except*, a następnie wykonanie jest kontynuowane po bloku try/except.

source: If an exception occurs which does not match the exception named in the *except clause*, it is passed on to outer :keyword:`try` statements; if no handler is found, it is an *unhandled exception* and execution stops with an error message.
pl: Jeśli wystąpi wyjątek, który nie pasuje do wyjątku nazwanego w *klauzuli except*, jest on przekazywany do zewnętrznych instrukcji :keyword:`try`; jeśli nie zostanie znaleziona obsługa, jest to *nieobsłużony wyjątek* i wykonanie zatrzymuje się z komunikatem błędu.

source: A :keyword:`try` statement may have more than one *except clause*, to specify handlers for different exceptions. At most one handler will be executed. Handlers only handle exceptions that occur in the corresponding *try clause*, not in other handlers of the same :keyword:`!try` statement. An *except clause* may name multiple exceptions as a parenthesized tuple, for example::
pl: Instrukcja :keyword:`try` może mieć więcej niż jedną *klauzulę except*, aby określić programy obsługi dla różnych wyjątków. Wykonany zostanie co najwyżej jeden handler. Obsługiwane są tylko wyjątki, które występują w odpowiadających im *klauzulach try*, a nie w kodzie obsługi tej samej instrukcji :keyword:`!try`. *Klauzula except* może określać wiele wyjątków krotką w nawiasach, na przykład::

source: A class in an :keyword:`except` clause matches exceptions which are instances of the class itself or one of its derived classes (but not the other way around --- an *except clause* listing a derived class does not match instances of its base classes). For example, the following code will print B, C, D in that order::
pl: Klasa w klauzuli :keyword:`except` obsługuje wyjątki, które są instancjami samej klasy lub jednej z jej klas pochodnych (ale nie na odwrót --- *klauzula except* wymieniająca klasę pochodną nie obsłuży instancji jej klas bazowych). Na przykład, poniższy kod wypisze B, C, D w tej kolejności::

source: Note that if the *except clauses* were reversed (with ``except B`` first), it would have printed B, B, B --- the first matching *except clause* is triggered.
pl: Zauważ, że jeśli *klauzule except* byłyby odwrócone (z ``except B`` na pierwszym miejscu), wypisane zostałoby B, B, B --- uruchamiana jest pierwsza pasująca *klauzula except*.

source: When an exception occurs, it may have associated values, also known as the exception's *arguments*. The presence and types of the arguments depend on the exception type.
pl: Gdy wystąpi wyjątek, może on mieć powiązane wartości, znane również jako *argumenty* wyjątku. Obecność i typy argumentów zależą od typu wyjątku.

source: The *except clause* may specify a variable after the exception name. The variable is bound to the exception instance which typically has an ``args`` attribute that stores the arguments. For convenience, builtin exception types define :meth:`~object.__str__` to print all the arguments without explicitly accessing ``.args``. ::
pl: *Klauzula except* może określać nazwę zmiennej po nazwie wyjątku. Zmienna jest powiązana z instancją wyjątku, która zazwyczaj posiada atrybut ``args`` przechowujący argumenty. Dla wygody, typy wyjątków wbudowanych definiują :meth:`~object.__str__` drukującą wszystkie argumenty bez odwoływania się do ``.args``. ::

source: >>> try: ... raise Exception('spam', 'eggs') ... except Exception as inst: ... print(type(inst)) # the exception type ... print(inst.args) # arguments stored in .args ... print(inst) # __str__ allows args to be printed directly, ... # but may be overridden in exception subclasses ... x, y = inst.args # unpack args ... print('x =', x) ... print('y =', y) ... <class 'Exception'> ('spam', 'eggs') ('spam', 'eggs') x = spam y = eggs
pl: >>> try: ... raise Exception('szynka', 'jajka') ... except Exception as inst: ... print(type(inst)) # typ wyjątku ... print(inst.args) # argumenty przechowywane w .args ... print(inst) # metoda __str__ pozwala na wypisanie args bezpośrednio, ... # ale jej definicja może być nadpisana w klasach dziedziczących ... x, y = inst.args # rozpakowanie argumentów ... print('x =', x) ... print('y =', y) ... <class 'Exception'> ('szynka', 'jajka') ('szynka', 'jajka') x = szynka y = jajka

source: The exception's :meth:`~object.__str__` output is printed as the last part ('detail') of the message for unhandled exceptions.
pl: Dane wyjściowe metody :meth:`~object.__str__` wyjątku są drukowane jako ostatnia część ('szczegóły') komunikatu dla nieobsłużonych wyjątków.

source: :exc:`BaseException` is the common base class of all exceptions. One of its subclasses, :exc:`Exception`, is the base class of all the non-fatal exceptions. Exceptions which are not subclasses of :exc:`Exception` are not typically handled, because they are used to indicate that the program should terminate. They include :exc:`SystemExit` which is raised by :meth:`sys.exit` and :exc:`KeyboardInterrupt` which is raised when a user wishes to interrupt the program.
pl: :exc:`BaseException` jest wspólną klasą bazową wszystkich wyjątków. Jedna z jej podklas, :exc:`Exception`, jest klasą bazową wszystkich nie-fatalnych wyjątków. Wyjątki, które nie są podklasami :exc:`Exception` nie są zazwyczaj obsługiwane, ponieważ są używane do wskazania, że program powinien się zakończyć. Obejmują one :exc:`SystemExit`, który jest rzucany przez :meth:`sys.exit` i :exc:`KeyboardInterrupt`, które są rzucane, gdy użytkownik chce przerwać program.

source: :exc:`Exception` can be used as a wildcard that catches (almost) everything. However, it is good practice to be as specific as possible with the types of exceptions that we intend to handle, and to allow any unexpected exceptions to propagate on.
pl: :exc:`Exception` może być używany jako symbol wieloznaczny, który przechwytuje (prawie) wszystko. Dobrą praktyką jest jednak jak najdokładniejsze określenie typów wyjątków, które zamierzamy obsługiwać, i umożliwienie propagacji wszelkim nieoczekiwanym wyjątkom.

source: The most common pattern for handling :exc:`Exception` is to print or log the exception and then re-raise it (allowing a caller to handle the exception as well)::
pl: Najczęstszym wzorcem obsługi :exc:`Exception` jest drukowanie lub umieszczenie wyjątku w logach, a następnie ponowne rzucenie go (umożliwiając również obsługę wyjątku funkcji, w której znajduje się wywołanie)::

source: import sys try: f = open('myfile.txt') s = f.readline() i = int(s.strip()) except OSError as err: print("OS error:", err) except ValueError: print("Could not convert data to an integer.") except Exception as err: print(f"Unexpected {err=}, {type(err)=}") raise
pl: import sys try: f = open('moj_plik.txt') s = f.readline() i = int(s.strip()) except OSError as err: print("Błąd OS:", err) except ValueError: print("Nie udało się przekonwertować danych na liczbę całkowitą.") except Exception as err: print(f"Nieoczekiwany {err=}, {type(err)=}") raise

source: The :keyword:`try` ... :keyword:`except` statement has an optional *else clause*, which, when present, must follow all *except clauses*. It is useful for code that must be executed if the *try clause* does not raise an exception. For example::
pl: Instrukcja :keyword:`try` … :keyword:`except` posiada opcjonalną *klauzulę else*, która, gdy jest obecna, musi następować po wszystkich *klauzulach except*. Jest to przydatne w przypadku kodu, który musi zostać wykonany, jeśli *klauzula try* nie rzuci wyjątku. Na przykład::

source: for arg in sys.argv[1:]: try: f = open(arg, 'r') except OSError: print('cannot open', arg) else: print(arg, 'has', len(f.readlines()), 'lines') f.close()
pl: for arg in sys.argv[1:]: try: f = open(arg, 'r') except OSError: print('nie mogę otworzyć', arg) else: print(arg, 'ma', len(f.readlines()), 'linii') f.close()

source: The use of the :keyword:`!else` clause is better than adding additional code to the :keyword:`try` clause because it avoids accidentally catching an exception that wasn't raised by the code being protected by the :keyword:`!try` ... :keyword:`!except` statement.
pl: Użycie klauzuli :keyword:`!else` jest lepsze niż dodanie dodatkowego kodu do klauzuli :keyword:`try`, ponieważ pozwala uniknąć przypadkowego wychwycenia wyjątku, który nie został rzucony przez kod chroniony instrukcją :keyword:`!try`… :keyword:`!except`.

source: Exception handlers do not handle only exceptions that occur immediately in the *try clause*, but also those that occur inside functions that are called (even indirectly) in the *try clause*. For example::
pl: Instrukcja `try` … `catch` nie obsługuje tylko wyjątków, które występują bezpośrednio w *klauzuli try*, ale także te, które występują wewnątrz funkcji, które są wywoływane (nawet pośrednio) w *klauzuli try*. Na przykład::

source: >>> def this_fails(): ... x = 1/0 ... >>> try: ... this_fails() ... except ZeroDivisionError as err: ... print('Handling run-time error:', err) ... Handling run-time error: division by zero
pl: >>> def this_fails(): ... x = 1/0 ... >>> try: ... this_fails() ... except ZeroDivisionError as err: ... print('Błąd w czasie wykonania:', err) ... Błąd w czasie wykonania: division by zero

source: Raising Exceptions
pl: Rzucanie wyjątków

source: The :keyword:`raise` statement allows the programmer to force a specified exception to occur. For example::
pl: Instrukcja :keyword:`raise` pozwala programiście wymusić wystąpienie żądanego wyjątku. Na przykład::

source: >>> raise NameError('HiThere') Traceback (most recent call last): File "<stdin>", line 1, in <module> NameError: HiThere
pl: >>> raise NameError('Cześć!') Traceback (most recent call last): File "<stdin>", line 1, in <module> NameError: Cześć!

source: The sole argument to :keyword:`raise` indicates the exception to be raised. This must be either an exception instance or an exception class (a class that derives from :class:`BaseException`, such as :exc:`Exception` or one of its subclasses). If an exception class is passed, it will be implicitly instantiated by calling its constructor with no arguments::
pl: Jedyny argument do :keyword:`raise` wskazuje wyjątek, który ma być rzucony. Musi to być albo instancja wyjątku, albo klasa wyjątku (klasa dziedzicząca z :class:`BaseException`, taka jak :exc:`Exception` lub jedna z jej podklas). Jeśli przekazana zostanie klasa wyjątku, zostanie ona niejawnie zainicjowana przez wywołanie jej konstruktora bez argumentów::

source: raise ValueError # shorthand for 'raise ValueError()'
pl: raise ValueError # skrót dla 'raise ValueError()'

source: If you need to determine whether an exception was raised but don't intend to handle it, a simpler form of the :keyword:`raise` statement allows you to re-raise the exception::
pl: Jeśli chcesz rozpoznać, czy wyjątek został rzucony, ale nie zamierzasz go obsługiwać, prostsza forma instrukcji :keyword:`raise` pozwala na ponowne rzucenie wyjątku::

source: >>> try: ... raise NameError('HiThere') ... except NameError: ... print('An exception flew by!') ... raise ... An exception flew by! Traceback (most recent call last): File "<stdin>", line 2, in <module> NameError: HiThere
pl: >>> try: ... raise NameError('Cześć!') ... except NameError: ... print('Minął mnie wyjątek!') ... raise ... Minął mnie wyjątek! Traceback (most recent call last): File "<stdin>", line 2, in <module> NameError: Cześć!

source: Exception Chaining
pl: Łańcuch wyjątków

source: If an unhandled exception occurs inside an :keyword:`except` section, it will have the exception being handled attached to it and included in the error message::
pl: Jeśli nieobsłużony wyjątek wystąpi wewnątrz sekcji :keyword:`except`, zostanie do niego dołączony obsługiwany wyjątek i uwzględniony w komunikacie o błędzie::

source: >>> try: ... open("database.sqlite") ... except OSError: ... raise RuntimeError("unable to handle error") ... Traceback (most recent call last): File "<stdin>", line 2, in <module> FileNotFoundError: [Errno 2] No such file or directory: 'database.sqlite' During handling of the above exception, another exception occurred: Traceback (most recent call last): File "<stdin>", line 4, in <module> RuntimeError: unable to handle error
pl: >>> try: ... open("database.sqlite") ... except OSError: ... raise RuntimeError("nie udało się obsłużyć błędu") ... Traceback (most recent call last): File "<stdin>", line 2, in <module> FileNotFoundError: [Errno 2] No such file or directory: 'database.sqlite' During handling of the above exception, another exception occurred: Traceback (most recent call last): File "<stdin>", line 4, in <module> RuntimeError: nie udało się obsłużyć błędu

source: To indicate that an exception is a direct consequence of another, the :keyword:`raise` statement allows an optional :keyword:`from<raise>` clause::
pl: Aby wskazać, że wyjątek jest bezpośrednią konsekwencją innego, instrukcja :keyword:`raise` dopuszcza opcjonalną klauzulę :keyword:`from<raise>`::

source: # exc must be exception instance or None. raise RuntimeError from exc
pl: # exc musi być instancją klasy Exception albo mieć wartość None raise RuntimeError from exc

source: This can be useful when you are transforming exceptions. For example::
pl: Może to być przydatne podczas przekształcania wyjątków. Na przykład::

source: >>> def func(): ... raise ConnectionError ... >>> try: ... func() ... except ConnectionError as exc: ... raise RuntimeError('Failed to open database') from exc ... Traceback (most recent call last): File "<stdin>", line 2, in <module> File "<stdin>", line 2, in func ConnectionError The above exception was the direct cause of the following exception: Traceback (most recent call last): File "<stdin>", line 4, in <module> RuntimeError: Failed to open database
pl: >>> def func(): ... raise ConnectionError ... >>> try: ... func() ... except ConnectionError as exc: ... raise RuntimeError('Nie udało się otworzyć bazy danych') from exc ... Traceback (most recent call last): File "<stdin>", line 2, in <module> File "<stdin>", line 2, in func ConnectionError The above exception was the direct cause of the following exception: Traceback (most recent call last): File "<stdin>", line 4, in <module> RuntimeError: Nie udało się otworzyć bazy danych

source: It also allows disabling automatic exception chaining using the ``from None`` idiom::
pl: Umożliwia również wyłączenie automatycznego łączenia wyjątków przy użyciu idiomu ``from None``::

source: For more information about chaining mechanics, see :ref:`bltin-exceptions`.
pl: Więcej informacji na temat mechaniki łączenia w łańcuchy można znaleźć w rozdziale :ref:`bltin-exceptions`.

source: User-defined Exceptions
pl: Wyjątki zdefiniowane przez użytkownika

source: Programs may name their own exceptions by creating a new exception class (see :ref:`tut-classes` for more about Python classes). Exceptions should typically be derived from the :exc:`Exception` class, either directly or indirectly.
pl: Programy mogą nazywać własne wyjątki, tworząc nową klasę wyjątków (więcej informacji na temat klas Python można znaleźć w rozdziale :ref:`tut-classes`). Wyjątki powinny zazwyczaj dziedziczyć z klasy :exc:`Exception`, bezpośrednio lub pośrednio.

source: Exception classes can be defined which do anything any other class can do, but are usually kept simple, often only offering a number of attributes that allow information about the error to be extracted by handlers for the exception.
pl: Można zdefiniować klasy wyjątków, które robią wszystko, co może zrobić każda inna klasa, ale zwykle są one proste, często oferując tylko kilka atrybutów, które pozwalają na wyodrębnienie informacji o błędzie przez kod obsługi wyjątku.

source: Most exceptions are defined with names that end in "Error", similar to the naming of the standard exceptions.
pl: Większość wyjątków ma nazwy kończące się na „Error”, podobnie jak w przypadku standardowych wyjątków.

source: Many standard modules define their own exceptions to report errors that may occur in functions they define.
pl: Wiele standardowych modułów definiuje własne wyjątki w celu zgłaszania błędów, które mogą wystąpić w zdefiniowanych w nich funkcjach.

source: Defining Clean-up Actions
pl: Definiowanie działań porządkujących

source: The :keyword:`try` statement has another optional clause which is intended to define clean-up actions that must be executed under all circumstances. For example::
pl: Instrukcja :keyword:`try` ma inną opcjonalną klauzulę, która jest przeznaczona do definiowania działań porządkujących, które muszą być wykonane w każdych okolicznościach. Na przykład::
