Repository: python/python-docs-pl
Catalog: tutorial/floatingpoint.po
Languages: pl

source: Floating-Point Arithmetic: Issues and Limitations
pl: Arytmetyka liczb zmiennoprzecinkowych: problemy i ograniczenia

source: Floating-point numbers are represented in computer hardware as base 2 (binary) fractions. For example, the **decimal** fraction ``0.625`` has value 6/10 + 2/100 + 5/1000, and in the same way the **binary** fraction ``0.101`` has value 1/2 + 0/4 + 1/8. These two fractions have identical values, the only real difference being that the first is written in base 10 fractional notation, and the second in base 2.
pl: Liczby zmiennoprzecinkowe są reprezentowane w komputerze jako ułamki o podstawie 2 (binarne). Na przykład **dziesiętny** ułamek ``0.625`` ma wartość 6/10 + 2/100 + 5/1000 i analogicznie **binarny** ułamek ``0.101`` ma wartość 1/2 + 0/4 + 1/8. Te dwa ułamki mają identyczne wartości, a jedyną prawdziwą różnicą jest to, że pierwszy jest zapisany w notacji ułamkowej o podstawie 10, a drugi o podstawie 2.

source: Unfortunately, most decimal fractions cannot be represented exactly as binary fractions. A consequence is that, in general, the decimal floating-point numbers you enter are only approximated by the binary floating-point numbers actually stored in the machine.
pl: Niestety, większości ułamków dziesiętnych nie można przedstawić dokładnie jako ułamków binarnych. Konsekwencją jest to, że ogólnie wprowadzane dziesiętne liczby zmiennoprzecinkowe są jedynie przybliżane przez binarne liczby zmiennoprzecinkowe faktycznie przechowywane w maszynie.

source: The problem is easier to understand at first in base 10. Consider the fraction 1/3. You can approximate that as a base 10 fraction::
pl: Problem jest łatwiejszy do zrozumienia na początku przy podstawie 10. Rozważ ułamek 1/3. Możesz go przybliżyć jako ułamek o podstawie 10::

source: or, better, ::
pl: albo lepiej::

source: and so on. No matter how many digits you're willing to write down, the result will never be exactly 1/3, but will be an increasingly better approximation of 1/3.
pl: i tak dalej. Bez względu na to, ile cyfr jesteś w stanie zapisać, wynik nigdy nie będzie dokładnie 1/3, ale będzie coraz lepszym przybliżeniem 1/3.

source: In the same way, no matter how many base 2 digits you're willing to use, the decimal value 0.1 cannot be represented exactly as a base 2 fraction. In base 2, 1/10 is the infinitely repeating fraction ::
pl: W ten sam sposób, bez względu na to, ile cyfr o podstawie 2 chcesz użyć, wartość dziesiętna 0,1 nie może być dokładnie przedstawiona jako ułamek o podstawie 2. W podstawie 2, 1/10 to ułamek okresowy ::

source: Stop at any finite number of bits, and you get an approximation. On most machines today, floats are approximated using a binary fraction with the numerator using the first 53 bits starting with the most significant bit and with the denominator as a power of two. In the case of 1/10, the binary fraction is ``3602879701896397 / 2 ** 55`` which is close to but not exactly equal to the true value of 1/10.
pl: Zatrzymaj się na dowolnej skończonej liczbie bitów, a otrzymasz przybliżenie. Na większości dzisiejszych maszyn liczby zmiennoprzecinkowe są aproksymowane przy użyciu ułamka binarnego z licznikiem wykorzystującym pierwsze 53 bity, zaczynając od najbardziej znaczącego bitu i mianownikiem jako potęgą dwójki. W przypadku 1/10 ułamek binarny jest równy ``3602879701896397 / 2 ** 55`` i jest zbliżony do prawdziwej wartości 1/10, ale nie do końca jej równy.

source: Many users are not aware of the approximation because of the way values are displayed. Python only prints a decimal approximation to the true decimal value of the binary approximation stored by the machine. On most machines, if Python were to print the true decimal value of the binary approximation stored for 0.1, it would have to display::
pl: Wielu użytkowników nie jest świadomych przybliżenia ze względu na sposób wyświetlania wartości. Python wypisuje tylko przybliżenie dziesiętne do prawdziwej wartości dziesiętnej przybliżenia binarnego zapisanego przez maszynę. Na większości maszyn, gdyby Python miał wydrukować prawdziwą wartość dziesiętną przybliżenia binarnego zapisanego dla 0,1 musiałby wyświetlić::

source: That is more digits than most people find useful, so Python keeps the number of digits manageable by displaying a rounded value instead:
pl: To więcej cyfr, niż większość ludzi uważa za przydatne, więc Python utrzymuje liczbę cyfr tak by były one do opanowania, wyświetlając zamiast tego zaokrągloną wartość:

source: Just remember, even though the printed result looks like the exact value of 1/10, the actual stored value is the nearest representable binary fraction.
pl: Pamiętaj tylko, że chociaż wydrukowany wynik wygląda jak dokładna wartość 1/10, rzeczywista zapisana wartość to najbliższa reprezentatywna część binarna.

source: Interestingly, there are many different decimal numbers that share the same nearest approximate binary fraction. For example, the numbers ``0.1`` and ``0.10000000000000001`` and ``0.1000000000000000055511151231257827021181583404541015625`` are all approximated by ``3602879701896397 / 2 ** 55``. Since all of these decimal values share the same approximation, any one of them could be displayed while still preserving the invariant ``eval(repr(x)) == x``.
pl: Co ciekawe, istnieje wiele różnych liczb dziesiętnych, które mają ten sam najbliższy przybliżony ułamek binarny. Na przykład liczby ``0.1``, ``0.10000000000000001`` i ``0.1000000000000000055511151231257827021181583404541015625`` są wszystkie przybliżone przez ``3602879701896397 / 2 ** 55``. Ponieważ wszystkie te wartości dziesiętne mają to samo przybliżenie, każda z nich może zostać wyświetlona przy jednoczesnym zachowaniu niezmiennika ``eval(repr(x)) == x``.

source: Historically, the Python prompt and built-in :func:`repr` function would choose the one with 17 significant digits, ``0.10000000000000001``. Starting with Python 3.1, Python (on most systems) is now able to choose the shortest of these and simply display ``0.1``.
pl: W przeszłości, interaktywny prompt oraz wbudowana funkcja Pythona :func:`repr` wybierały tę z 17 cyframi znaczącymi, ``0.10000000000000001``. Począwszy od Pythona 3.1, Python (w większości systemów) może teraz wybrać najkrótszy z nich i po prostu wyświetlić ``0.1``.

source: Note that this is in the very nature of binary floating point: this is not a bug in Python, and it is not a bug in your code either. You'll see the same kind of thing in all languages that support your hardware's floating-point arithmetic (although some languages may not *display* the difference by default, or in all output modes).
pl: Zauważ, że leży to w samej naturze binarnej liczby zmiennoprzecinkowej: nie jest to błąd w Pythonie ani w twoim kodzie. Zobaczysz to samo we wszystkich językach obsługujących arytmetykę zmiennoprzecinkową twojego sprzętu (chociaż niektóre języki mogą nie *wyświetlać* różnicy domyślnie lub we wszystkich trybach wyjściowych).

source: For more pleasant output, you may wish to use string formatting to produce a limited number of significant digits:
pl: Aby uzyskać przyjemniejszy wynik, możesz użyć formatowania ciągu znaków w celu uzyskania ograniczonej liczby cyfr znaczących:

source: It's important to realize that this is, in a real sense, an illusion: you're simply rounding the *display* of the true machine value.
pl: Ważne jest, aby zdać sobie sprawę, że w rzeczywistości jest to złudzenie: po prostu zaokrąglasz *wyświetlanie* prawdziwej wartości zapisanej w komputerze.

source: One illusion may beget another. For example, since 0.1 is not exactly 1/10, summing three values of 0.1 may not yield exactly 0.3, either:
pl: Jedna iluzja może zrodzić kolejną. Na przykład, z powodu że 0,1 nie jest dokładnie 1/10, zsumowanie trzech wartości 0,1 może nie dać dokładnie 0,3:

source: Also, since the 0.1 cannot get any closer to the exact value of 1/10 and 0.3 cannot get any closer to the exact value of 3/10, then pre-rounding with :func:`round` function cannot help:
pl: Ponadto, ponieważ 0,1 nie może zbliżyć się do dokładnej wartości 1/10, a 0,3 nie może zbliżyć się do dokładnej wartości 3/10, to wstępne zaokrąglenie za pomocą funkcji :func:`round` nie może pomóc:

source: Though the numbers cannot be made closer to their intended exact values, the :func:`math.isclose` function can be useful for comparing inexact values:
pl: Chociaż liczb nie można już bardziej przybliżyć do ich dokładnych wartości, funkcja :func:`math.isclose` może być przydatna do porównywania niedokładnych wartości:

source: Alternatively, the :func:`round` function can be used to compare rough approximations:
pl: Alternatywnie do porównania zgrubnych przybliżeń można użyć funkcji :func:`round`:

source: Binary floating-point arithmetic holds many surprises like this. The problem with "0.1" is explained in precise detail below, in the "Representation Error" section. See `Examples of Floating Point Problems <https://jvns.ca/blog/2023/01/13/examples-of-floating-point-problems/>`_ for a pleasant summary of how binary floating point works and the kinds of problems commonly encountered in practice. Also see `The Perils of Floating Point <http://www.indowsway.com/floatingpoint.htm>`_ for a more complete account of other common surprises.
pl: Binarna arytmetyka zmiennoprzecinkowa kryje w sobie wiele takich niespodzianek. Problem z „0,1” został dokładnie wyjaśniony poniżej, w sekcji „Błąd reprezentacji”. Zobacz `Przykłady problemów zmiennoprzecinkowych <https://jvns.ca/blog/2023/01/13/examples-of-floating-point-problems/>`_ dla przyjemnego podsumowania jak działa binarna arytmetyka zmiennoprzecinkowa i jakie rodzaje problemów często spotyka się w praktyce. Zobacz także `The Perils of Floating Point <http://www.indowsway.com/floatingpoint.htm>`_ dla bardziej kompletnego opisu innych typowych niespodzianek.

source: As that says near the end, "there are no easy answers." Still, don't be unduly wary of floating point! The errors in Python float operations are inherited from the floating-point hardware, and on most machines are on the order of no more than 1 part in 2\*\*53 per operation. That's more than adequate for most tasks, but you do need to keep in mind that it's not decimal arithmetic and that every float operation can suffer a new rounding error.
pl: Jak jest tam napisane pod koniec, „nie ma łatwych odpowiedzi”. Mimo to nie należy nadmiernie uważać na liczby zmiennoprzecinkowe! Błędy w operacjach zmiennoprzecinkowych Pythona są dziedziczone z budowy komputera i na większości maszyn są rzędu nie więcej niż 1 przez 2\*\*53 na operację. Jest to więcej niż wystarczające dla większości zadań, ale należy pamiętać, że nie jest to arytmetyka dziesiętna i że każda operacja zmiennoprzecinkowa może napotkać nowy błąd zaokrąglenia.

source: While pathological cases do exist, for most casual use of floating-point arithmetic you'll see the result you expect in the end if you simply round the display of your final results to the number of decimal digits you expect. :func:`str` usually suffices, and for finer control see the :meth:`str.format` method's format specifiers in :ref:`formatstrings`.
pl: Chociaż istnieją przypadki skrajne, w większości przypadkowych zastosowań arytmetyki zmiennoprzecinkowej zobaczysz oczekiwany wynik, jeśli po prostu zaokrąglisz wyświetlanie końcowych wyników do oczekiwanej liczby cyfr dziesiętnych. :func:`str` zwykle wystarcza, lecz dla dokładniejszej kontroli możesz zobaczyć opis formatowania tekstu za pomocą metody :meth:`str.format` w :ref:`formatstrings`.

source: For use cases which require exact decimal representation, try using the :mod:`decimal` module which implements decimal arithmetic suitable for accounting applications and high-precision applications.
pl: W przypadkach użycia, które wymagają dokładnej reprezentacji dziesiętnej, spróbuj użyć modułu :mod:`decimal`, który implementuje arytmetykę dziesiętną odpowiednią dla aplikacji księgowych i aplikacji o wysokiej precyzji.

source: Another form of exact arithmetic is supported by the :mod:`fractions` module which implements arithmetic based on rational numbers (so the numbers like 1/3 can be represented exactly).
pl: Inną formą wspierającą arytmetykę dokładną jest moduł :mod:`fractions` realizujący arytmetykę opartą na liczbach wymiernych (aby liczby takie jak 1/3 mogły być reprezentowane dokładnie).

source: If you are a heavy user of floating-point operations you should take a look at the NumPy package and many other packages for mathematical and statistical operations supplied by the SciPy project. See <https://scipy.org>.
pl: Jeśli często korzystasz z operacji zmiennoprzecinkowych, powinieneś rzucić okiem na pakiet NumPy i wiele innych pakietów do operacji matematycznych i statystycznych dostarczonych przez projekt SciPy. Zobacz <https://scipy.org>.

source: Python provides tools that may help on those rare occasions when you really *do* want to know the exact value of a float. The :meth:`float.as_integer_ratio` method expresses the value of a float as a fraction:
pl: Python udostępnia narzędzia, które mogą pomóc w tych rzadkich przypadkach, gdy naprawdę *musisz* poznać dokładną wartość liczby zmiennoprzecinkowej. Metoda :meth:`float.as_integer_ratio` wyraża wartość float jako ułamek:

source: Since the ratio is exact, it can be used to losslessly recreate the original value:
pl: Ponieważ stosunek jest dokładny, można go użyć do bezstratnego odtworzenia oryginalnej wartości:

source: The :meth:`float.hex` method expresses a float in hexadecimal (base 16), again giving the exact value stored by your computer:
pl: Metoda :meth:`float.hex` wyraża liczbę zmiennoprzecinkową w systemie hexadecymalnym (podstawa 16), ponownie podając dokładną wartość przechowywaną przez komputer:

source: This precise hexadecimal representation can be used to reconstruct the float value exactly:
pl: Ta precyzyjna reprezentacja szesnastkowa może być wykorzystana do dokładnego zrekonstruowania wartości liczby zmiennoprzecinkowej:

source: Since the representation is exact, it is useful for reliably porting values across different versions of Python (platform independence) and exchanging data with other languages that support the same format (such as Java and C99).
pl: Ponieważ ta reprezentacja jest dokładna, przydatna jest ona do niezawodnego przenoszenia wartości między różnymi wersjami Pythona (niezależność od platformy) i wymiany danych z innymi językami obsługującymi ten sam format (takimi jak Java czy C99).

source: Another helpful tool is the :func:`sum` function which helps mitigate loss-of-precision during summation. It uses extended precision for intermediate rounding steps as values are added onto a running total. That can make a difference in overall accuracy so that the errors do not accumulate to the point where they affect the final total:
pl: Kolejnym pomocnym narzędziem jest funkcja :func:`sum`, która pomaga złagodzić utratę precyzji podczas sumowania. Używa rozszerzonej precyzji dla pośrednich kroków zaokrąglania, gdy wartości są dodawane do bieżącej sumy. Może to mieć wpływ na ogólną dokładność, aby błędy nie kumulowały się do punktu, w którym wpływają na ostateczny wynik:

source: Representation Error
pl: Błąd reprezentacji

source: This section explains the "0.1" example in detail, and shows how you can perform an exact analysis of cases like this yourself. Basic familiarity with binary floating-point representation is assumed.
pl: Ta sekcja wyjaśnia szczegółowo przykład „0,1” i pokazuje, jak samodzielnie przeprowadzić dokładną analizę takich przypadków. Zakładamy że masz podstawową znajomość binarnej reprezentacji liczb zmiennoprzecinkowych.

source: :dfn:`Representation error` refers to the fact that some (most, actually) decimal fractions cannot be represented exactly as binary (base 2) fractions. This is the chief reason why Python (or Perl, C, C++, Java, Fortran, and many others) often won't display the exact decimal number you expect.
pl: :dfn:`Błąd reprezentacji` odnosi się do faktu, że niektóre (właściwie większość) ułamków dziesiętnych nie może być reprezentowane dokładnie jako ułamki binarne (o podstawie 2). Jest to główny powód, dla którego Python (lub Perl, C, C++, Java, Fortran i wiele innych) często nie wyświetla dokładnie takiej liczby dziesiętnej, jakiej oczekujesz.

source: Why is that? 1/10 is not exactly representable as a binary fraction. Since at least 2000, almost all machines use IEEE 754 binary floating-point arithmetic, and almost all platforms map Python floats to IEEE 754 binary64 "double precision" values. IEEE 754 binary64 values contain 53 bits of precision, so on input the computer strives to convert 0.1 to the closest fraction it can of the form *J*/2**\ *N* where *J* is an integer containing exactly 53 bits. Rewriting ::
pl: Dlaczego? 1/10 nie jest dokładnie reprezentowalna jako ułamek binarny. Od co najmniej 2000 roku, prawie wszystkie dzisiejsze maszyny używają binarnej arytmetyki zmiennoprzecinkowej IEEE-754 i prawie wszystkie platformy odwzorowują liczby zmiennoprzecinkowe Pythona na „podwójną precyzję” IEEE-754 binary64. Wartości IEEE 754 binary64 zawierają 53 bity dokładności, więc na wejściu komputer stara się zamienić 0,1 na najbliższy możliwy ułamek w postaci *J*/2**\ *N*, gdzie *J* jest liczbą całkowitą zawierającą dokładnie 53 bity. Zapisując ::

source: as ::
pl: jako ::

source: and recalling that *J* has exactly 53 bits (is ``>= 2**52`` but ``< 2**53``), the best value for *N* is 56:
pl: i pamiętając, że *J* ma dokładnie 53 bity (jest ``>= 2**52`` ale ``< 2**53``), najlepszą wartością dla *N* jest 56:

source: That is, 56 is the only value for *N* that leaves *J* with exactly 53 bits. The best possible value for *J* is then that quotient rounded:
pl: Oznacza to, że 56 jest jedyną wartością dla *N*, która pozostawia *J* dokładnie 53 bity. Najlepszą możliwą wartością dla *J* jest zatem zaokrąglony iloraz:

source: Since the remainder is more than half of 10, the best approximation is obtained by rounding up:
pl: Ponieważ reszta jest większa niż połowa z 10, najlepsze przybliżenie uzyskuje się zaokrąglając w górę:

source: Therefore the best possible approximation to 1/10 in IEEE 754 double precision is::
pl: Dlatego najlepszym możliwym przybliżeniem do 1/10 w arytmetyce podwójnej precyzji typu IEEE 754 jest::

source: Dividing both the numerator and denominator by two reduces the fraction to::
pl: Podzielenie licznika i mianownika przez dwa zmniejsza ułamek do::

source: Note that since we rounded up, this is actually a little bit larger than 1/10; if we had not rounded up, the quotient would have been a little bit smaller than 1/10. But in no case can it be *exactly* 1/10!
pl: Zauważ, że ponieważ zaokrągliliśmy w górę, jest to w rzeczywistości trochę więcej niż 1/10; gdybyśmy nie zaokrąglili w górę, iloraz byłby nieco mniejszy niż 1/10. Ale w żadnym wypadku nie może to być *dokładnie* 1/10!

source: So the computer never "sees" 1/10: what it sees is the exact fraction given above, the best IEEE 754 double approximation it can get:
pl: Tak więc komputer nigdy nie „widzi” 1/10: to, co widzi, to dokładny ułamek podany powyżej, najlepsze przybliżenie w standardzie podwójnej precyzji IEEE 754, jakie może uzyskać:

source: If we multiply that fraction by 10\*\*55, we can see the value out to 55 decimal digits:
pl: Jeśli pomnożymy ten ułamek przez 10\*\*55, otrzymamy wartość z dokładnością do 55 cyfr dziesiętnych:

source: meaning that the exact number stored in the computer is equal to the decimal value 0.1000000000000000055511151231257827021181583404541015625. Instead of displaying the full decimal value, many languages (including older versions of Python), round the result to 17 significant digits:
pl: co oznacza, że ​​dokładna liczba zapisana w komputerze jest równa wartości dziesiętnej 0,1000000000000000055511151231257827021181583404541015625. Zamiast wyświetlać pełną wartość dziesiętną, wiele języków (w tym starsze wersje Pythona) zaokrągla wynik do 17 cyfr znaczących:

source: The :mod:`fractions` and :mod:`decimal` modules make these calculations easy:
pl: Moduły :mod:`fractions` oraz :mod:`decimal` ułatwiają tego typu obliczenia:
