Repository: python/python-docs-pl
Catalog: tutorial/inputoutput.po
Languages: pl

source: In text files (those opened without a ``b`` in the mode string), only seeks relative to the beginning of the file are allowed (the exception being seeking to the very file end with ``seek(0, 2)``) and the only valid *offset* values are those returned from the ``f.tell()``, or zero. Any other *offset* value produces undefined behaviour.
pl: W plikach tekstowych (otwieranych bez ``b`` w ciągu znaków trybu) dozwolone jest tylko wyszukiwanie względem początku pliku (wyjątkiem jest wyszukiwanie do samego końca pliku z ``seek(0, 2)``), a jedynymi poprawnymi wartościami *offset* są te zwrócone z ``f.tell()`` lub zero. Każda inna wartość *offset* powoduje niezdefiniowane zachowanie.

source: File objects have some additional methods, such as :meth:`~io.IOBase.isatty` and :meth:`~io.IOBase.truncate` which are less frequently used; consult the Library Reference for a complete guide to file objects.
pl: Obiekty plikowe mają kilka dodatkowych metod, takich jak :meth:`~io.IOBase.isatty` i :meth:`~io.IOBase.truncate`, które są rzadziej używane; zapoznaj się z Library Reference, aby uzyskać pełny przewodnik po obiektach plikowych.

source: Saving structured data with :mod:`json`
pl: Zapisywanie struktur danych przy użyciu modułu :mod:`json`

source: Strings can easily be written to and read from a file. Numbers take a bit more effort, since the :meth:`~io.TextIOBase.read` method only returns strings, which will have to be passed to a function like :func:`int`, which takes a string like ``'123'`` and returns its numeric value 123. When you want to save more complex data types like nested lists and dictionaries, parsing and serializing by hand becomes complicated.
pl: Ciągi znaków można łatwo zapisywać i odczytywać z pliku. Liczby wymagają nieco więcej wysiłku, ponieważ metoda :meth:`~io.TextIOBase.read` zwraca tylko ciągi znaków, które będą musiały zostać przekazane do funkcji takiej jak :func:`int`, która pobiera ciąg znaków taki jak ``'123'`` i zwraca jego wartość liczbową 123. W przypadku zapisywania bardziej złożonych typów danych, takich jak zagnieżdżone listy i słowniki, ręczne parsowanie i serializowanie staje się skomplikowane.

source: Rather than having users constantly writing and debugging code to save complicated data types to files, Python allows you to use the popular data interchange format called `JSON (JavaScript Object Notation) <https://json.org>`_. The standard module called :mod:`json` can take Python data hierarchies, and convert them to string representations; this process is called :dfn:`serializing`. Reconstructing the data from the string representation is called :dfn:`deserializing`. Between serializing and deserializing, the string representing the object may have been stored in a file or data, or sent over a network connection to some distant machine.
pl: Zamiast zmuszać użytkowników do ciągłego pisania i debugowania kodu w celu zapisania skomplikowanych typów danych do plików, Python pozwala na użycie popularnego formatu wymiany danych zwanego `JSON (JavaScript Object Notation) <https://json.org>`_. Standardowy moduł o nazwie :mod:`json` może pobierać hierarchie danych Pythona i konwertować je na reprezentacje ciągów znaków; proces ten nazywany jest :dfn:`serializacją`. Rekonstrukcja danych z reprezentacji łańcuchowej nazywana jest :dfn:`deserializacją`. Pomiędzy serializacją i deserializacją, ciąg znaków reprezentujący obiekt może być przechowywany w pliku lub bazie danych, lub wysłany przez połączenie sieciowe do odległej maszyny.

source: The JSON format is commonly used by modern applications to allow for data exchange. Many programmers are already familiar with it, which makes it a good choice for interoperability.
pl: Format JSON jest powszechnie używany przez nowoczesne aplikacje w celu umożliwienia wymiany danych. Wielu programistów jest już z nim zaznajomionych, co czyni go dobrym wyborem dla interoperacyjności.

source: If you have an object ``x``, you can view its JSON string representation with a simple line of code::
pl: Jeśli masz obiekt ``x``, możesz wyświetlić jego reprezentację JSON za pomocą prostej linii kodu::

source: Another variant of the :func:`~json.dumps` function, called :func:`~json.dump`, simply serializes the object to a :term:`text file`. So if ``f`` is a :term:`text file` object opened for writing, we can do this::
pl: Inny wariant funkcji :func:`~json.dumps`, zwany :func:`~json.dump`, po prostu serializuje obiekt do :term:`pliku tekstowego <text file>`. Jeśli więc ``f`` jest obiektem :term:`pliku tekstowego <text file>` otwartym do zapisu, możemy zrobić tak::

source: To decode the object again, if ``f`` is a :term:`binary file` or :term:`text file` object which has been opened for reading::
pl: Aby ponownie zdekodować obiekt, jeśli ``f`` jest obiektem :term:`pliku binarnego <binary file>` lub :term:`pliku tekstowego <text file>`, który został otwarty do odczytu::

source: JSON files must be encoded in UTF-8. Use ``encoding="utf-8"`` when opening JSON file as a :term:`text file` for both of reading and writing.
pl: Pliki JSON muszą być zakodowane w UTF-8. Użyj ``encoding="utf-8"`` podczas otwierania pliku JSON jako :term:`pliku tekstowego <text file>` zarówno do odczytu jak i zapisu.

source: This simple serialization technique can handle lists and dictionaries, but serializing arbitrary class instances in JSON requires a bit of extra effort. The reference for the :mod:`json` module contains an explanation of this.
pl: Ta prosta technika serializacji może obsługiwać listy i słowniki, ale serializacja dowolnych instancji klas w JSON wymaga nieco dodatkowego wysiłku. Wyjaśnienie tej kwestii znajduje się w dokumentacji modułu :mod:`json`.

source: :mod:`pickle` - the pickle module
pl: :mod:`pickle` – moduł pickle

source: Contrary to :ref:`JSON <tut-json>`, *pickle* is a protocol which allows the serialization of arbitrarily complex Python objects. As such, it is specific to Python and cannot be used to communicate with applications written in other languages. It is also insecure by default: deserializing pickle data coming from an untrusted source can execute arbitrary code, if the data was crafted by a skilled attacker.
pl: W przeciwieństwie do :ref:`JSON <tut-json>`, *pickle* jest protokołem, który pozwala na serializację dowolnie złożonych obiektów Pythona. Jako taki, jest specyficzny dla Pythona i nie może być używany do komunikacji z aplikacjami napisanymi w innych językach. Jest on również domyślnie niezabezpieczony: deserializacja danych pickle pochodzących z niezaufanego źródła może wykonać dowolny kod, jeśli dane zostały spreparowane przez doświadczonego atakującego.

source: built-in function
pl: funkcja wbudowana

source: open
pl: otwórz

source: object
pl: obiekt

source: file
pl: plik

source: module
pl: moduł
