Repository: python/python-docs-pl
Catalog: tutorial/interpreter.po
Languages: pl

source: Using the Python Interpreter
pl: Używanie interpretera Pythona

source: Invoking the Interpreter
pl: Wywoływanie Interpretera

source: The Python interpreter is usually installed as |usr_local_bin_python_x_dot_y_literal| on those machines where it is available; putting :file:`/usr/local/bin` in your Unix shell's search path makes it possible to start it by typing the command:
pl: Interpreter Pythona jest zazwyczaj zainstalowany jako |usr_local_bin_python_x_dot_y_literal| na maszynach, na których jest dostępny; wstawienie :file:`/usr/local/bin` w ścieżkę wyszukiwania uniksowego shella umożliwia jego uruchomienie przez wpisanie komendy:

source: to the shell. [#]_ Since the choice of the directory where the interpreter lives is an installation option, other places are possible; check with your local Python guru or system administrator. (E.g., :file:`/usr/local/python` is a popular alternative location.)
pl: do shella. [#]_ Jako że wybór katalogu, w którym znajdzie się interpreter, jest opcją instalacji, możliwe są inne lokalizacje; sprawdź ze swoim lokalnym pythonowym guru lub administratorem systemu. (Na przykład :file:`/usr/local/python` jest popularną alternatywną lokalizacją.)

source: On Windows machines where you have installed Python from the :ref:`Microsoft Store <windows-store>`, the |python_x_dot_y_literal| command will be available. If you have the :ref:`py.exe launcher <launcher>` installed, you can use the :file:`py` command. See :ref:`setting-envvars` for other ways to launch Python.
pl: Na maszynach Windows, gdzie instalowałeś Pythona z :ref:`Microsoft Store <windows-store>`, będzie dostępna komenda |python_x_dot_y_literal|. Jeśli masz zainstalowany :ref:`launcher py.exe <launcher>`, możesz użyć komendy :file:`py`. Inne sposoby uruchomienia Pythona znajdziesz w :ref:`setting-envvars`.

source: Typing an end-of-file character (:kbd:`Control-D` on Unix, :kbd:`Control-Z` on Windows) at the primary prompt causes the interpreter to exit with a zero exit status. If that doesn't work, you can exit the interpreter by typing the following command: ``quit()``.
pl: Wpisanie znaku końca pliku (:kbd:`Control-D` w Uniksie, :kbd:`Control-Z` w Windowsie) w główną konsolę powoduje zakończenie interpretera z kodem wyjścia zero. Jeśli to nie zadziała, możesz opuścić interpreter wpisując następującą komendę: ``quit()``.

source: The interpreter's line-editing features include interactive editing, history substitution and code completion on systems that support the `GNU Readline <https://tiswww.case.edu/php/chet/readline/rltop.html>`_ library. Perhaps the quickest check to see whether command line editing is supported is typing :kbd:`Control-P` to the first Python prompt you get. If it beeps, you have command line editing; see Appendix :ref:`tut-interacting` for an introduction to the keys. If nothing appears to happen, or if ``^P`` is echoed, command line editing isn't available; you'll only be able to use backspace to remove characters from the current line.
pl: Funkcje edycji linii interpretera obejmują interaktywną edycję, zastępowanie historii i uzupełnianie kodu w systemach wspierających bibliotekę `GNU Readline <https://tiswww.case.edu/php/chet/readline/rltop.html>`_. Prawdopodobnie najszybszym sposobem sprawdzenia, czy posiadasz rozszerzone właściwości linii poleceń, jest naciśnięcie :kbd:`Control-P` za pierwszym znakiem zachęty Pythona, który zobaczysz po jego uruchomieniu. Jeżeli zabrzęczy, masz edycję linii poleceń; zobacz wprowadzenie do klawiszy w dodatku :ref:`tut-interacting`. Jeśli nic się nie zdarzy lub pojawi się ``^P``, to edycja linii poleceń nie jest dostępna; będziesz mógł tylko używać klawisza backspace, aby usuwać znaki z bieżącego wiersza.

source: The interpreter operates somewhat like the Unix shell: when called with standard input connected to a tty device, it reads and executes commands interactively; when called with a file name argument or with a file as standard input, it reads and executes a *script* from that file.
pl: Interpreter działa podobnie do uniksowej powłoki: kiedy jest wywołany ze standardowym wejściem połączonym z urządzeniem tty, czyta i wykonuje komendy interaktywnie. Gdy zostanie wywołany z argumentem w postaci nazwy pliku lub z plikiem jako standardowym wejściem, czyta i wykonuje *skrypt* z tego pliku.

source: A second way of starting the interpreter is ``python -c command [arg] ...``, which executes the statement(s) in *command*, analogous to the shell's :option:`-c` option. Since Python statements often contain spaces or other characters that are special to the shell, it is usually advised to quote *command* in its entirety.
pl: Drugim sposobem na uruchomienie interpretera jest ``python -c komenda [arg] …``, co wykonuje polecenie (polecenia) zawarte w *komendzie*, analogicznie do opcji :option:`-c` powłoki. Jako że polecenia Pythona często zawierają spacje lub inne znaki, które są interpretowane przez powłokę, zazwyczaj najlepiej jest umieścić *komendę* w całości w cudzysłowie.

source: Some Python modules are also useful as scripts. These can be invoked using ``python -m module [arg] ...``, which executes the source file for *module* as if you had spelled out its full name on the command line.
pl: Niektóre moduły Pythona są też przydatne jako skrypty. Mogą być one wywołane przy użyciu ``python -m moduł [arg] …``, co wykonuje plik źródłowy dla *modułu* tak jakbyś wpisał jego pełną nazwę w linii komend.

source: When a script file is used, it is sometimes useful to be able to run the script and enter interactive mode afterwards. This can be done by passing :option:`-i` before the script.
pl: Kiedy używa się pliku skryptu, czasami przydatne jest móc uruchomić skrypt i następnie wejść w interaktywny. Można to zrobić przekazując :option:`-i` przed skryptem.

source: All command line options are described in :ref:`using-on-general`.
pl: Wszystkie opcje linii komend są opisane w :ref:`using-on-general`.

source: Argument Passing
pl: Przekazywanie argumentów

source: When known to the interpreter, the script name and additional arguments thereafter are turned into a list of strings and assigned to the ``argv`` variable in the ``sys`` module. You can access this list by executing ``import sys``. The length of the list is at least one; when no script and no arguments are given, ``sys.argv[0]`` is an empty string. When the script name is given as ``'-'`` (meaning standard input), ``sys.argv[0]`` is set to ``'-'``. When :option:`-c` *command* is used, ``sys.argv[0]`` is set to ``'-c'``. When :option:`-m` *module* is used, ``sys.argv[0]`` is set to the full name of the located module. Options found after :option:`-c` *command* or :option:`-m` *module* are not consumed by the Python interpreter's option processing but left in ``sys.argv`` for the command or module to handle.
pl: Nazwa skryptu i dodatkowe argumenty, gdy są znane interpreterowi, są zamieniane w listę ciągów znaków i przypisywane zmiennej ``argv`` w module ``sys``. Możesz dostać się do tej listy wykonując ``import sys``. Długość listy jest przynajmniej równa jeden; gdy nie podano nazwy skryptu i żadnych argumentów wywołania, ``sys.argv[0]``, jest pustym ciągiem. Gdy nazwa skryptu przekazana jest w postaci ``'-'`` (co oznacza standardowe wejście), ``sys.argv[0]`` przyjmuje wartość ``'-'``. Gdy zostanie użyte :option:`-c` *komenda*, ``sys.argv[0]``, przyjmuje wartość ``'-c'``. Gdy zostanie użyte :option:`-m` *moduł*, ``sys.argv[0]`` przyjmie wartość pełnej nazwy znalezionego modułu. Opcje znalezione za :option:`-c` *komenda* lub :option:`-m` *moduł* nie są konsumowane przez przetwarzanie opcji interpretera Pythona, lecz pozostawiane w ``sys.argv`` do obsłużenia przez komendę lub moduł.

source: Interactive Mode
pl: Tryb interaktywny

source: When commands are read from a tty, the interpreter is said to be in *interactive mode*. In this mode it prompts for the next command with the *primary prompt*, usually three greater-than signs (``>>>``); for continuation lines it prompts with the *secondary prompt*, by default three dots (``...``). The interpreter prints a welcome message stating its version number and a copyright notice before printing the first prompt:
pl: Jeżeli instrukcje są wczytywane z urządzenia tty, mówi się wtedy, że interpreter jest w *trybie interaktywnym*. Interpreter zachęca wtedy do podania kolejnej instrukcji wyświetlając tzw. znak zachęty, zwykle w postaci trzech znaków większości (``>>>``). Gdy wymaga kontynuacji instrukcji, w następnej linii wyświetla *drugi znak zachęty*, domyślnie trzy kropki (``...``). Interpreter wyświetla wiadomość powitania zawierającą jego wersję i notatkę o prawach autorskich przed wyświetleniem pierwszego znaku zachęty:

source: Continuation lines are needed when entering a multi-line construct. As an example, take a look at this :keyword:`if` statement::
pl: Linie kontynuacji są potrzebne przy wejściu w wielowierszową konstrukcję. Jako przykład, spójrzmy na to wyrażenie :keyword:`if`::

source: >>> the_world_is_flat = True >>> if the_world_is_flat: ... print("Be careful not to fall off!") ... Be careful not to fall off!
pl: >>> the_world_is_flat = True >>> if the_world_is_flat: ... print("Uważaj, żeby nie spaść!") ... Uważaj, żeby nie spaść!

source: For more on interactive mode, see :ref:`tut-interac`.
pl: Więcej na temat trybu interaktywnego znajdziesz w :ref:`tut-interac`.

source: The Interpreter and Its Environment
pl: Interpreter i jego środowisko

source: Source Code Encoding
pl: Strona kodowa kodu źródłowego

source: By default, Python source files are treated as encoded in UTF-8. In that encoding, characters of most languages in the world can be used simultaneously in string literals, identifiers and comments --- although the standard library only uses ASCII characters for identifiers, a convention that any portable code should follow. To display all these characters properly, your editor must recognize that the file is UTF-8, and it must use a font that supports all the characters in the file.
pl: Domyślnie pliki źródłowe Pythona są traktowane jako zakodowane w UTF-8. W tym kodowaniu znaki większości języków na świecie mogą być użyte jednocześnie w literałach ciągów znaków, identyfikatorach i komentarzach – jednak biblioteka standardowa używa jedynie znaków ASCII dla identyfikatorów, tej konwencji powinien przestrzegać każdy przenośny kod. Aby wyświetlić odpowiednio wszystkie te znaki, twój edytor musi rozpoznawać, że plik jest UTF-8 i musi używać fontu, który wspiera wszystkie znaki w tym pliku.

source: To declare an encoding other than the default one, a special comment line should be added as the *first* line of the file. The syntax is as follows::
pl: Aby zadeklarować kodowanie inne niż domyślne, powinno się dodać specjalną linię komentarza jako *pierwszą* linię pliku. Składnia jest następująca::

source: where *encoding* is one of the valid :mod:`codecs` supported by Python.
pl: gdzie *encoding* jest jednym z poprawnych :mod:`codecs` wspieranych przez Pythona.

source: For example, to declare that Windows-1252 encoding is to be used, the first line of your source code file should be::
pl: Na przykład aby zadeklarować używanie kodowania Windows-1252, pierwszą linią twojego kodu źródłowego powinno być::

source: One exception to the *first line* rule is when the source code starts with a :ref:`UNIX "shebang" line <tut-scripts>`. In this case, the encoding declaration should be added as the second line of the file. For example::
pl: Jedynym wyjątkiem dla reguły *pierwszej linii* jest, kiedy kod źródłowy zaczyna się :ref:`uniksową linią „shebang” <tut-scripts>`. W tym przypadku deklaracja kodowania powinna być dodana jako druga linia pliku. Na przykład::

source: Footnotes
pl: Przypisy

source: On Unix, the Python 3.x interpreter is by default not installed with the executable named ``python``, so that it does not conflict with a simultaneously installed Python 2.x executable.
pl: Na Uniksie, interpreter Pythona 3.x nie jest domyślnie zainstalowany z plikiem wykonywalnym o nazwie ``python``, aby nie konfliktował on z jednocześnie zainstalowanym plikiem wykonywalnym Pythona 2.x.
