Repository: python/python-docs-pl
Catalog: tutorial/introduction.po
Languages: pl

source: >>> cubes.append(216) # add the cube of 6 >>> cubes.append(7 ** 3) # and the cube of 7 >>> cubes [1, 8, 27, 64, 125, 216, 343]
pl: >>> cubes.append(216) # dodaj sześcian 6 >>> cubes.append(7 ** 3) # i sześcian 7 >>> cubes [1, 8, 27, 64, 125, 216, 343]

source: Simple assignment in Python never copies data. When you assign a list to a variable, the variable refers to the *existing list*. Any changes you make to the list through one variable will be seen through all other variables that refer to it.::
pl: Proste przypisanie w Pythonie nigdy nie kopiuje danych. Kiedy przypisujesz listę do zmiennej, zmienna odnosi się do *istniejącej listy*. Wszystkie zmiany dokonane na liście przez jedną zmienną będą widoczne przez wszystkie inne zmienne, które się do niej odwołują.::

source: >>> rgb = ["Red", "Green", "Blue"] >>> rgba = rgb >>> id(rgb) == id(rgba) # they reference the same object True >>> rgba.append("Alph") >>> rgb ["Red", "Green", "Blue", "Alph"]
pl: >>> rgb = ["czerwony", "zielony", "niebieski"] >>> rgba = rgb >>> id(rgb) == id(rgba) # odwołują się do tego samego obiektu True >>> rgba.append("alfa") >>> rgb ["czerwony", "zielony", "niebieski", "alfa"]

source: All slice operations return a new list containing the requested elements. This means that the following slice returns a :ref:`shallow copy <shallow_vs_deep_copy>` of the list::
pl: Wszystkie operacje wykrawania zwracają nową listę zawierającą żądane elementy. Następujący slice więc zwraca :ref:`płytką kopię <shallow_vs_deep_copy>` listy::

source: >>> correct_rgba = rgba[:] >>> correct_rgba[-1] = "Alpha" >>> correct_rgba ["Red", "Green", "Blue", "Alpha"] >>> rgba ["Red", "Green", "Blue", "Alph"]
pl: >>> correct_rgba = rgba[:] >>> correct_rgba[-1] = "alfa" >>> correct_rgba ["czerwony", "zielony", "niebieski", "alfa"] >>> rgba ["czerwony", "zielony", "niebieski", "alfa"]

source: Assignment to slices is also possible, and this can even change the size of the list or clear it entirely::
pl: Możliwe jest również przypisywanie do slice'ów. Może to zmienić rozmiar listy lub zupełnie ją wyczyścić::

source: >>> letters = ['a', 'b', 'c', 'd', 'e', 'f', 'g'] >>> letters ['a', 'b', 'c', 'd', 'e', 'f', 'g'] >>> # replace some values >>> letters[2:5] = ['C', 'D', 'E'] >>> letters ['a', 'b', 'C', 'D', 'E', 'f', 'g'] >>> # now remove them >>> letters[2:5] = [] >>> letters ['a', 'b', 'f', 'g'] >>> # clear the list by replacing all the elements with an empty list >>> letters[:] = [] >>> letters []
pl: >>> letters = ['a', 'b', 'c', 'd', 'e', 'f', 'g'] >>> litery ['a', 'b', 'c', 'd', 'e', 'f', 'g'] >>> # zastąp niektóre wartości >>> letters[2:5] = ['C', 'D', 'E'] >>> litery ['a', 'b', 'C', 'D', 'E', 'f', 'g'] >>> # teraz je usuń >>> letters[2:5] = [] >>> letters ['a', 'b', 'f', 'g'] >>> # wyczyść listę zastępując wszystkie elementy pustą listą >>> letters[:] = [] >>> letters[:] []

source: The built-in function :func:`len` also applies to lists::
pl: Wbudowana funkcja :func:`len` ma również zastosowanie do list::

source: It is possible to nest lists (create lists containing other lists), for example::
pl: Można zagnieżdżać listy (tworzyć listy zawierające inne listy), na przykład::

source: First Steps Towards Programming
pl: Pierwsze kroki do programowania

source: Of course, we can use Python for more complicated tasks than adding two and two together. For instance, we can write an initial sub-sequence of the `Fibonacci series <https://en.wikipedia.org/wiki/Fibonacci_sequence>`_ as follows::
pl: Oczywiście możemy używać Pythona do zadań bardziej skomplikowanych niż dodawanie dwóch do dwóch. Na przykład możemy napisać początkowy podciąg `ciągu Fibonacciego <https://pl.wikipedia.org/wiki/Ci%C4%85g_Fibonacciego>`_ następująco::

source: >>> # Fibonacci series: >>> # the sum of two elements defines the next >>> a, b = 0, 1 >>> while a < 10: ... print(a) ... a, b = b, a+b ... 0 1 1 2 3 5 8
pl: >>> # ciąg Fibonacciego: >>> # suma dwóch elementów określa następny >>> a, b = 0, 1 >>> while a < 10: ... print(a) ... a, b = b, a+b ... 0 1 1 2 3 5 8

source: This example introduces several new features.
pl: Ten przykład wprowadza kilka nowych funkcji.

source: The first line contains a *multiple assignment*: the variables ``a`` and ``b`` simultaneously get the new values 0 and 1. On the last line this is used again, demonstrating that the expressions on the right-hand side are all evaluated first before any of the assignments take place. The right-hand side expressions are evaluated from the left to the right.
pl: Pierwsza linia zawiera *wielokrotne przypisanie*: zmienne ``a`` i ``b`` jednocześnie dostają nowe wartości 0 i 1. W ostatniej linii jest ponownie wykorzystane, demonstrując, że wyrażenia po prawej stronie są ewaluowane wcześniej, zanim którekolwiek z przypisań ma miejsce. Wyrażenia po prawej stronie są ewaluowane od lewej do prawej.

source: The :keyword:`while` loop executes as long as the condition (here: ``a < 10``) remains true. In Python, like in C, any non-zero integer value is true; zero is false. The condition may also be a string or list value, in fact any sequence; anything with a non-zero length is true, empty sequences are false. The test used in the example is a simple comparison. The standard comparison operators are written the same as in C: ``<`` (less than), ``>`` (greater than), ``==`` (equal to), ``<=`` (less than or equal to), ``>=`` (greater than or equal to) and ``!=`` (not equal to).
pl: Pętla :keyword:`while` wykonuje się dopóki warunek (tutaj: ``a < 10``) pozostaje prawdziwy. W Pythonie, tak jak w C, każda niezerowa liczba całkowita jest prawdziwa; zero jest fałszywe. Warunek może być również ciągiem znaków lub listą, tak naprawdę jakąkolwiek sekwencją; cokolwiek o niezerowej długości jest prawdziwe, puste sekwencje są fałszywe. Warunek użyty w przykładzie jest prostym porównaniem. Standardowe operatory porównań pisane są tak samo jak w C: ``<`` (mniejsze niż), ``>`` (większe niż), ``==`` (równe), ``<=`` (mniejsze lub równe), ``>=`` (większe lub równe) i ``!=`` (różne).

source: The *body* of the loop is *indented*: indentation is Python's way of grouping statements. At the interactive prompt, you have to type a tab or space(s) for each indented line. In practice you will prepare more complicated input for Python with a text editor; all decent text editors have an auto-indent facility. When a compound statement is entered interactively, it must be followed by a blank line to indicate completion (since the parser cannot guess when you have typed the last line). Note that each line within a basic block must be indented by the same amount.
pl: *Ciało* pętli jest *wcięte*: indentacja (wcięcia) jest sposobem na grupowanie instrukcji. W trybie interaktywnym trzeba wprowadzić znak(i) spacji lub tabulacji, aby wciąć wiersz. W praktyce będziesz przygotowywać bardziej skomplikowane dane wejściowe dla Pythona za pomocą edytora tekstu; wszystkie przyzwoite edytory tekstu mają funkcję automatycznych wcięć. W chwili, gdy wprowadza się jakąś instrukcję złożoną w czasie sesji interpretera Pythona, trzeba zakończyć ją pustym wierszem (bowiem interpreter nie wie, czy ostatni wprowadzony wiersz jest ostatnim z tej instrukcji). Ważne jest, aby każdy wiersz należący do tej samej grupy instrukcji, był wcięty o taką samą liczbę spacji lub znaków tabulacji.

source: The :func:`print` function writes the value of the argument(s) it is given. It differs from just writing the expression you want to write (as we did earlier in the calculator examples) in the way it handles multiple arguments, floating-point quantities, and strings. Strings are printed without quotes, and a space is inserted between items, so you can format things nicely, like this::
pl: Funkcja :func:`print` wypisuje wartość argumentu(-ów), które jej podano. Różnica pomiędzy tą instrukcją, a zwykłym zapisem wyrażenia, które chce się wypisać (tak jak robiliśmy to w przykładzie z kalkulatorem) występuje w sposobie obsługi wielu wyrażeń i napisów. Łańcuchy znaków wypisywane są bez cudzysłowów, a pomiędzy nimi zapisywane są spacje, tak aby można było ładnie sformatować pojawiający się napis, na przykład::

source: >>> i = 256*256 >>> print('The value of i is', i) The value of i is 65536
pl: >>> i = 256*256 >>> print('Wartość i wynosi', i) Wartość i wynosi 65536

source: The keyword argument *end* can be used to avoid the newline after the output, or end the output with a different string::
pl: Keyword argument *end* można wykorzystać, aby uniknąć znaku nowej linii po wypisaniu lub aby zakończyć wypisanie innym ciągiem znaków::

source: Footnotes
pl: Przypisy

source: Since ``**`` has higher precedence than ``-``, ``-3**2`` will be interpreted as ``-(3**2)`` and thus result in ``-9``. To avoid this and get ``9``, you can use ``(-3)**2``.
pl: Jako że ``**`` ma wyższą precedencję niż ``-``, ``-3**2`` zostanie zinterpretowane jako ``-(3**2)`` i zwróci ``-9``. Aby tego uniknąć i otrzymać ``9``, możesz użyć ``(-3)**2``.

source: Unlike other languages, special characters such as ``\n`` have the same meaning with both single (``'...'``) and double (``"..."``) quotes. The only difference between the two is that within single quotes you don't need to escape ``"`` (but you have to escape ``\'``) and vice versa.
pl: W przeciwieństwie do innych języków, znaki specjalne takie jak ``\n`` mają to samo znaczenie zarówno z pojedynczym (``'…'``) jak i podwójnym (``"…"``) cudzysłowem. Jedyną różnicą między nimi jest to, że wewnątrz pojedynczego cudzysłowu nie musisz używać znaku ucieczki dla ``"`` (lecz musisz użyć znaku ucieczki ``\'``) i vice versa.

source: comment
pl: komentarz
