Repository: python/python-docs-pl
Catalog: tutorial/introduction.po
Languages: pl

source: An Informal Introduction to Python
pl: Nieformalne wprowadzenie do Pythona

source: In the following examples, input and output are distinguished by the presence or absence of prompts (:term:`>>>` and :term:`...`): to repeat the example, you must type everything after the prompt, when the prompt appears; lines that do not begin with a prompt are output from the interpreter. Note that a secondary prompt on a line by itself in an example means you must type a blank line; this is used to end a multi-line command.
pl: W nadchodzących przykładach wejście i wyjście są rozróżniane przez obecność lub nieobecność promptów (:term:`>>>` i :term:`...`): aby powtórzyć przykład, musisz wpisać wszystko po prompcie, kiedy prompt jest widoczny; linie, które nie zaczynają się promptem są wyjściem z interpretera. Zwróć uwagę, że prompt drugiego rzędu z pustą linią w przykładzie oznacza, że musisz wpisać pustą linię; używa się tego do zakończenia wielo-liniowej komendy.

source: You can toggle the display of prompts and output by clicking on ``>>>`` in the upper-right corner of an example box. If you hide the prompts and output for an example, then you can easily copy and paste the input lines into your interpreter.
pl: Możesz przełączać wyświetlanie promptów i wyjścia klikając na ``>>>`` w prawym górnym rogu pola z przykładem. Jeśli schowasz prompty i wyjście dla przykładu, wtedy możesz prosto skopiować i wkleić linie wejścia w swój interpreter.

source: Many of the examples in this manual, even those entered at the interactive prompt, include comments. Comments in Python start with the hash character, ``#``, and extend to the end of the physical line. A comment may appear at the start of a line or following whitespace or code, but not within a string literal. A hash character within a string literal is just a hash character. Since comments are to clarify code and are not interpreted by Python, they may be omitted when typing in examples.
pl: Wiele przykładów w tej instrukcji, także tych wpisywanych w konsoli interaktywnej, zawiera komentarze. Komentarze w Pythonie zaczynają się znakiem hash ``#`` i ciągną się do końca fizycznej linii. Komentarz może pojawić się na początku linii, po wiodących spacjach lub kodzie, lecz nie może być zawarty w literale ciągu znaków. Znak hash w ciągu znaków jest po prostu znakiem hash. Jako że komentarze mają wyjaśniać kod i nie są interpretowane przez Pythona, można je ominąć przy wpisywaniu przykładów.

source: Some examples::
pl: Trochę przykładów::

source: # this is the first comment spam = 1 # and this is the second comment # ... and now a third! text = "# This is not a comment because it's inside quotes."
pl: # to jest pierwszy komentarz spam = 1 # a to jest drugi komentarz # … i teraz trzeci! text = "# To nie jest komentarz, bo jest w cudzysłowie."

source: Using Python as a Calculator
pl: Używanie Pythona jako kalkulatora

source: Let's try some simple Python commands. Start the interpreter and wait for the primary prompt, ``>>>``. (It shouldn't take long.)
pl: Wypróbujmy parę prostych poleceń Pythona. Uruchom interpreter i poczekaj na pojawienie się pierwszego znaku zachęty ``>>>``. (Nie powinno to zająć dużo czasu.)

source: Numbers
pl: Liczby

source: The interpreter acts as a simple calculator: you can type an expression at it and it will write the value. Expression syntax is straightforward: the operators ``+``, ``-``, ``*`` and ``/`` can be used to perform arithmetic; parentheses (``()``) can be used for grouping. For example::
pl: Interpreter działa jak prosty kalkulator: można wpisać do niego wyrażenie, a on wypisze jego wartość. Składnia wyrażenia jest prosta: operatory ``+``, ``-``, ``*`` i ``/`` można użyć do arytmetyki; nawiasy (``()``) można użyć do grupowania. Na przykład::

source: >>> 2 + 2 4 >>> 50 - 5*6 20 >>> (50 - 5*6) / 4 5.0 >>> 8 / 5 # division always returns a floating-point number 1.6
pl: >>> 2 + 2 4 >>> 50 - 5*6 20 >>> (50 - 5*6) / 4 5.0 >>> 8 / 5 # dzielenie zawsze zwraca liczbę zmiennoprzecinkową 1.6

source: The integer numbers (e.g. ``2``, ``4``, ``20``) have type :class:`int`, the ones with a fractional part (e.g. ``5.0``, ``1.6``) have type :class:`float`. We will see more about numeric types later in the tutorial.
pl: Liczby całkowite (np. ``2``, ``4``, ``20``) są typu :class:`int`, te z częścią ułamkową (np. ``5.0``, ``1.6``) są typu :class:`float`. Więcej o typach numerycznych dowiemy się więcej później w tym tutorialu.

source: Division (``/``) always returns a float. To do :term:`floor division` and get an integer result you can use the ``//`` operator; to calculate the remainder you can use ``%``::
pl: Dzielenie (``/``) zawsze zwraca liczbę zmiennoprzecinkową. Aby zrobić :term:`dzielenie całkowite <floor division>` i uzyskać wynik całkowity możesz użyć operatora ``//``; aby obliczyć resztę możesz użyć ``%``::

source: >>> 17 / 3 # classic division returns a float 5.666666666666667 >>> >>> 17 // 3 # floor division discards the fractional part 5 >>> 17 % 3 # the % operator returns the remainder of the division 2 >>> 5 * 3 + 2 # floored quotient * divisor + remainder 17
pl: >>> 17 / 3 # klasyczne dzielenie zwraca liczbę zmiennoprzecinkową 5.666666666666667 >>> >>> 17 // 3 # dzielenie całkowite pomija część ułamkową 5 >>> 17 % 3 # operator % zwraca resztę z dzielenia 2 >>> 5 * 3 + 2 # iloraz całkowity * dzielnik + reszta 17

source: With Python, it is possible to use the ``**`` operator to calculate powers [#]_::
pl: W Pythonie możesz użyć operatora ``**``, do obliczania potęgowania [#]_::

source: >>> 5 ** 2 # 5 squared 25 >>> 2 ** 7 # 2 to the power of 7 128
pl: >>> 5 ** 2 # 5 do kwadratu 25 >>> 2 ** 7 # 2 do potęgi 7. 128

source: The equal sign (``=``) is used to assign a value to a variable. Afterwards, no result is displayed before the next interactive prompt::
pl: Znak równości (``=``) jest używany do przypisania wartości do zmiennej. Przypisanie do zmiennej nie jest wypisywane przez interpreter::

source: If a variable is not "defined" (assigned a value), trying to use it will give you an error::
pl: Jeśli zmienna nie jest „zdefiniowana” (nie ma przypisanej wartości), próba jej użycia spowoduje błąd::

source: >>> n # try to access an undefined variable Traceback (most recent call last): File "<stdin>", line 1, in <module> NameError: name 'n' is not defined
pl: >>> n # próba dostępu do niezdefiniowanej zmiennej Traceback (most recent call last): File "<stdin>", line 1, in <module> NameError: name 'n' is not defined

source: There is full support for floating point; operators with mixed type operands convert the integer operand to floating point::
pl: Python implementuje w pełni arytmetykę zmiennoprzecinkową; operatory z operandami typów mieszanych przekształcają operandy całkowite w zmiennoprzecinkowe::

source: In interactive mode, the last printed expression is assigned to the variable ``_``. This means that when you are using Python as a desk calculator, it is somewhat easier to continue calculations, for example::
pl: W trybie interaktywnym ostatnie wyświetlone wyrażenie jest przypisywane do zmiennej ``_``. Dzięki temu kiedy używasz Pythona jako biurkowego kalkulatora, jest nieco prościej kontynuować obliczenia, na przykład::

source: This variable should be treated as read-only by the user. Don't explicitly assign a value to it --- you would create an independent local variable with the same name masking the built-in variable with its magic behavior.
pl: Ta zmienna powinna być traktowana przez użytkownika jako tylko-do-odczytu. Nie przypisuj wprost do niej wartości --- stworzyłbyś niezależną zmienną lokalną o tej samej nazwie maskując wbudowaną zmienną z jej magicznym zachowaniem.

source: In addition to :class:`int` and :class:`float`, Python supports other types of numbers, such as :class:`~decimal.Decimal` and :class:`~fractions.Fraction`. Python also has built-in support for :ref:`complex numbers <typesnumeric>`, and uses the ``j`` or ``J`` suffix to indicate the imaginary part (e.g. ``3+5j``).
pl: Oprócz :class:`int` i :class:`float`, Python wspiera inne typy liczb, takie jak :class:`~decimal.Decimal` i :class:`~fractions.Fraction`. Python ma też wbudowane wsparcie dla :ref:`liczb złożonych <typesnumeric>` i używa sufiksów ``j`` lub ``J`` do wskazania części urojonej (np. ``3+5j``).

source: Text
pl: Tekst

source: Python can manipulate text (represented by type :class:`str`, so-called "strings") as well as numbers. This includes characters "``!``", words "``rabbit``", names "``Paris``", sentences "``Got your back.``", etc. "``Yay! :)``". They can be enclosed in single quotes (``'...'``) or double quotes (``"..."``) with the same result [#]_.
pl: Python umożliwia manipulację tekstem (reprezentowanym przez typ :class:`str`, tzw. "string" lub "łańcuchem znaków") oraz liczbami. Obejmuje to znaki "``!``", słowa "``rabbit``", nazwy "``Paris``", zdania "``Got your back.``", itp. "``Yay! :)``". Mogą być one umieszczone w pojedynczych cudzysłowach (``'...'``) lub podwójnych cudzysłowach (``"..."``) z takim samym wynikiem [#]_.

source: To quote a quote, we need to "escape" it, by preceding it with ``\``. Alternatively, we can use the other type of quotation marks::
pl: Aby umieścić znak cudzysłowu, musimy go oznaczyć znakiem "ucieczki", poprzedzając znakiem ``\``. Alternatywnie, możemy użyć innego rodzaju znaków do oznaczenia cudzysłowu::

source: >>> 'doesn\'t' # use \' to escape the single quote... "doesn't" >>> "doesn't" # ...or use double quotes instead "doesn't" >>> '"Yes," they said.' '"Yes," they said.' >>> "\"Yes,\" they said." '"Yes," they said.' >>> '"Isn\'t," they said.' '"Isn\'t," they said.'
pl: >>> 'Oni powiedzieli \'tak\'.' # użyj \' jako znaku ucieczki da pojedynczego cudzysłowu… "Oni powiedzieli 'tak'." >>> "Oni powiedzieli 'tak'." # …lub użyj podwójnego cudzysłowu "Oni powiedzieli 'tak'." >>> 'Oni powiedzieli "tak".' 'Oni powiedzieli "tak".' >>> "Oni powiedzieli \"tak\"." 'Oni powiedzieli "tak".' >>> 'Oni powiedzieli "tamci powiedzieli \'tak\'".' 'Oni powiedzieli "tamci powiedzieli \'tak\'".'

source: In the Python shell, the string definition and output string can look different. The :func:`print` function produces a more readable output, by omitting the enclosing quotes and by printing escaped and special characters::
pl: W interaktywnej powłoce Pythona definicja stringa i wyjściowy string może wyglądać inaczej. Funkcja :func:`print` wytwarza czytelne wyjście, poprzez pominięcie otaczających cudzysłowów i wypisując znaki ucieczki oraz specjalne znaki::

source: >>> s = 'First line.\nSecond line.' # \n means newline >>> s # without print(), special characters are included in the string 'First line.\nSecond line.' >>> print(s) # with print(), special characters are interpreted, so \n produces new line First line. Second line.
pl: >>> s = 'Pierwsza linia.\nDruga linia.' # \n oznacza nową linię >>> s # bez print(), znaki specjalne są zawarte w ciągu znaków 'Pierwsza linia.\nDruga linia.' >>> print(s) # z print(), znaki specjalne są interpretowane, więc \n tworzy nową linię Pierwsza linia. Druga linia.

source: If you don't want characters prefaced by ``\`` to be interpreted as special characters, you can use *raw strings* by adding an ``r`` before the first quote::
pl: Jeśli nie chcesz, aby znaki poprzedzone ``\`` były interpretowane jako znaki specjalne, możesz użyć *surowych ciągów znaków* dodając ``r`` przed pierwszym cudzysłowem::

source: >>> print('C:\some\name') # here \n means newline! C:\some ame >>> print(r'C:\some\name') # note the r before the quote C:\some\name
pl: >>> print('C:\jakas\nazwa') # tutaj \n oznacza nową linię! C:\jakas azwa >>> print(r'C:\jakas\nazwa') # zwróć uwagę na r przed cudzysłowem C:\jakas\nazwa

source: There is one subtle aspect to raw strings: a raw string may not end in an odd number of ``\`` characters; see :ref:`the FAQ entry <faq-programming-raw-string-backslash>` for more information and workarounds.
pl: Istnieje jeden subtelny aspekt surowych ciągów znaków: surowy ciąg znaków nie może kończyć się nieparzystą liczbą znaków ``\``; zobacz :ref:`wpis FAQ <faq-programming-raw-string-backslash>`, aby uzyskać więcej informacji i sposobów obejścia tego problemu.

source: String literals can span multiple lines. One way is using triple-quotes: ``"""..."""`` or ``'''...'''``. End of lines are automatically included in the string, but it's possible to prevent this by adding a ``\`` at the end of the line. The following example::
pl: Literały ciągów znaków mogą mieć wiele linii. Można je uzyskać używając potrójnych cudzysłowów: ``"""…"""`` lub ``'''…'''``. Końce linii są automatycznie zawarte w ciągu znaków, ale można tego uniknąć dodając ``\`` na końcu linii. Następujący przykład::

source: print("""\ Usage: thingy [OPTIONS] -h Display this usage message -H hostname Hostname to connect to """)
pl: print("""\ Użycie: thingy [OPCJE] -h Wyświetla ten komunikat użycia -H hostname Nazwa hosta do połączenia """)

source: produces the following output (note that the initial newline is not included):
pl: produkuje następujące wyjście (zwróć uwagę, że nie ma pierwszej nowej linii):

source: Usage: thingy [OPTIONS] -h Display this usage message -H hostname Hostname to connect to
pl: Użycie: thingy [OPCJE] -h Wyświetla ten komunikat użycia -H hostname Nazwa hosta do połączenia

source: Strings can be concatenated (glued together) with the ``+`` operator, and repeated with ``*``::
pl: Ciągi mogą być łączone operatorem ``+`` i powtarzane przy użyciu ``*``::

source: >>> # 3 times 'un', followed by 'ium' >>> 3 * 'un' + 'ium' 'unununium'
pl: >>> # 3 razy 'un', a następnie 'ium' >>> 3 * 'un' + 'ium' 'unununium'

source: Two or more *string literals* (i.e. the ones enclosed between quotes) next to each other are automatically concatenated. ::
pl: Dwa lub więcej *literałów ciągów* (czyli te zawarte w cudzysłowach) obok siebie są automatycznie łączone. ::

source: This feature is particularly useful when you want to break long strings::
pl: To zachowanie jest szczególnie przydatne, gdy chcesz dzielić długie ciągi::

source: >>> text = ('Put several strings within parentheses ' ... 'to have them joined together.') >>> text 'Put several strings within parentheses to have them joined together.'
pl: >>> text = ('Umieść kilka ciągów znaków w nawiasach ' ... 'aby je połączyć.') >>> text 'Umieść kilka ciągów znaków w nawiasach aby je połączyć'.

source: This only works with two literals though, not with variables or expressions::
pl: Jednak działa tylko dla literałów, nie dla zmiennych lub wyrażeń::

source: >>> prefix = 'Py' >>> prefix 'thon' # can't concatenate a variable and a string literal File "<stdin>", line 1 prefix 'thon' ^^^^^^ SyntaxError: invalid syntax >>> ('un' * 3) 'ium' File "<stdin>", line 1 ('un' * 3) 'ium' ^^^^^ SyntaxError: invalid syntax
pl: >>> prefix = 'Py' >>> prefiks 'thon' # nie można łączyć zmiennej i literału ciagu znaków File "<stdin>", line 1 prefix 'thon' ^^^^^^ SyntaxError: invalid syntax >>> ('un' * 3) 'ium' File "<stdin>", line 1 ('un' * 3) 'ium' ^^^^^ SyntaxError: invalid syntax

source: If you want to concatenate variables or a variable and a literal, use ``+``::
pl: Jeśli chcesz połączyć zmienne lub zmienną i literał, użyj ``+``::

source: Strings can be *indexed* (subscripted), with the first character having index 0. There is no separate character type; a character is simply a string of size one::
pl: Ciągi znaków mogą być *indeksowane*. Pierwszy znak ma indeks 0. Nie ma osobnego typu znakowego; znak jest po prostu ciągiem znaków o długości jeden::

source: >>> word = 'Python' >>> word[0] # character in position 0 'P' >>> word[5] # character in position 5 'n'
pl: >>> word = 'Python' >>> word[0] # znak na pozycji 0 'P' >>> word[5] # znak na pozycji 5 'n'

source: Indices may also be negative numbers, to start counting from the right::
pl: Indeksy mogą być też liczbami ujemnymi, aby zacząć odliczać od prawej::

source: >>> word[-1] # last character 'n' >>> word[-2] # second-last character 'o' >>> word[-6] 'P'
pl: >>> word[-1] # ostatni znak 'n' >>> word[-2] # przedostatni znak 'o' >>> word[-6] 'P'

source: Note that since -0 is the same as 0, negative indices start from -1.
pl: Zwróć uwagę, że jako -0 to to samo co 0, ujemne indeksy zaczynają się od -1.

source: In addition to indexing, *slicing* is also supported. While indexing is used to obtain individual characters, *slicing* allows you to obtain a substring::
pl: Dodatkowo do indeksowania, obsługiwany jest również *podział*. Podczas gdy indeksowanie służy do uzyskiwania pojedynczych znaków, *podział* pozwala na uzyskanie podciągu znaków::

source: >>> word[0:2] # characters from position 0 (included) to 2 (excluded) 'Py' >>> word[2:5] # characters from position 2 (included) to 5 (excluded) 'tho'
pl: >>> word[0:2] # znaki od pozycji 0 (włącznie) do 2 (wyłącznie) 'Py' >>> word[2:5] # znaki od pozycji 2 (włącznie) do 5 (wyłącznie) 'tho'

source: Slice indices have useful defaults; an omitted first index defaults to zero, an omitted second index defaults to the size of the string being sliced. ::
pl: Indeksy podzielonych fragmentów mają przydatne wartości domyślne; pominięty pierwszy indeks domyślnie jest zerem, pominięty drugi indeks domyślnie ma wartość długości dzielonego stringa. ::

source: >>> word[:2] # character from the beginning to position 2 (excluded) 'Py' >>> word[4:] # characters from position 4 (included) to the end 'on' >>> word[-2:] # characters from the second-last (included) to the end 'on'
pl: >>> word[:2] # znak od początku do pozycji 2 (wyłącznie) 'Py' >>> word[4:] # znak od pozycji 4 (włącznie) do końca 'on' >>> word[-2:] # znak od przedostatniego (włącznie) do końca 'on'

source: Note how the start is always included, and the end always excluded. This makes sure that ``s[:i] + s[i:]`` is always equal to ``s``::
pl: Zwróć uwagę, że początkowy indeks wchodzi w skład podciągu, a końcowy nie. W ten sposób ``s[:i] + s[i:]`` jest zawsze równe ``s``::

source: One way to remember how slices work is to think of the indices as pointing *between* characters, with the left edge of the first character numbered 0. Then the right edge of the last character of a string of *n* characters has index *n*, for example::
pl: Jednym ze sposobów na zapamiętanie, jak działa podział, to myślenie o indeksach wskazujących *pomiędzy* znakami, z lewą krawędzią pierwszego znaku numerowaną 0. Wtedy prawa krawędź ostatniego znaku ciągu o długości *n* ma indeks *n*, na przykład::

source: The first row of numbers gives the position of the indices 0...6 in the string; the second row gives the corresponding negative indices. The slice from *i* to *j* consists of all characters between the edges labeled *i* and *j*, respectively.
pl: W pierwszym wierszu liczb są pozycje indeksów od 0 do 6 w ciągu. W drugim wierszu odpowiadające im indeksy ujemne. Fragment od *i* do *j* składa się ze wszystkich znaków pomiędzy krawędziami oznaczonymi kolejno *i* i *j*.

source: For non-negative indices, the length of a slice is the difference of the indices, if both are within bounds. For example, the length of ``word[1:3]`` is 2.
pl: Dla nieujemnych indeksów długość wydzielonego fragmentu to różnica indeksów, jeśli oba mieszczą się w zakresie. Na przykład długość ``word[1:3]`` to 2.

source: Attempting to use an index that is too large will result in an error::
pl: Próba użycia za dużego indeksu skończy się błędem::

source: >>> word[42] # the word only has 6 characters Traceback (most recent call last): File "<stdin>", line 1, in <module> IndexError: string index out of range
pl: >>> word[42] # word ma tylko 6 znaków Traceback (most recent call last): File "<stdin>", line 1, in <module> IndexError: string index out of range

source: However, out of range slice indexes are handled gracefully when used for slicing::
pl: Jednak indeksy podzielonych fragmentów poza zakresem są obsłużone bezpiecznie przy podziale::

source: Python strings cannot be changed --- they are :term:`immutable`. Therefore, assigning to an indexed position in the string results in an error::
pl: Ciągi znaków Pythona nie mogą być zmieniane — są :term:`niemutowalne <immutable>`. W związku z tym przypisywanie wartości do indeksowanej pozycji w ciągu spowoduje błąd::

source: If you need a different string, you should create a new one::
pl: Jeśli potrzebujesz innego ciągu znaków, powinieneś(-nnaś) stworzyć nowy::

source: The built-in function :func:`len` returns the length of a string::
pl: Wbudowana funkcja :func:`len` zwraca długość ciągu::

source: >>> s = 'supercalifragilisticexpialidocious' >>> len(s) 34
pl: >>> s = 'superkalifradalistodekspialitycznie' >>> len(s) 35

source: Strings are examples of *sequence types*, and support the common operations supported by such types.
pl: Ciągi znaków są przykładami *typów sekwencyjnych* i obsługują wspólne operacje wspierane przez takie typy.

source: Strings support a large number of methods for basic transformations and searching.
pl: Ciągi znaków wspierają dużą liczbę metod do podstawowych przekształceń i wyszukiwania.

source: String literals that have embedded expressions.
pl: Literały ciągów znaków z osadzonymi wyrażeniami.

source: Information about string formatting with :meth:`str.format`.
pl: Informacje o formatowaniu ciągów znaków przy użyciu :meth:`str.format`.

source: The old formatting operations invoked when strings are the left operand of the ``%`` operator are described in more detail here.
pl: Stare operacje formatowania, wywoływane gdy ciągi znaków są lewymi operandami operatora ``%`` są opisane tutaj bardziej szczegółowo.

source: Lists
pl: Listy

source: Python knows a number of *compound* data types, used to group together other values. The most versatile is the *list*, which can be written as a list of comma-separated values (items) between square brackets. Lists might contain items of different types, but usually the items all have the same type. ::
pl: Python ma kilka *złożonych* typów danych, używanych do grupowania różnych wartości. Najbardziej wszechstronnym jest *lista*, która może zostać zapisana jako lista wartości (elementów) rozdzielonych przecinkami ujęta w nawiasy kwadratowe. Listy mogą zawierać elementy różnych typów, ale zazwyczaj wszystkie elementy mają ten sam typ. ::

source: Like strings (and all other built-in :term:`sequence` types), lists can be indexed and sliced::
pl: Tak jak ciągi znaków (i wszystkie inne wbudowane typy :term:`sekwencyjne <sequence>`), do elementów list można odwoływać się przez indeksy oraz można z nich „wydzielać”::

source: >>> squares[0] # indexing returns the item 1 >>> squares[-1] 25 >>> squares[-3:] # slicing returns a new list [9, 16, 25]
pl: >>> squares[0] # indeksowanie zwraca element 1 >>> squares[-1] 25 >>> squares[-3:] # slicing zwraca nową listę [9, 16, 25]

source: Lists also support operations like concatenation::
pl: Listy wspierają też operacje takie jak łączenie::

source: Unlike strings, which are :term:`immutable`, lists are a :term:`mutable` type, i.e. it is possible to change their content::
pl: W przeciwieństwie do ciągów znaków, które są :term:`niemutowalne <immutable>`, listy są typem :term:`mutowalnym <mutable>`, w szczególności można zmieniać ich treść::

source: >>> cubes = [1, 8, 27, 65, 125] # something's wrong here >>> 4 ** 3 # the cube of 4 is 64, not 65! 64 >>> cubes[3] = 64 # replace the wrong value >>> cubes [1, 8, 27, 64, 125]
pl: >>> cubes = [1, 8, 27, 65, 125] # coś tu jest nie tak >>> 4 ** 3 # sześcian 4 to 64, a nie 65! 64 >>> cubes[3] = 64 # zastąp nieprawidłową wartość >>> cubes [1, 8, 27, 64, 125]

source: You can also add new items at the end of the list, by using the :meth:`!list.append` *method* (we will see more about methods later)::
pl: Można również dodawać nowe elementy na końcu listy, przez użycie *metody* (dowiemy się więcej o metodach później) :meth:`!list.append`::
