Repository: python/python-docs-pl
Catalog: tutorial/modules.po
Languages: pl

source: The :file:`__init__.py` files are required to make Python treat directories containing the file as packages. This prevents directories with a common name, such as ``string``, from unintentionally hiding valid modules that occur later on the module search path. In the simplest case, :file:`__init__.py` can just be an empty file, but it can also execute initialization code for the package or set the ``__all__`` variable, described later.
pl: Pliki :file:`__init__.py` są wymagane, aby Python traktował katalogi zawierające ten plik jako pakiety. Zapobiega to katalogom o często występującej nazwie, takiej jak ``string``, przed niezamierzonym ukrywaniem prawidłowych modułów, które pojawiają się później w ścieżce wyszukiwania modułów. W najprostszym przypadku :file:`__init__.py` może to być po prostu pustym plikiem, ale może też wykonać kod inicjujący pakiet lub ustawić zmienną ``__all__``, która będzie opisana później.

source: Users of the package can import individual modules from the package, for example::
pl: Użytkownicy pakietu mogą importować z pakietu poszczególne moduły, na przykład::

source: This loads the submodule :mod:`sound.effects.echo`. It must be referenced with its full name. ::
pl: Spowoduje to załadowanie podmodułu :mod:`sound.effects.echo`. Musi on być wywoływany używając jego pełnej nazwy. ::

source: An alternative way of importing the submodule is::
pl: Alternatywnym sposobem importowania podmodułu jest::

source: This also loads the submodule :mod:`echo`, and makes it available without its package prefix, so it can be used as follows::
pl: To również spowoduje załadowanie podmodułu :mod:`echo` lecz udostępnia go bez prefiksu pakietu, dzięki czemu można go użyć w następujący sposób::

source: Yet another variation is to import the desired function or variable directly::
pl: Jeszcze innym sposobem jest bezpośredni import żądanej funkcji lub zmiennej::

source: Again, this loads the submodule :mod:`echo`, but this makes its function :func:`echofilter` directly available::
pl: Ponownie, ładuje to podmoduł :mod:`echo`, ale dzięki temu jego funkcja :func:`echofilter` jest bezpośrednio dostępna::

source: Note that when using ``from package import item``, the item can be either a submodule (or subpackage) of the package, or some other name defined in the package, like a function, class or variable. The ``import`` statement first tests whether the item is defined in the package; if not, it assumes it is a module and attempts to load it. If it fails to find it, an :exc:`ImportError` exception is raised.
pl: Zauważ, że podczas używania ``from package import item``, element może być podmodułem (lub podpakietem) pakietu lub inną nazwą zdefiniowaną w pakiecie, jak funkcją, klasą lub zmienną. Instrukcja ``import`` najpierw sprawdza, czy element jest zdefiniowany w paczce; jeśli nie, zakłada, że ​​jest to moduł i próbuje go załadować. Jeśli go nie znajdzie, zgłaszany jest wyjątek :exc:`ImportError`.

source: Contrarily, when using syntax like ``import item.subitem.subsubitem``, each item except for the last must be a package; the last item can be a module or a package but can't be a class or function or variable defined in the previous item.
pl: W przeciwieństwie do tego, gdy używana jest składnia ``import item.subitem.subsubitem``, każdy element oprócz ostatniego musi być pakietem; ostatni element może być modułem lub pakietem, ale nie może być klasą, funkcją lub zmienną zdefiniowaną w poprzednim elemencie.

source: Importing \* From a Package
pl: Importowanie \* z pakietu

source: Now what happens when the user writes ``from sound.effects import *``? Ideally, one would hope that this somehow goes out to the filesystem, finds which submodules are present in the package, and imports them all. This could take a long time and importing sub-modules might have unwanted side-effects that should only happen when the sub-module is explicitly imported.
pl: Teraz, co się dzieje, gdy użytkownik pisze ``from sound.effects import *``? W idealnym świecie, mamy nadzieję, że to w jakiś sposób wychodzi do systemu plików, wyszukuje, które podmoduły są obecne w pakiecie i importuje je wszystkie. Jednak może to zająć dużo czasu, a importowanie modułów podrzędnych może mieć niepożądane skutki uboczne, które powinny wystąpić tylko wtedy, gdy moduł podrzędny zostanie jawnie zaimportowany.

source: The only solution is for the package author to provide an explicit index of the package. The :keyword:`import` statement uses the following convention: if a package's :file:`__init__.py` code defines a list named ``__all__``, it is taken to be the list of module names that should be imported when ``from package import *`` is encountered. It is up to the package author to keep this list up-to-date when a new version of the package is released. Package authors may also decide not to support it, if they don't see a use for importing \* from their package. For example, the file :file:`sound/effects/__init__.py` could contain the following code::
pl: Jedynym rozwiązaniem jest podanie przez autora pakietu jawnego indeksu pakietu. Instrukcja :keyword:`import` wykorzystuje następującą konwencję: jeśli kod pakietu definiuje listę o nazwie ``__all__``, przyjmuje się, że jest to lista nazw modułów, które powinny zostać zaimportowane, gdy zostanie wywołane ``from package import *``. Do autora pakietu należy aktualizowanie tej listy po wydaniu nowej wersji pakietu. Autorzy pakietów mogą również zdecydować, że nie będą go wspierać, jeśli nie widzą zastosowania do importowania \* ze swojego pakietu. Na przykład plik :file:`sound/effects/__init__.py` może zawierać następujący kod::

source: This would mean that ``from sound.effects import *`` would import the three named submodules of the :mod:`sound.effects` package.
pl: To by znaczyło że ``from sound.effects import *`` zaimportuje trzy wymienione podmoduły z pakietu :mod:`sound.effects`.

source: If ``__all__`` is not defined, the statement ``from sound.effects import *`` does *not* import all submodules from the package :mod:`sound.effects` into the current namespace; it only ensures that the package :mod:`sound.effects` has been imported (possibly running any initialization code in :file:`__init__.py`) and then imports whatever names are defined in the package. This includes any names defined (and submodules explicitly loaded) by :file:`__init__.py`. It also includes any submodules of the package that were explicitly loaded by previous :keyword:`import` statements. Consider this code::
pl: Jeśli zmienna ``__all__`` nie jest zdefiniowana, instrukcja ``from sound.effects import *`` *nie* importuje wszystkich podmodułów z pakietu :mod:`sound.effects` do bieżącej przestrzeni nazw; upewnia się tylko, że pakiet :mod:`sound.effects` został zaimportowany (ewentualnie uruchamiając dowolny kod inicjujący w :file:`__init__.py`), a następnie importuje dowolne nazwy zdefiniowane w pakiecie. Obejmuje to wszelkie nazwy zdefiniowane (i jawnie załadowane moduły podrzędne) przez :file:`__init__.py`. Obejmuje również wszelkie podmoduły pakietu, które zostały jawnie załadowane przez poprzednie instrukcje :keyword:`import`. Rozważ ten kod::

source: In this example, the :mod:`echo` and :mod:`surround` modules are imported in the current namespace because they are defined in the :mod:`sound.effects` package when the ``from...import`` statement is executed. (This also works when ``__all__`` is defined.)
pl: W tym przykładzie moduły :mod:`echo` i :mod:`surround` są importowane do bieżącej przestrzeni nazw, ponieważ są zdefiniowane w pakiecie :mod:`sound.effects` podczas wykonywania instrukcji ``from...import``. (Działa to również, gdy zmienna ``__all__`` jest zdefiniowana.)

source: Although certain modules are designed to export only names that follow certain patterns when you use ``import *``, it is still considered bad practice in production code.
pl: Chociaż niektóre moduły są zaprojektowane do eksportowania tylko nazw zgodnych z określonymi wzorcami podczas używania ``import *``, nadal jest to uważane za złą praktykę w kodzie produkcyjnym.

source: Remember, there is nothing wrong with using ``from package import specific_submodule``! In fact, this is the recommended notation unless the importing module needs to use submodules with the same name from different packages.
pl: Pamiętaj, nie ma nic złego w używaniu ``from package import specific_submodule``! W rzeczywistości jest to zalecana notacja, chyba że moduł importujący musi używać podmodułów o tej samej nazwie z innych pakietów.

source: Intra-package References
pl: Referencje wewnątrz-pakietowe

source: When packages are structured into subpackages (as with the :mod:`sound` package in the example), you can use absolute imports to refer to submodules of siblings packages. For example, if the module :mod:`sound.filters.vocoder` needs to use the :mod:`echo` module in the :mod:`sound.effects` package, it can use ``from sound.effects import echo``.
pl: Gdy pakiety są podzielone na podpakiety (jak w przypadku pakietu :mod:`sound` w przykładzie), możesz użyć importu bezwzględnego, aby odnieść się do podmodułów siostrzanych pakietów. Na przykład, jeśli moduł :mod:`sound.filters.vocoder` musi użyć modułu :mod:`echo` w pakiecie :mod:`sound.effects`, może użyć ``from sound.effects import echo``.

source: You can also write relative imports, with the ``from module import name`` form of import statement. These imports use leading dots to indicate the current and parent packages involved in the relative import. From the :mod:`surround` module for example, you might use::
pl: Można również pisać importy względne w formie takiej: ``from module import name`` instrukcji importu. Te importy wykorzystują wiodące kropki do wskazania pakietów bieżących i nadrzędnych biorących udział w imporcie względnym. Na przykład z modułu :mod:`surround` możesz użyć::

source: Note that relative imports are based on the name of the current module. Since the name of the main module is always ``"__main__"``, modules intended for use as the main module of a Python application must always use absolute imports.
pl: Należy zauważyć, że importy względne są oparte na nazwie bieżącego modułu. Ponieważ nazwa głównego modułu to zawsze ``"__main__"``, moduły przeznaczone do użycia jako główny moduł aplikacji w Python-ie muszą zawsze używać bezwzględnego importu.

source: Packages in Multiple Directories
pl: Pakiety w wielu katalogach

source: Packages support one more special attribute, :attr:`__path__`. This is initialized to be a list containing the name of the directory holding the package's :file:`__init__.py` before the code in that file is executed. This variable can be modified; doing so affects future searches for modules and subpackages contained in the package.
pl: Pakiety obsługują jeszcze jeden specjalny atrybut, :attr:`__path__`. Jest to inicjalizowane jako lista zawierająca nazwę katalogu zawierającego :file:`__init__.py` przed wykonaniem kodu w tym pliku. Ta zmienna może być modyfikowana; ma to wpływ na przyszłe wyszukiwania modułów i podpakietów zawartych w pakiecie.

source: While this feature is not often needed, it can be used to extend the set of modules found in a package.
pl: Chociaż ta funkcja nie jest często potrzebna, można jej użyć do rozszerzenia zestawu modułów znajdujących się w pakiecie.

source: Footnotes
pl: Przypisy

source: In fact function definitions are also 'statements' that are 'executed'; the execution of a module-level function definition adds the function name to the module's global namespace.
pl: W rzeczywistości definicje funkcji są również „instrukcjami”, które są „wykonywane”; wykonanie definicji funkcji na poziomie modułu dodaje nazwę funkcji do globalnej przestrzeni nazw modułu.

source: module
pl: moduł

source: search
pl: wyszukiwanie

source: path
pl: ścieżka
