Repository: python/python-docs-pl
Catalog: tutorial/venv.po
Languages: pl

source: Virtual Environments and Packages
pl: Środowiska wirtualne i pakiety

source: Introduction
pl: Wprowadzenie

source: Python applications will often use packages and modules that don't come as part of the standard library. Applications will sometimes need a specific version of a library, because the application may require that a particular bug has been fixed or the application may be written using an obsolete version of the library's interface.
pl: Aplikacje Pythonowe często używają pakietów oraz modułów które nie są dołączone do standardowej biblioteki. Potrzebują one czasami konkretnej wersji biblioteki, ponieważ mogą wymagać naprawionego określonego błędu lub mogą być napisane przy użyciu przestarzałej wersji interfejsu biblioteki.

source: This means it may not be possible for one Python installation to meet the requirements of every application. If application A needs version 1.0 of a particular module but application B needs version 2.0, then the requirements are in conflict and installing either version 1.0 or 2.0 will leave one application unable to run.
pl: Oznacza to, że może nie być możliwe aby jedna instalacja Pythona spełniała wymagania każdej aplikacji. Jeżeli aplikacja A potrzebuje wersji 1.0 danego modułu, a aplikacja B potrzebuje wersji 2.0, wtedy wymagania są sprzeczne i zainstalowanie wersji 1.0 lub 2.0 uniemożliwi uruchomienie którejś z aplikacji.

source: The solution for this problem is to create a :term:`virtual environment`, a self-contained directory tree that contains a Python installation for a particular version of Python, plus a number of additional packages.
pl: Rozwiązaniem tego problemu jest stworzenie :term:`środowiska wirtualnego <virtual environment>`, samodzielnej struktury katalogów, które zawierają instalację Pythona dla określonej wersji oraz dodatkowych pakietów.

source: Different applications can then use different virtual environments. To resolve the earlier example of conflicting requirements, application A can have its own virtual environment with version 1.0 installed while application B has another virtual environment with version 2.0. If application B requires a library be upgraded to version 3.0, this will not affect application A's environment.
pl: Różne aplikacje mogą wtedy używać różnych środowisk wirtualnych. Aby rozwiązać wcześniej przytoczony przykład konfliktujących wymagań, aplikacja A może mieć swoje własne środowisko wirtualne z zainstalowaną wersją 1.0 w momencie gdy aplikacja B ma inne środowisko wirtualne z zainstalowaną wersją 2.0. Jeżeli w pewnym momencie aplikacja B będzie wymagała zaktualizowania modułu do wersji 3.0, nie wpłynie to na środowisko aplikacji A.

source: Creating Virtual Environments
pl: Tworzenie Środowisk Wirtualnych

source: The module used to create and manage virtual environments is called :mod:`venv`. :mod:`venv` will install the Python version from which the command was run (as reported by the :option:`--version` option). For instance, executing the command with ``python3.12`` will install version 3.12.
pl: Moduł używany do tworzenia i zarządzania środowiskami wirtualnymi nazywa się :mod:`venv`. :mod:`venv` zainstaluje wersję Pythona, z której polecenie zostało uruchomione (zgodnie z opcją :option:`--version`). Na przykład wykonanie polecenia z ``python3.12`` zainstaluje wersję 3.12.

source: To create a virtual environment, decide upon a directory where you want to place it, and run the :mod:`venv` module as a script with the directory path::
pl: Aby stworzyć środowisko wirtualne, wybierz katalog, w którym chcesz je umieścić i uruchom moduł :mod:`venv` jako skrypt ze ścieżką do katalogu::

source: This will create the ``tutorial-env`` directory if it doesn't exist, and also create directories inside it containing a copy of the Python interpreter and various supporting files.
pl: Spowoduje to utworzenie katalogu ``tutorial-env``, jeśli nie istnieje, a także utworzy w nim katalogi zawierające kopię interpretera Pythona i różne pliki pomocnicze.

source: A common directory location for a virtual environment is ``.venv``. This name keeps the directory typically hidden in your shell and thus out of the way while giving it a name that explains why the directory exists. It also prevents clashing with ``.env`` environment variable definition files that some tooling supports.
pl: Popularną lokalizacją katalogu dla środowiska wirtualnego jest ``.venv``. Nazwa ta sprawia, że katalog jest zwykle ukryty, a więc nie wchodzi w drogę, jednocześnie nadając mu nazwę, która wyjaśnia, po co dany katalog istnieje. Zapobiega to również kolizji z plikami ``.env`` definicji zmiennych środowiskowych, które są obsługiwane przez niektóre narzędzia.

source: Once you've created a virtual environment, you may activate it.
pl: Po utworzeniu środowiska wirtualnego możesz go aktywować.

source: On Windows, run::
pl: Na systemie Windows, uruchom::

source: On Unix or MacOS, run::
pl: Na systemie Unix albo MacOS, uruchom::

source: (This script is written for the bash shell. If you use the :program:`csh` or :program:`fish` shells, there are alternate ``activate.csh`` and ``activate.fish`` scripts you should use instead.)
pl: (Ten skrypt jest napisany dla powłoki bash. Jeżeli używasz powłok :program:`csh` albo :program:`fish`, istnieją skrypty ``activate.csh`` i ``activate.fish`` których powinieneś użyć.)

source: Activating the virtual environment will change your shell's prompt to show what virtual environment you're using, and modify the environment so that running ``python`` will get you that particular version and installation of Python. For example:
pl: Uruchomienie środowiska wirtualnego zmieni wygląd powłoki tak aby pokazywała z którego środowiska wirtualnego aktualnie korzystasz, oraz zmieni parametry środowiska tak że uruchomienie ``python`` wywoła określoną wersję i instalacje Pythona. Dla przykładu:

source: To deactivate a virtual environment, type::
pl: Aby deaktywować środowisko wirtualne, wpisz::

source: into the terminal.
pl: w terminalu.

source: Managing Packages with pip
pl: Zarządzanie pakietami używając pip

source: You can install, upgrade, and remove packages using a program called :program:`pip`. By default ``pip`` will install packages from the `Python Package Index <https://pypi.org>`_. You can browse the Python Package Index by going to it in your web browser.
pl: Możesz instalować, aktualizować oraz usuwać pakiety korzystając z pragramu nazywanego :program:`pip`. Domyślnie ``pip`` zainstaluje pakiety z `Python Package Index <https://pypi.org>`_. Możesz przeglądać dostępne tam pakiety wchodząc na ich stronę internetową.

source: ``pip`` has a number of subcommands: "install", "uninstall", "freeze", etc. (Consult the :ref:`installing-index` guide for complete documentation for ``pip``.)
pl: ``pip`` ma kilka podkomend: "install", "uninstall", "freeze" itp. (Zapoznaj się z przewodnikiem :ref:`installing-index`, aby uzyskać pełną dokumentację dotyczącą ``pip``.)

source: You can install the latest version of a package by specifying a package's name:
pl: Możesz zainstalować najnowszą wersję pakietu, podając jego nazwę:

source: You can also install a specific version of a package by giving the package name followed by ``==`` and the version number:
pl: Możesz również zainstalować konkretną wersję pakietu, podajac jego nazwę z dopiskiem ``==`` oraz numerem wersji:

source: If you re-run this command, ``pip`` will notice that the requested version is already installed and do nothing. You can supply a different version number to get that version, or you can run ``python -m pip install --upgrade`` to upgrade the package to the latest version:
pl: Jeśli ponownie uruchomisz to polecenie, ``pip`` zauważy, że żądana wersja jest już zainstalowana i nic nie zrobi. Możesz podać inny numer wersji, aby pobrać tę wersję, lub uruchomić ``python -m pip install --upgrade``, aby zaktualizować pakiet do najnowszej wersji:

source: ``python -m pip uninstall`` followed by one or more package names will remove the packages from the virtual environment.
pl: Wpisanie ``python -m pip uninstall``, a następnie jednej lub więcej nazw pakietów, usunie te pakiety ze środowiska wirtualnego.

source: ``python -m pip show`` will display information about a particular package:
pl: ``python -m pip show`` wyświetli informacje na temat określonego pakietu:

source: ``python -m pip list`` will display all of the packages installed in the virtual environment:
pl: ``python -m pip list`` wyświetli listę wszystkich pakietów zainstalowanych w środowisku wirtualnym:

source: ``python -m pip freeze`` will produce a similar list of the installed packages, but the output uses the format that ``python -m pip install`` expects. A common convention is to put this list in a ``requirements.txt`` file:
pl: ``python -m pip freeze`` wygeneruje podobną listę zainstalowanych pakietów, ale dane wyjściowe będą miały format, którego oczekuje ``python -m pip install``. Powszechną konwencją jest umieszczenie tej listy w pliku ``requirements.txt``:

source: The ``requirements.txt`` can then be committed to version control and shipped as part of an application. Users can then install all the necessary packages with ``install -r``:
pl: Plik ``requirements.txt`` można następnie przekazać do systemu kontroli wersji i wysłać jako część aplikacji. Użytkownicy mogą następnie zainstalować wszystkie niezbędne pakiety za pomocą ``install -r``:

source: ``pip`` has many more options. Consult the :ref:`installing-index` guide for complete documentation for ``pip``. When you've written a package and want to make it available on the Python Package Index, consult the `Python packaging user guide`_.
pl: ``pip`` ma o wiele więcej opcji. Zapoznaj się z przewodnikiem :ref:`installing-index`, aby uzyskać pełną dokumentację dotyczącą ``pip``. Kiedy napiszesz pakiet i będziesz chciał udostępnić go w indeksie pakietów Pythona, zapoznaj się z `Python packaging user guide`_.
