Repository: python/python-docs-pl
Catalog: about.po
Languages: pl

source: About these documents
pl: O tej dokumentacji

source: These documents are generated from `reStructuredText`_ sources by `Sphinx`_, a document processor specifically written for the Python documentation.
pl: Dokumenty są wygenerowane ze źródeł `reStructuredText`_ przez `Sphinksa`_, procesor dokumentów napisany specjalnie dla dokumentacji Pythona.

source: Development of the documentation and its toolchain is an entirely volunteer effort, just like Python itself. If you want to contribute, please take a look at the :ref:`reporting-bugs` page for information on how to do so. New volunteers are always welcome!
pl: Rozwój dokumentacji i jej oprzyrządowania jest w całości wysiłkiem wolontariackim, tak samo jak sam Python. Jeśli chcesz wnieść swój wkład, na stronie :ref:`reporting-bugs` znajdziesz informacje jak to zrobić. Nowi wolontariusze są zawsze mile widziani!

source: Many thanks go to:
pl: Ogromne podziękowania dla:

source: Fred L. Drake, Jr., the creator of the original Python documentation toolset and writer of much of the content;
pl: Freda L. Drake'a, Jr., twórcy oryginalnego zestawu narzędzi dokumentacji Pythona i autora dużej części jej treści;

source: the `Docutils <https://docutils.sourceforge.io/>`_ project for creating reStructuredText and the Docutils suite;
pl: projektu `Docutils <https://docutils.sourceforge.net/>`_ za stworzenie reStructuredText i pakietu Docutils;

source: Fredrik Lundh for his Alternative Python Reference project from which Sphinx got many good ideas.
pl: Fredrika Lundha za jego projekt Alternative Python Reference, z którego Sphinx wziął wiele dobrych pomysłów.

source: Contributors to the Python Documentation
pl: Współtwórcy dokumentacji Pythona

source: Many people have contributed to the Python language, the Python standard library, and the Python documentation. See :source:`Misc/ACKS` in the Python source distribution for a partial list of contributors.
pl: Wielu ludzi rozwija język Python, bibliotekę standardową Pythona i dokumentację. W :source:`Misc/ACKS` w źródłach Pythona znajdziesz częściową listę kontrybutorów.

source: It is only with the input and contributions of the Python community that Python has such wonderful documentation -- Thank You!
pl: Tylko dzięki wkładowi społeczności Python ma tak wspaniałą dokumentację – dziękujemy!
