Repository: python/python-docs-pl
Catalog: bugs.po
Languages: pl

source: Dealing with Bugs
pl: Zajmowanie się błędami

source: Python is a mature programming language which has established a reputation for stability. In order to maintain this reputation, the developers would like to know of any deficiencies you find in Python.
pl: Python jest dojrzałym językiem programowania, z ustaloną reputacją swojej stabilności. Aby utrzymać tę stabilność, deweloperzy chcieliby wiedzieć o wszelkich brakach, które da się znaleźć w Pythonie.

source: It can be sometimes faster to fix bugs yourself and contribute patches to Python as it streamlines the process and involves less people. Learn how to :ref:`contribute <contributing-to-python>`.
pl: Czasem szybsze może być własnoręczne naprawienie błędu i wysłanie patchy do Pythona, usprawnia to proces i angażuje mniej osób. Dowiedz się, jak :ref:`kontrybuować <contributing-to-python>`.

source: Documentation bugs
pl: Błędy w dokumentacji

source: If you find a bug in this documentation or would like to propose an improvement, please submit a bug report on the :ref:`tracker <using-the-tracker>`. If you have a suggestion on how to fix it, include that as well.
pl: Jeśli znajdziesz błąd w tej dokumentacji lub chciałbyś zaproponować poprawkę, wyślij, prosimy, zgłoszenie błędu do :ref:`systemu <using-the-tracker>`. Jeżeli błąd dotyczy jedynie polskiego tłumaczenia, zgłoś błąd pod adresem: https://github.com/python/python-docs-pl. Jeśli masz sugestię, jak naprawić błąd, zawrzyj ją w zgłoszeniu.

source: You can also open a discussion item on our `Documentation Discourse forum <https://discuss.python.org/c/documentation/26>`_.
pl: Możesz również otworzyć dyskusję na naszym `forum Discourse dokumentacji <https://discuss.python.org/c/documentation/26>`_.

source: If you're short on time, you can also email documentation bug reports to docs@python.org (behavioral bugs can be sent to python-list@python.org). 'docs@' is a mailing list run by volunteers; your request will be noticed, though it may take a while to be processed.
pl: Jeśli brakuje ci czasu, możesz też wysyłać zgłoszenia błędów w dokumentacji na docs@python.org (błędy behawioralne mogą być wysyłane na python-list@python.org). 'docs@' jest listą mailingową prowadzoną przez wolontariuszy; twoje zgłoszenie zostanie zauważone, aczkolwiek jego przetworzenie może chwilę zająć.

source: `Documentation bugs`_
pl: `Błędy w dokumentacji`_

source: A list of documentation bugs that have been submitted to the Python issue tracker.
pl: Lista błędów w dokumentacji, które zostały wysłane do systemu zgłoszeń błędów Pythona.

source: `Issue Tracking <https://devguide.python.org/tracker/>`_
pl: `Śledzenie zgłoszeń <https://devguide.python.org/tracker/>`_

source: Overview of the process involved in reporting an improvement on the tracker.
pl: Omówienie procesu zgłaszania poprawki w systemie zgłoszeń.

source: `Helping with Documentation <https://devguide.python.org/docquality/#helping-with-documentation>`_
pl: `Pomoc w dokumentacji <https://devguide.python.org/docquality/#helping-with-documentation>`_

source: Comprehensive guide for individuals that are interested in contributing to Python documentation.
pl: Wyczerpujący przewodnik dla osób zainteresowanych rozwijaniem dokumentacji Pythona.

source: `Documentation Translations <https://devguide.python.org/documenting/#translating>`_
pl: `Tłumaczenia dokumentacji <https://devguide.python.org/documenting/#translating>`_

source: A list of GitHub pages for documentation translation and their primary contacts.
pl: Lista stron GitHub do tłumaczenia dokumentacji i ich główne kontakty.

source: Using the Python issue tracker
pl: Używanie systemu zgłoszeń Pythona

source: Issue reports for Python itself should be submitted via the GitHub issues tracker (https://github.com/python/cpython/issues). The GitHub issues tracker offers a web form which allows pertinent information to be entered and submitted to the developers.
pl: Zgłoszenia błędów w Pythonie powinny być zgłaszane przez system zgłoszeń GitHub (https://github.com/python/cpython/issues). System zgłoszeń GitHub posiada formularz, który pozwala wprowadzić stosowne informacje i wysłać je deweloperom.

source: The first step in filing a report is to determine whether the problem has already been reported. The advantage in doing so, aside from saving the developers' time, is that you learn what has been done to fix it; it may be that the problem has already been fixed for the next release, or additional information is needed (in which case you are welcome to provide it if you can!). To do this, search the tracker using the search box at the top of the page.
pl: Pierwszym krokiem przy wypełnianiu zgłoszenia jest ustalenie, czy problem został już zgłoszony. Zaletą tego ustalenia, oprócz oszczędzenia czasu deweloperów, jest to, że dowiesz się, co zostało zrobione, aby go naprawić; być może problem został już naprawiony na następne wydanie lub potrzebne są dodatkowe informacje (w tym przypadku zapraszamy cię, żebyś je podał, jeśli możesz!). Aby to zrobić, przeszukaj istniejące zgłoszenia używając pola wyszukiwania na górze strony.

source: If the problem you're reporting is not already in the list, log in to GitHub. If you don't already have a GitHub account, create a new account using the "Sign up" link. It is not possible to submit a bug report anonymously.
pl: Jeśli problemu, który zgłaszasz, nie ma jeszcze na liście, zaloguj się do GitHuba. Jeśli nie masz jeszcze konta GitHub, stwórz nowe konto używając linku „Sign up”. Nie da się stworzyć zgłoszenia anonimowo.

source: Being now logged in, you can submit an issue. Click on the "New issue" button in the top bar to report a new issue.
pl: Będąc zalogowanym możesz wysłać zgłoszenie. Kliknij przycisk "Nowe zgłoszenie" w górnym pasku, aby wysłać nowe zgłoszenie.

source: The submission form has two fields, "Title" and "Comment".
pl: Formularz zgłoszenia ma dwa pola: „Tytuł” oraz „Komentarz”.

source: For the "Title" field, enter a *very* short description of the problem; fewer than ten words is good.
pl: W polu „Tytuł” wpisz *bardzo* krótki opis problemu; najlepiej mniej niż dziesięć słów.

source: In the "Comment" field, describe the problem in detail, including what you expected to happen and what did happen. Be sure to include whether any extension modules were involved, and what hardware and software platform you were using (including version information as appropriate).
pl: W polu „Comment” opisz problem szczegółowo, zawierając informacje o tym, czego się spodziewałeś, aby się stało i co się stało zamiast. Zawrzyj informację, czy dotyczy to jakiegokolwiek modułu rozszerzeń i platform hardware'owych i software'owych, których używałeś (oraz informacje o wersjach).

source: Each issue report will be reviewed by a developer who will determine what needs to be done to correct the problem. You will receive an update each time an action is taken on the issue.
pl: Każde zgłoszenie będzie zweryfikowane przez twórcę oprogramowania, który oceni, co musi być zrobione, aby naprawić problem. Otrzymasz aktualizację za każdym razem, gdy wobec zgłoszenia zostanie podjęte działanie.

source: Article which goes into some detail about how to create a useful bug report. This describes what kind of information is useful and why it is useful.
pl: Artykuł, który dość szczegółowo opisuje, jak stworzyć wartościowe zgłoszenie błędu. Opisuje jakie rodzaje informacji są przydatne i dlaczego.

source: Information about writing a good bug report. Some of this is specific to the Mozilla project, but describes general good practices.
pl: Informacje o pisaniu dobrych zgłoszeń błędów. Niektóre z nich są specyficzne dla projektu Mozilla, ale opisują ogólne dobre praktyki.

source: Getting started contributing to Python yourself
pl: Rozpoczęcie rozwijania Pythona samemu

source: Beyond just reporting bugs that you find, you are also welcome to submit patches to fix them. You can find more information on how to get started patching Python in the `Python Developer's Guide`_. If you have questions, the `core-mentorship mailing list`_ is a friendly place to get answers to any and all questions pertaining to the process of fixing issues in Python.
pl: Oprócz tylko zgłaszania błędów, które znajdziesz, jesteś również zaproszony do wysyłania patchy naprawiających je. Więcej informacji o tym, jak zacząć patchować Pythona, znajdziesz w `Python Developer's Guide`_. Jeśli masz pytania, `lista mailingowa core-mentorship`_ jest przyjaznym miejscem do uzyskiwania odpowiedzi na każde pytanie typowe dla procesu naprawiania błędów w Pythonie.
