Repository: python/python-docs-pl
Catalog: library/asynchat.po
Languages: pl

source: :mod:`asynchat` --- Asynchronous socket command/response handler
pl: :mod:`asynchat` --- Asynchroniczna obsługa gniazda komend/odpowiedzi.

source: This module builds on the :mod:`asyncore` infrastructure, simplifying asynchronous clients and servers and making it easier to handle protocols whose elements are terminated by arbitrary strings, or are of variable length. :mod:`asynchat` defines the abstract class :class:`async_chat` that you subclass, providing implementations of the :meth:`collect_incoming_data` and :meth:`found_terminator` methods. It uses the same asynchronous loop as :mod:`asyncore`, and the two types of channel, :class:`asyncore.dispatcher` and :class:`asynchat.async_chat`, can freely be mixed in the channel map. Typically an :class:`asyncore.dispatcher` server channel generates new :class:`asynchat.async_chat` channel objects as it receives incoming connection requests.
pl: Ten moduł buduje na infrastrukturze modułu :mod:`asyncore`, upraszczając klientów i serwery asynchroniczne i czyniąc łatwiejszym obsługę protokołów których elementy są zakańczane przez zadane ciągi znaków, lub są zmiennej długości. Moduł :mod:`asynchat` określa abstrakcyjne uogólnienie :class:`async_chat` które możesz dostosować tworząc własne podrzędne uogólnienie, dostarczając wypełnień sposobów postępowania :meth:`collect_incoming_data` i :meth:`found_terminator`. Używa tej samej asynchronicznej pętli co moduł :mod:`asyncore`, i dwóch rodzajów kanałów, - :class:`asyncore.dispatcher` i :class:`asynchat.async_chat`, mogą być dowolnie być mieszane w mapie kanałów. Typowo kanał serwera :class:`asyncore.dispatcher` generuje nowe obiekty kanałów :class:`asynchat.async_chat` gdy otrzymuje wchodzące zapytania o połączenie.

source: This class is an abstract subclass of :class:`asyncore.dispatcher`. To make practical use of the code you must subclass :class:`async_chat`, providing meaningful :meth:`collect_incoming_data` and :meth:`found_terminator` methods. The :class:`asyncore.dispatcher` methods can be used, although not all make sense in a message/response context.
pl: To uogólnienie jest abstrakcyjnym uogólnieniem podrzędnym względem uogólnienia :class:`asyncore.dispatcher`. Aby praktycznie użyć kodu musisz dostosować podrzędne uogólnienie względem uogólnienia :class:`async_chat`, dostarczając sensownego wypełnienia sposobu postępowania :meth:`collect_incoming_data` i sposobu postępowania :meth:`found_terminator`. Sposoby postępowania uogólnienia :class:`asyncore.dispatcher` mogą być używane, chociaż nie wszystkie mają sens w kontekście wiadomość/odpowiedź.

source: Two class attributes can be modified, to improve performance, or possibly even to conserve memory.
pl: Dwie właściwości uogólnienia mogą być modyfikowane, aby poprawić wydajność, lub nawet aby możliwie oszczędzać pamięć.

source: The asynchronous input buffer size (default ``4096``).
pl: Rozmiar przestrzeni wymiany wejściowej asynchronicznej (domyślnie ``4096``).

source: The asynchronous output buffer size (default ``4096``).
pl: Rozmiar przestrzeni wymiany wyjściowej asynchronicznej (domyślnie ``4096``).

source: To build a functioning :class:`async_chat` subclass your input methods :meth:`collect_incoming_data` and :meth:`found_terminator` must handle the data that the channel receives asynchronously. The methods are described below.
pl: Aby zbudować funkcjonujące podrzędne uogólnienia względem uogólnienia :class:`async_chat`, twoje sposoby postępowania wprowadzania :meth:`collect_incoming_data` i :meth:`found_terminator` muszą obsługiwać dane które kanał otrzymuje asynchronicznie. Sposoby postępowania są opisane poniżej.

source: Called with *data* holding an arbitrary amount of received data. The default method, which must be overridden, raises a :exc:`NotImplementedError` exception.
pl: Wywoływany z *danymi* przechowując określoną ilość otrzymanych danych. Domyślny sposób postępowania, który musi zostać przesłonięty, zgłasza wyjątek :exc:`NotImplementedError`.

source: Called when the incoming data stream matches the termination condition set by :meth:`set_terminator`. The default method, which must be overridden, raises a :exc:`NotImplementedError` exception. The buffered input data should be available via an instance attribute.
pl: Wywoływana gdy przychodzący strumień danych odpowiada warunkowi zakończenia ustawionemu przez sposób postępowania :meth:`set_terminator`. Domyślny sposób postępowania, który musi być przesłonięty, zgłasza wyjątek :exc:`NotImplementedError`. Dane wejściowe z przestrzeni wymiany powinny być dostępne przez właściwość przykładu.

source: Returns the current terminator for the channel.
pl: Zwraca obecne zakończenie dla kanału.

source: Sets the terminating condition to be recognized on the channel. ``term`` may be any of three types of value, corresponding to three different ways to handle incoming protocol data.
pl: Ustawia warunek zakończenia aby był rozpoznany przez kanał. ``term`` może być dowolną z trzech typów wartości, odpowiadających trzem różnym sposobom obsługi przychodzących danych protokołu.

source: term
pl: term - z ang. - termin

source: Description
pl: Opis

source: *string*
pl: *ciąg znaków*

source: Will call :meth:`found_terminator` when the string is found in the input stream
pl: Wywoła sposób postępowania :meth:`found_terminator` gdy ciąg znaków zostanie znaleziony w strumieniu wejściowym

source: *integer*
pl: *integer* - z ang. - *liczba całkowita*

source: Will call :meth:`found_terminator` when the indicated number of characters have been received
pl: Wywoła :meth:`found_terminator` gdy wskazana liczba znaków zostanie odebrana

source: ``None``
pl: ``None`` - z ang. - ``Żaden``

source: The channel continues to collect data forever
pl: Kanał nadal zbiera dane w pętli nieskończonej

source: Note that any data following the terminator will be available for reading by the channel after :meth:`found_terminator` is called.
pl: Zauważ że dowolne dane następujące po terminatorze będą dostępne dla przeczytania przez kanał po tym jak sposób postępowania :meth:`found_terminator` zostanie wywołany.

source: asynchat Example
pl: Przykład asynchat

source: The following partial example shows how HTTP requests can be read with :class:`async_chat`. A web server might create an :class:`http_request_handler` object for each incoming client connection. Notice that initially the channel terminator is set to match the blank line at the end of the HTTP headers, and a flag indicates that the headers are being read.
pl: Następujący częściowy przykład pokazuje jak zapytania HTTP mogą być wczytane za pomocą :class:`async_chat`. Serwer sieci może tworzyć obiekt :class:`http_request_handler` dla każdego przychodzącego połączenia klienckiego. Zauważ że początkowo zakończenie kanału jest ustalone aby odpowiadało pustej linii na końcu nagłówka HTTP, i flaga wskazująca że nagłówki są wczytywane.

source: Once the headers have been read, if the request is of type POST (indicating that further data are present in the input stream) then the ``Content-Length:`` header is used to set a numeric terminator to read the right amount of data from the channel.
pl: Gdy już nagłówki zostaną wczytane, jeśli zapytanie jest typu POST (wskazując na to że dalsze dane są obecne w strumieniu wejściowym) wtedy nagłówek ``Content-Length:`` jest używany aby ustawić numeryczny terminator do wczytania właściwej ilości danych z kanału.

source: The :meth:`handle_request` method is called once all relevant input has been marshalled, after setting the channel terminator to ``None`` to ensure that any extraneous data sent by the web client are ignored. ::
pl: Metoda :meth:`handle_request` jest wywoływane gdy już całe istotne wejście zostało pobrane, po ustawieniu terminatora kanału na ``None`` - z ang. - ``Żaden`` aby upewnić się że jakiekolwiek nadmiarowe dane przesyłane przez klienta sieci są ignorowane. ::
