Repository: python/python-docs-pl
Catalog: distutils/builtdist.po
Languages: pl

source: Creating Built Distributions
pl: Tworzenie Zbudowanych Dystrybucji

source: This document is being retained solely until the ``setuptools`` documentation at https://setuptools.readthedocs.io/en/latest/setuptools.html independently covers all of the relevant information currently included here.
pl: Ten dokument jest przechowywany wyłącznie do czasu, gdy dokumentacja ``setuptools`` pod adresem https://setuptools.readthedocs.io/en/latest/setuptools.html niezależnie obejmie wszystkie istotne informacje, które są tutaj zawarte.

source: A "built distribution" is what you're probably used to thinking of either as a "binary package" or an "installer" (depending on your background). It's not necessarily binary, though, because it might contain only Python source code and/or byte-code; and we don't call it a package, because that word is already spoken for in Python. (And "installer" is a term specific to the world of mainstream desktop systems.)
pl: "Zbudowana dystrybucja" jest pewnie tym do czego przyzwyczaiłeś się myśleć gdy napotykasz "binarny pakiet" lub "instalator" (w zależności od twoich dotychczasowych doświadczeń). Nie jest ona jednak koniecznie binarna, gdyż może zawierać tylko kod w języku pytonowskim i/lub kod-kęsowy; i nie nazywamy jej pakietem, gdyż ten termin jest już zarezerwowany w języku pytonowskim. (Zaś "instalator" jest terminem szczególnym dla świata systemów typu desktop głównego nurtu.)

source: A built distribution is how you make life as easy as possible for installers of your module distribution: for users of RPM-based Linux systems, it's a binary RPM; for Windows users, it's an executable installer; for Debian-based Linux users, it's a Debian package; and so forth. Obviously, no one person will be able to create built distributions for every platform under the sun, so the Distutils are designed to enable module developers to concentrate on their specialty---writing code and creating source distributions---while an intermediary species called *packagers* springs up to turn source distributions into built distributions for as many platforms as there are packagers.
pl: Zbudowana dystrybucja to sposób w jaki możesz ułatwić życie tak bardzo jak to jest możliwe dla osób instalujących dystrybucję twojego modułu: dla użytkowników systemu Linux opartego o pakiety RPM, jest to binarny RPM; dla użytkowników Windows, jest to wykonywalny instalator; dla użytkowników systemu Linux opartego o Debiana jest to pakiet Debiana, itd. Oczywiście nikt przy zdrowych zmysłach nie jest w stanie tworzyć zbudowanych dystrybucji dla każdej maszyny/środowiska pod słońcem, więc Distutils są pomyślane tak aby umożliwić twórcom modułów skupienie się na tym na czym się znają najlepiej---pisaniu kodu i tworzeniu dystrybucji źródłowej---podczas gdy kasta pośrednicząca zwana *pakieciarzami* narodziła się aby zamieniać dystrybucje źródłowe w zbudowane dystrybucje dla tak wielu maszyn/środowisk jak wielu jest pakieciarzy.

source: As a simple example, if I run the following command in the Distutils source tree::
pl: Jako prosty przykład, jeśli uruchomię następujące polecenie na drzewie źródeł Distutils::

source: then the Distutils builds my module distribution (the Distutils itself in this case), does a "fake" installation (also in the :file:`build` directory), and creates the default type of built distribution for my platform. The default format for built distributions is a "dumb" tar file on Unix, and a simple executable installer on Windows. (That tar file is considered "dumb" because it has to be unpacked in a specific location to work.)
pl: wtedy Distutils buduje dystrybucję mojego modułu (samo Distutils w tym przypadku), wykonuje "fałszywą" instalację (także w katalogu :file:`build`), i tworzy domyślny rodzaj zbudowanej dystrybucji dla mojej maszyny/środowiska. Domyślnym formatem dla zbudowanych dystrybucji jest "durny" plik tar na Unix-ie, i prosty wykonywalny instalator w Windows. (Ten plik tar jest uznawany za "głupi" gdyż musi zostać rozpakowany w szczególnym miejscu aby mógł zadziałać.)

source: Thus, the above command on a Unix system creates :file:`Distutils-1.0.{plat}.tar.gz`; unpacking this tarball from the right place installs the Distutils just as though you had downloaded the source distribution and run ``python setup.py install``. (The "right place" is either the root of the filesystem or Python's :file:`{prefix}` directory, depending on the options given to the :command:`bdist_dumb` command; the default is to make dumb distributions relative to :file:`{prefix}`.)
pl: Więc, powyższe polecenie tworzy w systemie Unix plik :file:`Distutils`1.0.{plat}.tar.gz`; rozpakowanie tego tarball-a z właściwego miejsca instaluje Distutils tak, jakbyś ściągnął dystrybucję źródłową i uruchomił ``python setup.py install`` ("właściwe miejsce" to zarówno katalog nadrzędny systemu plików lub katalog :file:`{prefix}` języka pytonowskiego, zależnie od opcji przekazanych poleceniu :command:`bdist_dumb`; domyślnie jest to robienie niezbyt-mądrej dystrybucji w odniesieniu do :file:`{prefix}`.)

source: Obviously, for pure Python distributions, this isn't any simpler than just running ``python setup.py install``\ ---but for non-pure distributions, which include extensions that would need to be compiled, it can mean the difference between someone being able to use your extensions or not. And creating "smart" built distributions, such as an RPM package or an executable installer for Windows, is far more convenient for users even if your distribution doesn't include any extensions.
pl: Oczywiście, dla czystych dystrybucji języka pytonowskiego, to nie jest w żaden sposób prostsze niż po prostu uruchomienie ``python setup.py install``\ ---ale dla dystrybucji "nie"-czystych, które zawierają rozszerzenia które wymagają kompilacji, może to mieć znaczenie dla kogoś kto będzie mógł użyć twoich rozszerzeń lub nie. Zaś tworzenie "inteligentnie" zbudowanych dystrybucji, takich jak pakiet RPM lub instalator wykonywalny dla Windows, jest dużo prostsze dla użytkowników nawet jeśli twoja dystrybucja nie zawiera żadnych rozszerzeń.

source: would, when run on a Unix system, create :file:`Distutils-1.0.{plat}.zip`\ ---again, this archive would be unpacked from the root directory to install the Distutils.
pl: mogłoby gdy uruchomione na systemie Unix-owym, stworzyć plik :file:`Distutils-1.0.{plat}.zip`\---znów, to archiwum mogłoby być rozpakowane z katalogu nadrzędnego systemu plików w celu zainstalowania Distutils.

source: The available formats for built distributions are:
pl: Dostępne formaty dla zbudowanych dystrybucji to:

source: Description
pl: Opis

source: Notes
pl: Notatki

source: gzipped tar file (:file:`.tar.gz`)
pl: gzip-nięty plik tar (:file:`.tar.gz`)

source: compressed tar file (:file:`.tar.Z`)
pl: skompresowany plik tar (:file:`.tar.Z`)

source: tar file (:file:`.tar`)
pl: plik tar (:file:`.tar`)

source: zip file (:file:`.zip`)
pl: plik zip (:file:`.zip`)

source: Solaris :program:`pkgtool`
pl: Solarisowe narzędzie :program:`pkgtool`

source: HP-UX :program:`swinstall`
pl: program systemu HP-UX :program:`swinstall`

source: Microsoft Installer.
pl: Instalator Microsoft

source: Notes:
pl: Uwagi:

source: default on Unix
pl: domyślne dla Unix

source: default on Windows
pl: domyślne dla Windows

source: requires either external :program:`zip` utility or :mod:`zipfile` module (part of the standard Python library since Python 1.6)
pl: wymaga zewnętrznego programu użytkowego :program:`zip` lub modułu :mod:`zipfile` (części standardowej biblioteki języka pytonowskiego od wersji 1.6 języka pytonowskiego)

source: requires external :program:`rpm` utility, version 3.0.4 or better (use ``rpm --version`` to find out which version you have)
pl: wymaga zewnętrznego programu użytkowego :program:`rpm`, w wersji 3.0.4 lub lepszej (użyj ``rpm --version`` aby dowiedzieć się, którą wersję posiadasz)

source: Command
pl: Polecenie

source: Formats
pl: Formaty

source: The following sections give details on the individual :command:`bdist_\*` commands.
pl: Następujące paragrafy opowiadają w szczegółach o poszczególnych poleceniach :command:`bdist_\*`

source: Creating RPM packages
pl: Tworzenie pakietów RPM

source: The RPM format is used by many popular Linux distributions, including Red Hat, SuSE, and Mandrake. If one of these (or any of the other RPM-based Linux distributions) is your usual environment, creating RPM packages for other users of that same distribution is trivial. Depending on the complexity of your module distribution and differences between Linux distributions, you may also be able to create RPMs that work on different RPM-based distributions.
pl: Format RPM jest używany przez wiele popularnych dystrybucji Linuxa, włączając w to Red Hat, SuSE, i Mandrake. Jeśli jeden z nich (lub jakiekolwiek inne oparte o RPM dystrybucje Linuxa) są twoim typowym środowiskiem, tworzenie pakietów RPM dla innych użytkowników tej samej dystrybucji jest trywialne. W zależności od złożoności dystrybucji twojego modułu i różnic pomiędzy dystrybucjami Linux-a możesz być w stanie stworzyć RPMy, które współpracują z różnymi opartymi-o-RPM dystrybucjami.

source: The usual way to create an RPM of your module distribution is to run the :command:`bdist_rpm` command::
pl: Zwykłym sposobem na utworzenie RPMu twojej dystrybucji modułu jest uruchomienie polecenia :command:`bdist_rpm`::

source: The former allows you to specify RPM-specific options; the latter allows you to easily specify multiple formats in one run. If you need to do both, you can explicitly specify multiple :command:`bdist_\*` commands and their options::
pl: To pierwsze pozwala ci określić szczególne-dla-RPM opcje; to ostatnie pozwala Ci łatwo tworzyć wiele formatów za jednym zamachem. Jeśli potrzebujesz zrobić obydwu, możesz jawnie wyszczególnić wiele poleceń :command:`bdist_\*` i ich opcji::

source: Creating RPM packages is driven by a :file:`.spec` file, much as using the Distutils is driven by the setup script. To make your life easier, the :command:`bdist_rpm` command normally creates a :file:`.spec` file based on the information you supply in the setup script, on the command line, and in any Distutils configuration files. Various options and sections in the :file:`.spec` file are derived from options in the setup script as follows:
pl: Tworzenie pakietu RPM jest napędzane plikiem :file:`.spec`, tak jak używanie Distutils jest napędzane skryptem instalacyjnym. Aby ułatwić ci życie, polecenie :command:`bidst_rpm` zwykle tworzy plik :file:`.spec` oparte o informację którą mu dostarczasz w skrypcie instalacyjnym, w wierszu poleceń, i w plikach konfiguracyjnych Distutils. Różne opcje i sekcje w pliku :file:`.spec` są pochodnymi po opcjach w skrypcie instalacyjnym w następujący sposób:

source: RPM :file:`.spec` file option or section
pl: plik RPM :file:`.spec` opcja lub sekcja

source: Distutils setup script option
pl: opcja skryptu instalacyjnego Distutils

source: Name
pl: Nazwa

source: ``name``
pl: ``nazwa``

source: Summary (in preamble)
pl: Podsumowanie (w preambule)

source: ``description``
pl: ``opis``

source: Version
pl: Wersja

source: ``version``
pl: ``wersja``

source: Vendor
pl: Dostawca

source: Copyright
pl: Prawa autorskie

source: ``license``
pl: ``licencja``

source: Url
pl: adres Url

source: %description (section)
pl: %opis (sekcja)

source: ``long_description``
pl: ``dlugi_opis``

source: Additionally, there are many options in :file:`.spec` files that don't have corresponding options in the setup script. Most of these are handled through options to the :command:`bdist_rpm` command as follows:
pl: Dodatkowo, istnieje wiele opcji w plikach :file:`.spec` które nie muszą mieć odpowiadających opcji w skrypcie instalacyjnym. Większość z tych jest obsługiwana przez opcje polecenia :command:`bdist_rpm` jak następuje:

source: default value
pl: wartość domyślna

source: Release
pl: wydanie

source: Group
pl: Grupa

source: "Development/Libraries"
pl: "Rozwój/Biblioteki"

source: (see above)
pl: (zobacz powyżej)

source: Packager
pl: Pakujący

source: (none)
pl: (żaden)

source: Provides
pl: Dostarcza

source: Requires
pl: Wymaga

source: Conflicts
pl: Konflikty

source: Obsoletes
pl: Zbędne

source: Distribution
pl: Dystrybucja

source: BuildRequires
pl: ZbudowanieWymaga

source: Icon
pl: Obrazek

source: There are three steps to building a binary RPM package, all of which are handled automatically by the Distutils:
pl: Istnieją trzy kroki do zbudowania binarnego pakietu RPM, z których wszystkie są obsługiwane automatycznie przez Distutils:

source: create a :file:`.spec` file, which describes the package (analogous to the Distutils setup script; in fact, much of the information in the setup script winds up in the :file:`.spec` file)
pl: utwórz plik :file:`.spec`, który opisuje pakiet (analogiczny do skryptu instalacyjnego Distutils; w rzeczywistości, większość informacji w skrypcie instalacyjnym ląduje do pliku :file:`.spec`)

source: create the source RPM
pl: stwórz źródłowy RPM

source: create the "binary" RPM (which may or may not contain binary code, depending on whether your module distribution contains Python extensions)
pl: stwórz „binarny” pakiet RPM (który może zawierać lub może nie zawierać kodu binarnego, w zależności od tego czy dystrybucja modułu zawiera rozszerzenia Pythona)

source: Normally, RPM bundles the last two steps together; when you use the Distutils, all three steps are typically bundled together.
pl: Zwykle, pakiet RPM gromadzi dwa ostatnie kroki razem; gdy używasz Distutils, wszystkie trzy kroki są zwyczajowo zgromadzone razem.

source: Cross-compiling on Windows
pl: Krzyżowa-kompilacja w Windows.

source: Starting with Python 2.6, distutils is capable of cross-compiling between Windows platforms. In practice, this means that with the correct tools installed, you can use a 32bit version of Windows to create 64bit extensions and vice-versa.
pl: Poczynając od języka pytonowskiego 2.6, distutils jest w stanie krzyżowo-kompilować pomiędzy maszynami/środowiskami windowsowskimi. W praktyce, to oznacza, że z właściwymi narzędziami zainstalowanymi, możesz użyć 32bitowej wersji Windows aby utworzyć 64bitowe rozszerzenia i odwrotnie (64 bitowego Windowsa aby utworzyć 32 bitowe rozszerzenia).

source: would create a 64bit installation executable on your 32bit version of Windows.
pl: stworzyłoby 64-bitowy plik wykonywalny instalacji na twojej 32-bitowej wersji Windows.

source: Note that by default, Visual Studio 2008 does not install 64bit compilers or tools. You may need to reexecute the Visual Studio setup process and select these tools (using Control Panel->[Add/Remove] Programs is a convenient way to check or modify your existing install.)
pl: Zauważ że domyślnie, Visual Studio 2008 nie instaluje kompilatorów 64-bitowych kompilatorów ani narzędzi. Możesz potrzebować przejść jeszcze raz proces instalacyjny Visual Studio i wybrać te narzędzia (używanie Panelu Sterowania->[Dodaj/Usuń] Programy jest wygodnym sposobem aby sprawdzić lub zmodyfikować istniejącą instalację.)

source: The Postinstallation script
pl: Skrypt poinstalacyjny

source: The installation script runs embedded in the windows installer, every output (``sys.stdout``, ``sys.stderr``) is redirected into a buffer and will be displayed in the GUI after the script has finished.
pl: Skrypt instalacyjny uruchamia się załączony w instalatorze windows, każde wyjście (``sys.stdout``, ``sys.stderr``) jest przekierowane do bufora i zostanie wyświetlona w GUI (sprzęgu graficznym użytkownika) po tym jak skrypt się zakończy.

source: Some functions especially useful in this context are available as additional built-in functions in the installation script.
pl: Niektóre zadania szczególnie użyteczne w tym kontekście są dostępne jako dodatkowe wbudowane zadania w skrypcie instalacyjnym.

source: These functions should be called when a directory or file is created by the postinstall script at installation time. It will register *path* with the uninstaller, so that it will be removed when the distribution is uninstalled. To be safe, directories are only removed if they are empty.
pl: Te zadania powinny być uruchamiane gdy katalog lub plik jest tworzony przez skrypt poinstalacyjny w czasie instalacji. Zarejestruje on *ścieżkę* w programie odinstalowującym, tka, aby był usunięty gdy dystrybucja jest odinstalowywana. Dla bezpieczeństwa, katalogi są usuwane tylko, jeśli są puste.

source: This function can be used to retrieve special folder locations on Windows like the Start Menu or the Desktop. It returns the full path to the folder. *csidl_string* must be one of the following strings::
pl: To zadanie może być używane do pobierania szczególnych miejsc w Windows takich jak menu Start lub pulpit. Zwraca pełną ścieżkę dostępu do folderu. *csidl_string* musi być jednym z następujących ciągów znaków::

source: If the folder cannot be retrieved, :exc:`OSError` is raised.
pl: Jeśli folder nie może być pobrany wyjątek :exc:`OSError` jest zgłaszany.

source: This function creates a shortcut. *target* is the path to the program to be started by the shortcut. *description* is the description of the shortcut. *filename* is the title of the shortcut that the user will see. *arguments* specifies the command line arguments, if any. *workdir* is the working directory for the program. *iconpath* is the file containing the icon for the shortcut, and *iconindex* is the index of the icon in the file *iconpath*. Again, for details consult the Microsoft documentation for the :class:`IShellLink` interface.
pl: To zadanie tworzy skrót. *cel* ( - z ang. - *target* ) jest ścieżką do programu do uruchomienia przez skrót. *description* jest opisem skrótu. *filename* jest tytułem skrótu który użytkownik zobaczy. *arguments* określa parametry wiersza polecenia, jeśli jakieś mają wystąpić. *workdir* jest katalogiem roboczym dla programu. *iconpath* jest ścieżką dostępu do pliku zawierającego obrazek dla skrótu, zaś *iconindex* jest indeksem obrazka w pliku *iconpath*. Znów po więcej szczegółów zwróć się do dokumentacji Microsoftu pod hasłem sprzęgu :class:`IShellLink`.
