Repository: python/python-docs-pl
Catalog: distutils/commandref.po
Languages: pl

source: Command Reference
pl: Podręcznik poleceń

source: This document is being retained solely until the ``setuptools`` documentation at https://setuptools.readthedocs.io/en/latest/setuptools.html independently covers all of the relevant information currently included here.
pl: Ten dokument jest przechowywany wyłącznie do czasu, gdy dokumentacja ``setuptools`` pod adresem https://setuptools.readthedocs.io/en/latest/setuptools.html niezależnie obejmie wszystkie istotne informacje, które są tutaj zawarte.

source: Installing modules: the :command:`install` command family
pl: Instalowanie modułów: rodzina poleceń :command:`install`

source: The install command ensures that the build commands have been run and then runs the subcommands :command:`install_lib`, :command:`install_data` and :command:`install_scripts`.
pl: Polecenie install zapewnia, że polecenia budowy zostały uruchomione a potem uruchamia podrzędne polecenia :command:`install_lib`, :command:`install_data` i :command:`install_scripts`.

source: This command installs all data files provided with the distribution.
pl: To polecenie instaluje wszystkie pliki danych dostarczone do dystrybucji.

source: This command installs all (Python) scripts in the distribution.
pl: To polecenie instaluje wszystkie skrypty języka pytonowskiego w dystrybucji.

source: The manifest template commands are:
pl: Polecenia wzorca manifestu to:

source: Command
pl: Polecenie

source: Description
pl: Opis

source: include all files matching any of the listed patterns
pl: załącz wszystkie pliki pasujące do któregokolwiek wzorca

source: exclude all files matching any of the listed patterns
pl: wyłącz wszystkie pliki pasujące nazwą do któregokolwiek z wzorców

source: :command:`recursive-include dir pat1 pat2 ...`
pl: :command:`recursive-include kat pat1 pat2 ...`

source: include all files under *dir* matching any of the listed patterns
pl: załącz wszystkie pliki pod *kat* pasujące do któregokolwiek z wzorców

source: :command:`recursive-exclude dir pat1 pat2 ...`
pl: :command:`recursive-exclude kat pat1 pat2 ...`

source: exclude all files under *dir* matching any of the listed patterns
pl: wyłącz wszystkie pliki pod *kat* pasujące do któregokolwiek z wzorców na liście

source: include all files anywhere in the source tree matching --- & any of the listed patterns
pl: załącz wszystkie pliki gdziekolwiek w drzewie źródłowym pasujące --- do któregokolwiek z wymienionych wzorców

source: exclude all files anywhere in the source tree matching --- & any of the listed patterns
pl: wyłącz wszystkie pliki gdziekolwiek w źródłowym drzewie pasujące nazwą --- do któregokolwiek z wymienionych wzorców

source: exclude all files under *dir*
pl: wyłącz wszsytkie pliki w katalogu *dir*

source: include all files under *dir*
pl: załącz wszystkie pliki w katalogu *dir*

source: The patterns here are Unix-style "glob" patterns: ``*`` matches any sequence of regular filename characters, ``?`` matches any single regular filename character, and ``[range]`` matches any of the characters in *range* (e.g., ``a-z``, ``a-zA-Z``, ``a-f0-9_.``). The definition of "regular filename character" is platform-specific: on Unix it is anything except slash; on Windows anything except backslash or colon.
pl: Wzorce tutaj są w stylu Unix-owym "glob"-wzorcami: ``*`` dopasowuje do dowolnego ciągu zwykłych znaków nazwy pliku, ``?`` dopasowuje jeden zwykły znak nazwy pliku, a ``[zakres]`` dopasowuje którekolwiek znaki z zakresu (np. ``a-z``, ``a-zA-Z``, ``a-f0-9_.``). Definicja "zwykłego znaku nazwy pliku" jest zależna od maszyny/środowiska: na Unix-ie to wszystko oprócz ukośnika; w Windows wszystko oprócz skośnika lub dwukropka.
