Repository: python/python-docs-pl
Catalog: distutils/introduction.po
Languages: pl

source: An Introduction to Distutils
pl: Wprowadzenie do Distutils

source: This document is being retained solely until the ``setuptools`` documentation at https://setuptools.readthedocs.io/en/latest/setuptools.html independently covers all of the relevant information currently included here.
pl: Ten dokument jest przechowywany wyłącznie do czasu, gdy dokumentacja ``setuptools`` pod adresem https://setuptools.readthedocs.io/en/latest/setuptools.html niezależnie obejmie wszystkie istotne informacje, które są tutaj zawarte.

source: This document covers using the Distutils to distribute your Python modules, concentrating on the role of developer/distributor: if you're looking for information on installing Python modules, you should refer to the :ref:`install-index` chapter.
pl: Ten dokument opisuje użycie Distutils do dystrybucji twoich modułów języka pytonowskiego koncentrując się na roli twórcy/dystrybutora: jeśli szukasz informacji o instalowaniu modułów języka pytonowskiego powinieneś odwołać się do rozdziału :ref:`install-index`.

source: Concepts & Terminology
pl: Pojęcia i terminologia

source: Using the Distutils is quite simple, both for module developers and for users/administrators installing third-party modules. As a developer, your responsibilities (apart from writing solid, well-documented and well-tested code, of course!) are:
pl: Użycie Distutils jest całkiem proste, zarówno dla twórców modułów jak i dla użytkowników/administratorów instalujących moduły ze strony osób trzecich. Jako twórca, twoim zadaniem (poza pisaniem porządnego, dobrze udokumentowanego i dobrze przetestowanego kodu, rzecz jasna!) są:

source: write a setup script (:file:`setup.py` by convention)
pl: napisanie skryptu instalacyjnego (pliku :file:`setup.py` - zgodnie ze zwyczajem)

source: (optional) write a setup configuration file
pl: (opcjonalnie) napisanie pliku konfiguracji instalacji

source: create a source distribution
pl: utworzenie dystrybucji źródłowej

source: (optional) create one or more built (binary) distributions
pl: (nadobowiązkowe) stworzyć jedną lub więcej zbudowaną (binarną) dystrybucję

source: Each of these tasks is covered in this document.
pl: Każde z tych zadań jest opisane w tym dokumencie.

source: Not all module developers have access to a multitude of platforms, so it's not always feasible to expect them to create a multitude of built distributions. It is hoped that a class of intermediaries, called *packagers*, will arise to address this need. Packagers will take source distributions released by module developers, build them on one or more platforms, and release the resulting built distributions. Thus, users on the most popular platforms will be able to install most popular Python module distributions in the most natural way for their platform, without having to run a single setup script or compile a line of code.
pl: Nie wszyscy twórcy mają dostęp do wielu maszyn/środowisk, więc nie zawsze rozsądne jest oczekiwanie od nich tworzenia wielu zbudowanych dystrybucji. Jest oczekiwane że pewien zbiór pośredników, zwanych *pakowaczami*, powstanie aby zaradzić tym potrzebom. Pakowacze biorą dystrybucje źródłowe wypuszczonych przez twórców modułów, budują je na jednej lub większej liczbie maszyn/środowisk, i wypuszczają wynikłe zbudowane dystrybucje. Zatem, użytkownicy większości popularnych platform będą w stanie instalować większość popularnych dystrybucji modułów języka pytonowskiego w najbardziej naturalny sposób dla ich maszyn/środowisk, bez konieczności uruchomienia nawet jednego skryptu instalacyjnego ani kompilowania ani jednej linijki kodu.

source: A Simple Example
pl: Prosty przykład

source: The setup script is usually quite simple, although since it's written in Python, there are no arbitrary limits to what you can do with it, though you should be careful about putting arbitrarily expensive operations in your setup script. Unlike, say, Autoconf-style configure scripts, the setup script may be run multiple times in the course of building and installing your module distribution.
pl: Skrypt instalacyjny jest zwykle raczej prosty, chociaż jako że jest pisany w Pythonie, nie ma odgórnych granic co można z nim zrobić, chociaż powinieneś być ostrożny w umieszczaniu dowolnie kosztownych operacji w swoim skrypcie instalacyjnym. W przeciwieństwie do dajmy na to skryptów konfiguracyjnych w stylu Autoconf-a, skrypt instalacyjny może być uruchamiany kilka razy w trakcie budowania i instalowania twojej dystrybucji modułu.

source: If all you want to do is distribute a module called :mod:`foo`, contained in a file :file:`foo.py`, then your setup script can be as simple as this::
pl: Jeśli wszystkim czego chcesz dokonać jest dystrybuowanie modułu nazwanego :mod:`foo` zawartego w pliku :file:`foo.py` wtedy twój plik skryptu instalacyjnego może być tak prosty jak::

source: Some observations:
pl: Pewne obserwacje

source: most information that you supply to the Distutils is supplied as keyword arguments to the :func:`setup` function
pl: większość informacji które dostarczasz do Distutils jest podawana jako parametry słów kluczowych do zadania :func:`setup`.

source: those keyword arguments fall into two categories: package metadata (name, version number) and information about what's in the package (a list of pure Python modules, in this case)
pl: te parametry słów kluczowych należą do dwóch kategorii: informacje o danych pakietu (- z ang. - metadata) (nazwa, numer wersji) i informacja o tym co jest w pakiecie (lista czysto pytonowskich modułów, w tym przypadku)

source: modules are specified by module name, not filename (the same will hold true for packages and extensions)
pl: moduły są określone przez nazwę modułu nie nazwę pliku (to samo odnosi się do pakietów i rozszerzeń)

source: it's recommended that you supply a little more metadata, in particular your name, email address and a URL for the project (see section :ref:`setup-script` for an example)
pl: polecane jest abyś dostarczył nieco więcej informacji o danych, w szczególności swoje imię, adres email i URL projektu (sięgnij do rozdziału :ref:`setup-script` po przykład)

source: which will ultimately copy :file:`foo.py` to the appropriate directory for third-party modules in their Python installation.
pl: które ostatecznie kopiują plik :file:`foo.py` do odpowiedniego katalogu dla modułów pochodzących od osób trzecich w ich instalacji języka pytonowskiego.

source: This simple example demonstrates some fundamental concepts of the Distutils. First, both developers and installers have the same basic user interface, i.e. the setup script. The difference is which Distutils *commands* they use: the :command:`sdist` command is almost exclusively for module developers, while :command:`install` is more often for installers (although most developers will want to install their own code occasionally).
pl: Ten prosty przykład demonstruje pewne podstawowe pojęcia Distutils. Po pierwsze zarówno twórcy modułów jak i instalujący je mają ten sam podstawowy sprzęg użytkownika tj. skrypt instalacyjny. Różnica polega na tym, którego *polecenia* ( - z ang. - *command* ) Distutils używają: polecenie :command:`sdist` jest prawie wyłącznie dla twórców modułów, podczas gdy :command:`install` jest częściej dla instalujących (chociaż większość twórców też będzie chciała zainstalować swój własny kod czasami).

source: Other useful built distribution formats are RPM, implemented by the :command:`bdist_rpm` command, Solaris :program:`pkgtool` (:command:`bdist_pkgtool`), and HP-UX :program:`swinstall` (:command:`bdist_sdux`). For example, the following command will create an RPM file called :file:`foo-1.0.noarch.rpm`::
pl: Inne użyteczne formaty dystrybucji to RPMy, wypełnione przez polecenie :command:`bdist_rpm`, program :program:`pkgtootl` Solarisa (:command:`bdist_pkgtool`), i program swinstall` dla HP-UX (:command:`bdist_sdux`). Na przykład, następujące polecenie utworzy plik RPM nazwany :file:`foo-1.0.noarch.rpm`::

source: (The :command:`bdist_rpm` command uses the :command:`rpm` executable, therefore this has to be run on an RPM-based system such as Red Hat Linux, SuSE Linux, or Mandrake Linux.)
pl: (Polecenie :command:`bdist_rpm` używa polecenia wykonywalnego :command:`rpm`, zatem musi to być uruchamiane na opartym o RPMy systemie takim jak Linux Red Hat, Linux SuSE, lub Linux Mandrake.)

source: You can find out what distribution formats are available at any time by running ::
pl: Możesz dowiedzieć się o tym które formaty dystrybucji są dostępne w każdej chwili uruchamiając::

source: General Python terminology
pl: Ogólne terminy języka pytonowskiego

source: If you're reading this document, you probably have a good idea of what modules, extensions, and so forth are. Nevertheless, just to be sure that everyone is operating from a common starting point, we offer the following glossary of common Python terms:
pl: Jeśli czytasz ten dokument, pewnie masz dobre pojęcie czym są moduły, rozszerzenia, itd. itp. Tym nie mniej, aby się upewnić że wszyscy operują ze wspólnego punktu początkowego, oferujemy następujący słowniczek wspólnych terminów języka pytonowskiego:

source: module
pl: moduł

source: the basic unit of code reusability in Python: a block of code imported by some other code. Three types of modules concern us here: pure Python modules, extension modules, and packages.
pl: podstawowa miara powtórnej użyteczności kodu w języku pytonowskim: blok kodu zaimportowany przez inny kod. Trzy typy modułów interesują nas tutaj: moduły czysto pytonowskie, moduły rozszerzające, i pakiety.

source: extension module
pl: moduł rozszerzenia

source: a module written in the low-level language of the Python implementation: C/C++ for Python, Java for Jython. Typically contained in a single dynamically loadable pre-compiled file, e.g. a shared object (:file:`.so`) file for Python extensions on Unix, a DLL (given the :file:`.pyd` extension) for Python extensions on Windows, or a Java class file for Jython extensions. (Note that currently, the Distutils only handles C/C++ extensions for Python.)
pl: moduł napisany w niskopoziomowym języku wypełnienia języka pytonowskiego: C/C++ dla języka pytonowskiego, Java dla języka Jytonowskiego. Typowo zawarty w pojedynczym dynamicznie ładowalnym uprzednio skompilowanym pliku, np. plik współdzielonych obiektów (- z ang. shared object - w skrócie so - :file:`.so`) dla rozszerzeń języka pytonowskiego dla Unix, i DLL (mając dane rozszerzenie :file:`.pyd`) dla rozszerzeń języka pytonowskiego na Windowsie, lub plik uogólnienia Javy dla języka rozszerzeń języka jytonowskiego. (Zauważ, że obecnie, Distutils obsługuje tylko rozszerzenia C/C++ dla języka pytonowskiego.)

source: a module that contains other modules; typically contained in a directory in the filesystem and distinguished from other directories by the presence of a file :file:`__init__.py`.
pl: moduł który zawiera inne moduły; typowo przechowywany w katalogu w systemie plików i rozróżniany od innych katalogów przez obecność pliku :file:`__init__.py`.

source: the root of the hierarchy of packages. (This isn't really a package, since it doesn't have an :file:`__init__.py` file. But we have to call it something.) The vast majority of the standard library is in the root package, as are many small, standalone third-party modules that don't belong to a larger module collection. Unlike regular packages, modules in the root package can be found in many directories: in fact, every directory listed in ``sys.path`` contributes modules to the root package.
pl: Korzeń hierarchii pakietów. (To nie jest właściwie pakiet, gdyż nie ma pliku :file:`__init__.py`. Ale musimy jakoś go nazwać.) Znaczna większość standardowej biblioteki jest w pakiecie korzenia, tak jak wiele małych, samodzielnych modułów osób-trzecich, które nie pasują do większej kolekcji modułów. W przeciwieństwie do typowych pakietów, moduły w pakiecie korzenia można znaleźć w wielu katalogach: w rzeczywistości, każdy katalog wypisany w ``sys.path`` dokłada moduły do pakietu korzenia.

source: Distutils-specific terminology
pl: Terminologia szczególna dla Distutils

source: The following terms apply more specifically to the domain of distributing Python modules using the Distutils:
pl: Następujące terminy odnoszą się bardziej szczególnie do domeny dystrybucji modułów pytonowskich przy użyciu Distutils:

source: a module distribution that contains only pure Python modules and packages. Sometimes referred to as a "pure distribution."
pl: dystrybucja modułów która zawiera tylko czysto pytonowskie moduły i pakiety. Czasami określana mianem "czystej dystrybucji."

source: a module distribution that contains at least one extension module. Sometimes referred to as a "non-pure distribution."
pl: dystrybucja modułu która zawiera przynajmniej jeden moduł rozszerzeń. Czasami określana jako "nie-czysta dystrybucja."

source: the top-level directory of your source tree (or source distribution); the directory where :file:`setup.py` exists. Generally :file:`setup.py` will be run from this directory.
pl: Nadrzędnego poziomu katalog twojego drzewa źródeł (inaczej dystrybucji źródeł); katalog w którym plik :file:`setup.py` jest umieszczony. Ogólnie plik :file:`setup.py` będzie uruchomiony z tego katalogu.
