Repository: python/python-docs-pl
Catalog: distutils/setupscript.po
Languages: pl

source: Package data can be added to packages using the ``package_data`` keyword argument to the :func:`setup` function. The value must be a mapping from package name to a list of relative path names that should be copied into the package. The paths are interpreted as relative to the directory containing the package (information from the ``package_dir`` mapping is used if appropriate); that is, the files are expected to be part of the package in the source directories. They may contain glob patterns as well.
pl: Dane pakietu mogą być dodawane do pakietów używając słowa kluczowego ``package_data`` - z ang. - ``danych pakietu`` parametru dla zadania :func:`setup`. Wartość musi być mapowaniem z nazwy pakietu na listę odnoszących się nazw ścieżek które powinny zostać skopiowane do pakietu. Ścieżki są interpretowane jako względne do katalogu zawierającego pakiet (informacja z mapowania ``package_dir`` jest używana jeśli jest to właściwe); to jest, pliki oczekiwane są aby były częścią pakietu w katalogach źródłowych. Mogą zawierać znaczniki "globalne" także.

source: The path names may contain directory portions; any necessary directories will be created in the installation.
pl: Nazwy ścieżek mogą zawierać porcje katalogów; wszystkie konieczne katalogi zostaną utworzone w instalacji.

source: For example, if a package should contain a subdirectory with several data files, the files can be arranged like this in the source tree::
pl: Na przykład, jeśli pakiet zawiera podkatalog z wieloma plikami danych, pliki mogą być ułożone w taki sposób w drzewie źródłowym::

source: The corresponding call to :func:`setup` might be::
pl: Odpowiadające wezwanie zadania :func:`setup` mogłoby być::

source: Installing Additional Files
pl: Instalowanie dodatkowych plików

source: Additional meta-data
pl: Dodatkowe dane o danych

source: The setup script may include additional meta-data beyond the name and version. This information includes:
pl: Skrypt instalacyjny może zawierać dodatkowe dane pośrednie poza nazwą i wersją. Te informacje zawierają:

source: Meta-Data
pl: dane-o-danych

source: Description
pl: Opis

source: Value
pl: Wartość

source: Notes
pl: Notatki

source: ``name``
pl: ``nazwa``

source: name of the package
pl: nazwa pakietu

source: short string
pl: krótki ciąg znaków

source: ``version``
pl: ``wersja``

source: version of this release
pl: wersja tego wydania

source: ``author``
pl: ``autor``

source: package author's name
pl: nazwisko i imie autora pakietu

source: ``author_email``
pl: ``adres_email_autora``

source: email address of the package author
pl: adres email autora pakietu

source: email address
pl: adres email

source: ``maintainer``
pl: ``zarządca``

source: package maintainer's name
pl: imie (i nazwisko) zarządcy pakietu

source: ``maintainer_email``
pl: ``adres_email_zarządcy``

source: email address of the package maintainer
pl: adres email zarządcy pakietu

source: home page for the package
pl: adres strony domowej pakietu

source: ``description``
pl: ``opis``

source: short, summary description of the package
pl: krótki opis podsumowujący pakietu

source: ``long_description``
pl: ``dlugi_opis``

source: longer description of the package
pl: dłuższy opis pakietu

source: long string
pl: długi ciąg znaków

source: ``download_url``
pl: ``adres_sciagniecia``

source: location where the package may be downloaded
pl: miejsce skąd pakiet może być pobrany

source: ``classifiers``
pl: ``klasyfikatory``

source: a list of classifiers
pl: lista klasyfikatorów

source: list of strings
pl: lista ciągów znaków

source: ``platforms``
pl: ``maszyny_srodowiska``

source: a list of platforms
pl: lista maszyn/środowisk

source: ``license``
pl: ``licencja``

source: license for the package
pl: licencja pakietu

source: Notes:
pl: Uwagi:

source: These fields are required.
pl: Te pola są wymagane.

source: It is recommended that versions take the form *major.minor[.patch[.sub]]*.
pl: Jest zalecane aby wersja miała postać *major.minor[.patch[.sub]]*.

source: The ``license`` field is a text indicating the license covering the package where the license is not a selection from the "License" Trove classifiers. See the ``Classifier`` field. Notice that there's a ``licence`` distribution option which is deprecated but still acts as an alias for ``license``.
pl: Pole ``licencja`` - z ang. - ``license`` jest tekstem oznaczającym licencję ochraniającą pakiet gdzie licencja nie jest wybrana z klasyfikacji "Licencji" Znaleźnych. Zobacz pole ``Classifier`` - ``klasyfikator``. Zauważ, że istnieje opcja dystrybucji ``licencji`` która choć jest przestarzała ale wciąż służy jako synonim ``licencji``.

source: A single line of text, not more than 200 characters.
pl: Pojedyncza linia tekstu, nie więcej niż 200 znaków.

source: See below.
pl: Zob poniżej.

source: Encoding the version information is an art in itself. Python packages generally adhere to the version format *major.minor[.patch][sub]*. The major number is 0 for initial, experimental releases of software. It is incremented for releases that represent major milestones in a package. The minor number is incremented when important new features are added to the package. The patch number increments when bug-fix releases are made. Additional trailing version information is sometimes used to indicate sub-releases. These are "a1,a2,...,aN" (for alpha releases, where functionality and API may change), "b1,b2,...,bN" (for beta releases, which only fix bugs) and "pr1,pr2,...,prN" (for final pre-release release testing). Some examples:
pl: Kodowanie informacji o wersji jest sztuką samą w sobie. Pakiety języka pytonowskiego zwykle stosują się do formatu wersji *główna.poboczna[.łatka][pod]*. Główny numer jest 0 w początkowych eksperymentalnych wydaniach oprogramowania. Jest zwiększane dla wydań, które reprezentują główne kroki milowe w pakiecie. Liczba poboczna jest zwiększana gdy istotne nowe własności są dodawane do pakietu. Numer łatki zwiększa się gdy naprawy błędów są robione. Dodatkowe informacje o wersji kończące są czasem używane do zaznaczenia pod-wydań. To są "a1,a2,...,aN" (dla wydań alfa gdzie działanie i sprzęgi programowania mogą ulec zmianie), "b1,b2,...,bN" (dla wydań beta, które tylko naprawiają błędy) i "pr1,pr2,...,prN" (dla końcowych testów wydań przed-wydaniem). Niektóre przykłady:

source: the first, experimental release of a package
pl: pierwsze, eksperymentalne wydanie pakietu

source: the second alpha release of the first patch version of 1.0
pl: drugie wydanie alpha pierwszej łatki w wersji 1.0

source: Debugging the setup script
pl: Odpluskwianie skryptu instalacyjnego

source: Sometimes things go wrong, and the setup script doesn't do what the developer wants.
pl: Czasami sprawy źle idą, i skrypt instalacyjny nie robi tego czego chce twórca oprogramowania.

source: Distutils catches any exceptions when running the setup script, and print a simple error message before the script is terminated. The motivation for this behaviour is to not confuse administrators who don't know much about Python and are trying to install a package. If they get a big long traceback from deep inside the guts of Distutils, they may think the package or the Python installation is broken because they don't read all the way down to the bottom and see that it's a permission problem.
pl: Distutils przechwytuje wszelkie wyjątki gdy uruchamiasz skrypt instalacyjny, i wypisuje prosty komunikat o błędzie zanim skrypt zostanie zakończony. Motywacją dla tego zachowania jest to aby nie wprowadzać zamieszania administratora który nie wie za wiele o języku pytonowskim i próbuje zainstalować pakiet. Jeśli dostanie długi duży wypis z głębi gardzieli Distutils, mogą pomyśleć że pakiet lub instalacja języka pytonowskiego jest popsuta gdyż nie przeczytali wszystkiego do dna i będą sądzić że jest to błąd dostępu.
