Repository: python/python-docs-pl
Catalog: distutils/setupscript.po
Languages: pl

source: Writing the Setup Script
pl: Pisanie Skryptu Instalacyjnego

source: This document is being retained solely until the ``setuptools`` documentation at https://setuptools.readthedocs.io/en/latest/setuptools.html independently covers all of the relevant information currently included here.
pl: Ten dokument jest przechowywany wyłącznie do czasu, gdy dokumentacja ``setuptools`` pod adresem https://setuptools.readthedocs.io/en/latest/setuptools.html niezależnie obejmie wszystkie istotne informacje, które są tutaj zawarte.

source: The setup script is the centre of all activity in building, distributing, and installing modules using the Distutils. The main purpose of the setup script is to describe your module distribution to the Distutils, so that the various commands that operate on your modules do the right thing. As we saw in section :ref:`distutils-simple-example` above, the setup script consists mainly of a call to :func:`setup`, and most information supplied to the Distutils by the module developer is supplied as keyword arguments to :func:`setup`.
pl: Skrypt instalacyjny jest w centrum wszystkich czynności podczas budowania, rozprowadzania i instalowania modułów przy użyciu Distutils. Głównym zadaniem skryptu instalacyjnego jest opisanie dystrybucji twojego modułu dla Distutils, tak aby różne polecenia które operują na twoich modułach robiły to prawidłowo. Jak widzieliśmy w rozdziale :ref:`distutils-simple-example` powyżej, skrypt instalacyjny składa się głównie z wywołania zadania :func:`setup`, i większość informacji dostarczonych do Distutils przez twórcę modułu jest dostarczonych jako parametrów kluczowych dla zadania :func:`setup`.

source: Here's a slightly more involved example, which we'll follow for the next couple of sections: the Distutils' own setup script. (Keep in mind that although the Distutils are included with Python 1.6 and later, they also have an independent existence so that Python 1.5.2 users can use them to install other module distributions. The Distutils' own setup script, shown here, is used to install the package into Python 1.5.2.) ::
pl: Tutaj jest trochę bardziej zaangażowany przykład, który będziemy śledzić przez następne parę rozdziałów: własny skrypt instalacyjny Distutils. (Pamiętaj, że chociaż Distutils są zawarte w języku pytonowskim 1.6 i wyższej, Distutils istnieją także niezależnie, tak, że użytkownicy języka pytonowskiego w wersji 1.5.2 mogą używać ich aby zainstalować dystrybucje innych modułów. Własny skrypt instalacyjny Distutils, pokazany tutaj, używany jest tutaj do zainstalowania pakietu dla języka pytonowskiego 1.5.2.) ::

source: There are only two differences between this and the trivial one-file distribution presented in section :ref:`distutils-simple-example`: more metadata, and the specification of pure Python modules by package, rather than by module. This is important since the Distutils consist of a couple of dozen modules split into (so far) two packages; an explicit list of every module would be tedious to generate and difficult to maintain. For more information on the additional meta-data, see section :ref:`meta-data`.
pl: Istnieją tylko dwie różnice pomiędzy tą i prostą jedno-plikową dystrybucją prezentowaną w rozdziale :ref:`distutils-simple-example`: więcej danych, i wyszczególnienie czysto pytonowskich modułów "przez pakiet", zamiast przez nazwę modułu. Jest to istotne skoro Distutils składają się z paru modułów rozdzielonych na (jak dotejpory) dwa pakiety; jawną listę wszystkich modułów byłaby żmudna w wytworzeniu i trudna w utrzymaniu. Po więcej informacji o dodatkowych danych o danych, sięgnij do rozdziału :ref:`meta-data` ( - z ang. - meta-dane - dane o danych).

source: Note that any pathnames (files or directories) supplied in the setup script should be written using the Unix convention, i.e. slash-separated. The Distutils will take care of converting this platform-neutral representation into whatever is appropriate on your current platform before actually using the pathname. This makes your setup script portable across operating systems, which of course is one of the major goals of the Distutils. In this spirit, all pathnames in this document are slash-separated.
pl: Zauważ, że jakiekolwiek nazwy ścieżek (plików lub katalogów) dostarczony w skrypcie instalacyjnym powinien być napisany używając konwencji Unixa, tj. separowanej-ukośnikami. Distutils zajmie się zamianą reprezentacji obojętnej wobec maszyny/środowiska zanim użycie ścieżki będzie możliwe. To sprawia że twój skrypt instalacyjny jest przenośny pomiędzy systemami operacyjnymi, co oczywiście jest jednym z głównych celów Distutils. W tym duchu nazwy ścieżek dostępu w tym dokumencie są separowane ukośnikiem.

source: This, of course, only applies to pathnames given to Distutils functions. If you, for example, use standard Python functions such as :func:`glob.glob` or :func:`os.listdir` to specify files, you should be careful to write portable code instead of hardcoding path separators::
pl: To rzecz jasna, stosuje się tylko do nazw ścieżek danych dla zadań Distutils. Jeśli na przykład używasz zadań standardowych języka pytonowskiego takich jak :func:`glob.glob` lub :func:`os.listdir` aby określać pliki, powinieneś uważać aby pisać przenośny kod zamiast go usztywniać w sprawie separatorów ścieżek::

source: Listing whole packages
pl: Tworzenie list całych pakietów

source: in your setup script. The keys to this dictionary are package names, and an empty package name stands for the root package. The values are directory names relative to your distribution root. In this case, when you say ``packages = ['foo']``, you are promising that the file :file:`lib/foo/__init__.py` exists.
pl: w swoim skrypcie instalacyjnym. Kluczami do tego słownika są nazwy pakietów, a nazwa pakietu pustego oznacza pakiet nadrzędny ( - z ang. - dosł. - "root package"). Wartościami są nazwy katalogów względne wobec katalogu głównego dystrybucji. W tym przypadku gdy mówisz ``packages = ['foo']``, składasz obietnicę że plik :file:`lib/foo/__init__.py` istnieje.

source: Another possible convention is to put the :mod:`foo` package right in :file:`lib`, the :mod:`foo.bar` package in :file:`lib/bar`, etc. This would be written in the setup script as ::
pl: Inną możliwą konwencją jest umieszczenie pakietu :mod:`foo` od razu w katalogu :file:`lib`, pakietu :mod:`foo.bar` w katalogu :file:`lib/bar` itd. To byłoby zapisane w skrypcie instalacyjnym jako ::

source: Listing individual modules
pl: Tworzenie list pojedynczych modułów

source: For a small module distribution, you might prefer to list all modules rather than listing packages---especially the case of a single module that goes in the "root package" (i.e., no package at all). This simplest case was shown in section :ref:`distutils-simple-example`; here is a slightly more involved example::
pl: Dla małej dystrybucji modułu, mógłbyś chcieć wypisać wszystkie moduły zamiast wypisywać pakiety---szczególnie w przypadku pojedynczego modułu, który wchodzi w skład "nadrzędnego pakietu" - z ang. - "root package" (tj. żadnego pakietu wcale). Najprostszy przypadek został pokazany w sekcji :ref:`distutils-simple-example`; tutaj jest pokazany trochę bardziej zaangażowany przykład::

source: Describing extension modules
pl: Opisywanie modułów rozszerzających

source: Just as writing Python extension modules is a bit more complicated than writing pure Python modules, describing them to the Distutils is a bit more complicated. Unlike pure modules, it's not enough just to list modules or packages and expect the Distutils to go out and find the right files; you have to specify the extension name, source file(s), and any compile/link requirements (include directories, libraries to link with, etc.).
pl: Tak jak pisanie modułów rozszerzających języka pytonowskiego jest trochę bardziej skomplikowane niż pisanie czystych modułów języka pytonowskiego, opisywanie ich dla Distutils jest trochę bardziej skomplikowane. W przeciwieństwie do modułów czysto pytonowskich, nie wystarczy po prostu wypisać po prostu wszystkich modułów lub pakietów i oczekiwać, że Distutils znajdzie właściwe pliki; musisz określić nazwę rozszerzenia, plik(i) źródłowe, i wszystkie wymagania kompilacji i łączenia plików wynikowych (katalogi załączane, biblioteki z którymi nastąpi łączenie, itd.).

source: The :class:`Extension` class can be imported from :mod:`distutils.core` along with :func:`setup`. Thus, the setup script for a module distribution that contains only this one extension and nothing else might be::
pl: Uogólnienie :class:`Extension` może być importowane z modułu :mod:`distutils.core` razem z zadaniem :func:`setup`. Zatem skrypt instalacyjny dla dystrybucji modułu, który zawiera tylko to rozszerzenie i nic więcej mógłby wyglądać::

source: The :class:`Extension` class (actually, the underlying extension-building machinery implemented by the :command:`build_ext` command) supports a great deal of flexibility in describing Python extensions, which is explained in the following sections.
pl: Uogólnienie :class:`Extension` (właściwie leżąca pod spodem machina budowania rozszerzeń wypełniona przez polecenie :command:`build_ext` daje całkiem sporo możliwości w opisywaniu rozszerzeń języka pytonowskiego, które są opisywane w następnych paragrafach.

source: Extension names and packages
pl: Nazwy i pakiety rozszerzeń.

source: describes an extension that lives in the root package, while ::
pl: opisuje rozszerzenie które przebywa w nadrzędnym pakiecie, podczas gdy::

source: describes the same extension in the :mod:`pkg` package. The source files and resulting object code are identical in both cases; the only difference is where in the filesystem (and therefore where in Python's namespace hierarchy) the resulting extension lives.
pl: opisuje tożsame rozszerzenie w pakiecie :mod:`pkg`. Pliki źródłowe i wynikający kod obiektowy są identyczne w obu przypadkach; jedyną różnicą jest gdzie w systemie plików (i stąd też gdzie w hierarchii przestrzeni nazw) wynikające rozszerzenie będzie przebywać.

source: will compile :file:`foo.c` to the extension :mod:`pkg.foo`, and :file:`bar.c` to :mod:`pkg.subpkg.bar`.
pl: skompiluje plik :file:`foo.c` do rozszerzenia :mod:`pkg.foo`, i plik :file:`bar.c` do :mod:`pkg.subpkg.bar`.

source: Extension source files
pl: pliki źródłowe rozszerzenia

source: However, you can also include SWIG interface (:file:`.i`) files in the list; the :command:`build_ext` command knows how to deal with SWIG extensions: it will run SWIG on the interface file and compile the resulting C/C++ file into your extension.
pl: Jednakże, możesz też załączyć sprzęg plików SWIG (:file:`.i`) na liście; polecenie :command:`build_ext` wie jak radzić sobie z rozszerzeniami SWIG: uruchomi SWIG na pliku sprzęgu i skompiluje wynikający plik C/C++ do twojego rozszerzenia.

source: This warning notwithstanding, options to SWIG can be currently passed like this::
pl: Pomimo tego ostrzeżenia, opcje dla sprzęgu SWIG mogą być obecnie przekazywane w następujący sposób::

source: Or on the commandline like this::
pl: Lub w wierszu poleceń w następujący sposób::

source: On some platforms, you can include non-source files that are processed by the compiler and included in your extension. Currently, this just means Windows message text (:file:`.mc`) files and resource definition (:file:`.rc`) files for Visual C++. These will be compiled to binary resource (:file:`.res`) files and linked into the executable.
pl: Na niektórych maszynach/środowiskach, możesz załączyć nie-źródłowe pliki które są przetwarzane przez kompilator i załączane w twoim rozszerzeniu. Obecnie, to po prostu oznacza pliki Windowsowych wiadomości tekstowych (:file:`.mc`) i definicji zasobów (:file:`.rc`) dla Visual C++. Te będą skompilowane do plików zasobów binarnych (:file:`.res`) i połączonych w plik wykonywalny.

source: Preprocessor options
pl: Opcje preprocesora

source: For example, if your extension requires header files in the :file:`include` directory under your distribution root, use the ``include_dirs`` option::
pl: Dla przykładu, jeśli twoje rozszerzenie wymaga pliku nagłówkowego w katalogu :file:`include` pod twoim katalogiem nadrzędnym dystrybucji, użyj opcji ``include_dirs`` ::

source: You can specify absolute directories there; if you know that your extension will only be built on Unix systems with X11R6 installed to :file:`/usr`, you can get away with ::
pl: Możesz także określić bezwzględne ścieżki katalogów tutaj; jeśli wiesz że twoje rozszerzenie będzie budowane tylko na systemie Unix-owym z X11R6 zainstalowanym do pliku :file:`/usr`, może Ci ujść na sucho nawet::

source: You should avoid this sort of non-portable usage if you plan to distribute your code: it's probably better to write C code like ::
pl: Powinieneś unikać tego rodzaju nie-przenośnego użycia jeśli planujesz rozprowadzać swój kod: jest prawdopodobnie dużo lepiej pisać kod C w następujący sposób ::

source: If you must put the :file:`Numerical` include directory right into your header search path, though, you can find that directory using the Distutils :mod:`distutils.sysconfig` module::
pl: Jeśli jednak musisz wstawić katalog załączeń :file:`Numerical` w całości do twojej ścieżki poszukiwań nagłówków, jednakże, możesz znaleźć ten katalog używając modułu :mod:`distutils.sysconfig` Distutils::

source: Even though this is quite portable---it will work on any Python installation, regardless of platform---it's probably easier to just write your C code in the sensible way.
pl: Chociaż nawet to jest całkiem przenośne---będzie działać na każdej instalacji języka pytonowskiego, niezależnie od maszyny/środowiska---jest prawdopodobnie dużo łatwiej po prostu napisać twój kod C w rozsądny sposób.

source: You can define and undefine pre-processor macros with the ``define_macros`` and ``undef_macros`` options. ``define_macros`` takes a list of ``(name, value)`` tuples, where ``name`` is the name of the macro to define (a string) and ``value`` is its value: either a string or ``None``. (Defining a macro ``FOO`` to ``None`` is the equivalent of a bare ``#define FOO`` in your C source: with most compilers, this sets ``FOO`` to the string ``1``.) ``undef_macros`` is just a list of macros to undefine.
pl: Możesz definiować i odwoływać definicje makropoleceń pre-procesora za pomocą opcji ``define_macros`` i ``undef_macros``. ``define_macros`` bierze listę ``(nazwy, wartości)`` par-krotek, gdzie ``nazwa`` jest nazwą makropolecenia do zdefiniowania (ciągiem znaków) i ``wartość`` jest jej wartością: albo ciągiem znaków albo ``None``. Definiowanie makropolecenia ``FOO`` na ``None`` jest równoznaczne czystej definicji ``#define FOO`` w twoim kodzie C: w większości kompilatorów, to ustawia ``FOO`` na ciąg znaków ``1``. ``undef_macros`` jest po prostu listą makropoleceń do odwołania definicji.

source: For example::
pl: Dla przykładu::

source: is the equivalent of having this at the top of every C source file::
pl: jest jednoznaczne z ustawieniem tego ponad każdym plikiem źródłowym C::

source: Library options
pl: Opcje bibliotek

source: You can also specify the libraries to link against when building your extension, and the directories to search for those libraries. The ``libraries`` option is a list of libraries to link against, ``library_dirs`` is a list of directories to search for libraries at link-time, and ``runtime_library_dirs`` is a list of directories to search for shared (dynamically loaded) libraries at run-time.
pl: Możesz także określić biblioteki do dołączenia gdy budujesz swoje rozszerzenie, i katalogi aby poszukiwać tych bibliotek. Opcja ``biblioteki`` jest listą bibliotek do łączenia, opcja ``library_dirs`` jest listą katalogów do poszukiwania bibliotek w czasie łączenia wynikowego kodu, i ``runtime_library_dirs`` jest listą katalogów do poszukiwania współdzielonych (ładowanych dynamicznie) bibliotek w czasie wykonania.

source: For example, if you need to link against libraries known to be in the standard library search path on target systems ::
pl: Dla przykładu, jeśli potrzebujesz łączyć z bibliotekami znanymi z tego, że są w standardowej ścieżce poszukiwań w docelowym systemie ::

source: If you need to link with libraries in a non-standard location, you'll have to include the location in ``library_dirs``::
pl: Jeśli musisz podłączyć z bibliotekami w nie-standardowym położeniu, musisz załączyć to położenie w opcji ``library_dirs``::

source: (Again, this sort of non-portable construct should be avoided if you intend to distribute your code.)
pl: (Znów, tego rodzaju nie-przenośnych konstrukcji powinno się unikać jeśli zamierzasz rozprowadzać twój kod.)

source: Other options
pl: Inne opcje

source: There are still some other options which can be used to handle special cases.
pl: Istnieją wciąż poza tym inne opcje, które mogą być użyte do radzenia sobie ze szczególnymi przypadkami.

source: Relationships between Distributions and Packages
pl: Relacje pomiędzy dystrybucją a pakietami

source: A distribution may relate to packages in three specific ways:
pl: Dystrybucja może odnosić się do pakietów na trzy szczególne sposoby:

source: It can require packages or modules.
pl: Może wymagać pakietów lub modułów.

source: It can provide packages or modules.
pl: Może dostarczać pakiety lub moduły.

source: It can obsolete packages or modules.
pl: Może powodować że pakiety lub moduły staną się niepotrzebne.

source: These relationships can be specified using keyword arguments to the :func:`distutils.core.setup` function.
pl: Te relacje mogą być określane przy użyciu kluczowych parametrów zadania :func:`distutils.core.setup`.

source: Dependencies on other Python modules and packages can be specified by supplying the *requires* keyword argument to :func:`setup`. The value must be a list of strings. Each string specifies a package that is required, and optionally what versions are sufficient.
pl: Zależności od innych modułów pytonowskich i pakietów mogą być określane przez dostarczenie słowa kluczowego *requires* jako parametru do zadania :func:`setup`. Wartość musi być listą ciągów znaków. Każdy ciąg znaków określa pakiet, który jest wymagany, i opcjonalnie które wersje są wystarczające.

source: To specify that any version of a module or package is required, the string should consist entirely of the module or package name. Examples include ``'mymodule'`` and ``'xml.parsers.expat'``.
pl: Aby określić, że któraś wersja modułu lub pakietu jest wymagana, ciąg znaków powinien składać się w całości z nazwy modułu lub pakietu. Przykłady obejmują ``'mojmodul'`` i ``'xml.parsers.expat'``.

source: If specific versions are required, a sequence of qualifiers can be supplied in parentheses. Each qualifier may consist of a comparison operator and a version number. The accepted comparison operators are::
pl: Jeśli szczególne wersje są wymagane, sekwencja kwalifikatorów może być dostarczona w nawiasach. Każdy kwalifikator może składać się z operatora porównania i numeru wersji. Akceptowane operatory porównania to::

source: These can be combined by using multiple qualifiers separated by commas (and optional whitespace). In this case, all of the qualifiers must be matched; a logical AND is used to combine the evaluations.
pl: Te mogą być łączone przez użycie wielu kwalifikatorów rozdzielonych przecinkami (i nadobowiązkowymi znakami białymi). W tym przypadku, wszystkie kwalifikatory muszą się zgadzać; logiczna koniunkcja jest używana do wiązania wyników.

source: Let's look at a bunch of examples:
pl: Spójrzmy na wiecheć przykładów:

source: Requires Expression
pl: Wyrażenie wymagania

source: Explanation
pl: Wytłumaczenie

source: Only version ``1.0`` is compatible
pl: Tylko wersja ``1.0`` jest zgodna

source: Any version after ``1.0`` and before ``2.0`` is compatible, except ``1.5.1``
pl: Wszystkie wersje po ``1.0`` i przed ``2.0`` są zgodne z wyjątkiem ``1.5.1``

source: Now that we can specify dependencies, we also need to be able to specify what we provide that other distributions can require. This is done using the *provides* keyword argument to :func:`setup`. The value for this keyword is a list of strings, each of which names a Python module or package, and optionally identifies the version. If the version is not specified, it is assumed to match that of the distribution.
pl: Teraz gdy możemy określić zależności, potrzebujemy także móc określić co dostarczamy a czego inne dystrybucje mogłyby wymagać. To jest dokonywane przy użyciu parametru kluczowego *provides* dla zadania :func:`setup`. Wartość tego słowa kluczowego jest listą ciągów znaków, z których każdy nazywa pytonowski moduł lub pakiet, i dodatkowo (nadobowiązkowo) określa wersję. Jeśli wersja nie jest określona, zakładana jest zgodność wersji z wersją dystrybucji.

source: Some examples:
pl: Trochę przykładów:

source: Provides Expression
pl: Wyrażenie dostarczania

source: ``mypkg``
pl: ``mojpakiet``

source: Provide ``mypkg``, using the distribution version
pl: Dostarcza ``mojpakiet``, używając wersji dystrybucji

source: ``mypkg (1.1)``
pl: ``mojpakiet (1.1)``

source: Provide ``mypkg`` version 1.1, regardless of the distribution version
pl: Dostarcz ``mojpakiet`` w wersji 1.1, niezależnie od wersji dystrybucji

source: A package can declare that it obsoletes other packages using the *obsoletes* keyword argument. The value for this is similar to that of the *requires* keyword: a list of strings giving module or package specifiers. Each specifier consists of a module or package name optionally followed by one or more version qualifiers. Version qualifiers are given in parentheses after the module or package name.
pl: Pakiet może deklarować że powoduje że inny pakiet staje się niepotrzebny używając parametru kluczowego *obsoletes*. Wartość tego jest podobna do tej słowa kluczowego *requires*: lista ciągów znaków dających wyszczególnienie modułu lub pakietu. Każdy ciąg wyszczególniający składa się z nazwy modułu lub pakietu po której dodatkowo (nadobowiązkowo) występuje jeden lub więcej kwalifikator wersji. Kwalifikatory wersji dane są w nawiasie po nazwie modułu lub pakietu.

source: The versions identified by the qualifiers are those that are obsoleted by the distribution being described. If no qualifiers are given, all versions of the named module or package are understood to be obsoleted.
pl: Wersje określone przez kwalifikatory to te które stają się zbędne z powodu dystrybucji której dotyczy opis. Jeśli nie są dane żadne kwalifikatory wszystkie wersje nazwanego modułu lub pakietu rozumie się jako zbędne.

source: Installing Scripts
pl: Instalowanie skryptów

source: So far we have been dealing with pure and non-pure Python modules, which are usually not run by themselves but imported by scripts.
pl: Do tej pory zajmowaliśmy się czystymi i nie-czystymi modułami pytonowskimi, które nie są zwykle uruchamiane same przez siebie ale importowane przez skrypty.

source: Installing Package Data
pl: Instalowanie danych pakietu

source: Often, additional files need to be installed into a package. These files are often data that's closely related to the package's implementation, or text files containing documentation that might be of interest to programmers using the package. These files are called :dfn:`package data`.
pl: Często dodatkowe pliki konieczne są do zainstalowania dla pakietu. Te pliki są często plikami danych które są blisko związane z wypełnieniem zadań pakietu, lub plikami tekstowymi zawierającymi dokumentację która może być interesująca dla programisty używającego pakietu. Te pliki zwane są :dfn:`danymi pakietu`.
